helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
#define ADC14_BASE                                         (0x40012000)          /* Base address of module registers */
#define ADC14_MODULE                                       (0x40012000)          /* Base address of module registers */
#define AES256_BASE                                        (0x40003C00)          /* Base address of module registers */
#define AES256_MODULE                                      (0x40003C00)          /* Base address of module registers */
#define CAPTIO0_BASE                                       (0x40005400)          /* Base address of module registers */
#define CAPTIO0_MODULE                                     (0x40005400)          /* Base address of module registers */
#define CAPTIO1_BASE                                       (0x40005800)          /* Base address of module registers */
#define CAPTIO1_MODULE                                     (0x40005800)          /* Base address of module registers */
#define COMP_E0_BASE                                       (0x40003400)          /* Base address of module registers */
#define COMP_E0_MODULE                                     (0x40003400)          /* Base address of module registers */
#define COMP_E1_BASE                                       (0x40003800)          /* Base address of module registers */
#define COMP_E1_MODULE                                     (0x40003800)          /* Base address of module registers */
#define CRC32_BASE                                         (0x40004000)          /* Base address of module registers */
#define CRC32_MODULE                                       (0x40004000)          /* Base address of module registers */
#define CS_BASE                                            (0x40010400)          /* Base address of module registers */
#define CS_MODULE                                          (0x40010400)          /* Base address of module registers */
#define DIO_BASE                                           (0x40004C00)          /* Base address of module registers */
#define DIO_MODULE                                         (0x40004C00)          /* Base address of module registers */
#define DMA_BASE                                           (0x4000E000)          /* Base address of module registers */
#define DMA_MODULE                                         (0x4000E000)          /* Base address of module registers */
#define EUSCI_A0_BASE                                      (0x40001000)          /* Base address of module registers */
#define EUSCI_A0_MODULE                                    (0x40001000)          /* Base address of module registers */
#define EUSCI_A1_BASE                                      (0x40001400)          /* Base address of module registers */
#define EUSCI_A1_MODULE                                    (0x40001400)          /* Base address of module registers */
#define EUSCI_A2_BASE                                      (0x40001800)          /* Base address of module registers */
#define EUSCI_A2_MODULE                                    (0x40001800)          /* Base address of module registers */
#define EUSCI_A3_BASE                                      (0x40001C00)          /* Base address of module registers */
#define EUSCI_A3_MODULE                                    (0x40001C00)          /* Base address of module registers */
#define EUSCI_B0_BASE                                      (0x40002000)          /* Base address of module registers */
#define EUSCI_B0_MODULE                                    (0x40002000)          /* Base address of module registers */
#define EUSCI_B1_BASE                                      (0x40002400)          /* Base address of module registers */
#define EUSCI_B1_MODULE                                    (0x40002400)          /* Base address of module registers */
#define EUSCI_B2_BASE                                      (0x40002800)          /* Base address of module registers */
#define EUSCI_B2_MODULE                                    (0x40002800)          /* Base address of module registers */
#define EUSCI_B3_BASE                                      (0x40002C00)          /* Base address of module registers */
#define EUSCI_B3_MODULE                                    (0x40002C00)          /* Base address of module registers */
#define FLCTL_BASE                                         (0x40011000)          /* Base address of module registers */
#define FLCTL_MODULE                                       (0x40011000)          /* Base address of module registers */
#define FPB_BASE                                           (0xE0002000)          /* Base address of module registers */
#define FPB_MODULE                                         (0xE0002000)          /* Base address of module registers */
#define PCM_BASE                                           (0x40010000)          /* Base address of module registers */
#define PCM_MODULE                                         (0x40010000)          /* Base address of module registers */
#define PMAP_BASE                                          (0x40005000)          /* Base address of module registers */
#define PMAP_MODULE                                        (0x40005000)          /* Base address of module registers */
#define PSS_BASE                                           (0x40010800)          /* Base address of module registers */
#define PSS_MODULE                                         (0x40010800)          /* Base address of module registers */
#define REF_A_BASE                                         (0x40003000)          /* Base address of module registers */
#define REF_A_MODULE                                       (0x40003000)          /* Base address of module registers */
#define RSTCTL_BASE                                        (0xE0042000)          /* Base address of module registers */
#define RSTCTL_MODULE                                      (0xE0042000)          /* Base address of module registers */
#define RTC_C_BASE                                         (0x40004400)          /* Base address of module registers */
#define RTC_C_MODULE                                       (0x40004400)          /* Base address of module registers */
#define SYSCTL_BASE                                        (0xE0043000)          /* Base address of module registers */
#define SYSCTL_MODULE                                      (0xE0043000)          /* Base address of module registers */
#define TIMER32_BASE                                       (0x4000C000)          /* Base address of module registers */
#define TIMER32_MODULE                                     (0x4000C000)          /* Base address of module registers */
#define TIMER_A0_BASE                                      (0x40000000)          /* Base address of module registers */
#define TIMER_A0_MODULE                                    (0x40000000)          /* Base address of module registers */
#define TIMER_A1_BASE                                      (0x40000400)          /* Base address of module registers */
#define TIMER_A1_MODULE                                    (0x40000400)          /* Base address of module registers */
#define TIMER_A2_BASE                                      (0x40000800)          /* Base address of module registers */
#define TIMER_A2_MODULE                                    (0x40000800)          /* Base address of module registers */
#define TIMER_A3_BASE                                      (0x40000C00)          /* Base address of module registers */
#define TIMER_A3_MODULE                                    (0x40000C00)          /* Base address of module registers */
#define TLV_BASE                                           (0x00201000)          /* Base address of module registers */
#define TLV_MODULE                                         (0x00201000)          /* Base address of module registers */
#define WDT_A_BASE                                         (0x40004800)          /* Base address of module registers */
#define WDT_A_MODULE                                       (0x40004800)          /* Base address of module registers */

#define ADC14                                              ((ADC14_Type *) ADC14_BASE)   
#define AES256                                             ((AES256_Type *) AES256_BASE) 
#define CAPTIO0                                            ((CAPTIO0_Type *) CAPTIO0_BASE)
#define CAPTIO1                                            ((CAPTIO1_Type *) CAPTIO1_BASE)
#define COMP_E0                                            ((COMP_E0_Type *) COMP_E0_BASE)
#define COMP_E1                                            ((COMP_E1_Type *) COMP_E1_BASE)
#define CRC32                                              ((CRC32_Type *) CRC32_BASE)   
#define CS                                                 ((CS_Type *) CS_BASE)         
#define DIO                                                ((DIO_Type *) DIO_BASE)       
#define DMA                                                ((DMA_Type *) DMA_BASE)       
#define EUSCI_A0                                           ((EUSCI_A0_Type *) EUSCI_A0_BASE)
#define EUSCI_A1                                           ((EUSCI_A1_Type *) EUSCI_A1_BASE)
#define EUSCI_A2                                           ((EUSCI_A2_Type *) EUSCI_A2_BASE)
#define EUSCI_A3                                           ((EUSCI_A3_Type *) EUSCI_A3_BASE)
#define EUSCI_B0                                           ((EUSCI_B0_Type *) EUSCI_B0_BASE)
#define EUSCI_B1                                           ((EUSCI_B1_Type *) EUSCI_B1_BASE)
#define EUSCI_B2                                           ((EUSCI_B2_Type *) EUSCI_B2_BASE)
#define EUSCI_B3                                           ((EUSCI_B3_Type *) EUSCI_B3_BASE)
#define FLCTL                                              ((FLCTL_Type *) FLCTL_BASE)   
#define FPB                                                ((FPB_Type *) FPB_BASE)       
#define PCM                                                ((PCM_Type *) PCM_BASE)       
#define PMAP                                               ((PMAP_Type *) PMAP_BASE)     
#define PSS                                                ((PSS_Type *) PSS_BASE)       
#define REF_A                                              ((REF_A_Type *) REF_A_BASE)   
#define RSTCTL                                             ((RSTCTL_Type *) RSTCTL_BASE) 
#define RTC_C                                              ((RTC_C_Type *) RTC_C_BASE)   
#define SYSCTL                                             ((SYSCTL_Type *) SYSCTL_BASE) 
#define TIMER32                                            ((TIMER32_Type *) TIMER32_BASE)
#define TIMER_A0                                           ((TIMER_A0_Type *) TIMER_A0_BASE)
#define TIMER_A1                                           ((TIMER_A1_Type *) TIMER_A1_BASE)
#define TIMER_A2                                           ((TIMER_A2_Type *) TIMER_A2_BASE)
#define TIMER_A3                                           ((TIMER_A3_Type *) TIMER_A3_BASE)
#define TLV                                                ((TLV_Type *) TLV_BASE)       
#define WDT_A                                              ((WDT_A_Type *) WDT_A_BASE)   


/***************************************************************************
// MSP-format peripheral registers
/***************************************************************************

/***************************************************************************
// ADC14 Registers
/***************************************************************************
#define ADC14CTL0                                          (HWREG32(0x40012000)) /* Control 0 Register  */
#define ADC14CTL1                                          (HWREG32(0x40012004)) /* Control 1 Register */
#define ADC14LO0                                           (HWREG32(0x40012008)) /* Window Comparator Low Threshold 0 Register  */
#define ADC14HI0                                           (HWREG32(0x4001200C)) /* Window Comparator High Threshold 0 Register  */
#define ADC14LO1                                           (HWREG32(0x40012010)) /* Window Comparator Low Threshold 1 Register  */
#define ADC14HI1                                           (HWREG32(0x40012014)) /* Window Comparator High Threshold 1 Register  */
#define ADC14MCTL0                                         (HWREG32(0x40012018)) /* Conversion Memory Control Register */
#define ADC14MCTL1                                         (HWREG32(0x4001201C)) /* Conversion Memory Control Register */
#define ADC14MCTL2                                         (HWREG32(0x40012020)) /* Conversion Memory Control Register */
#define ADC14MCTL3                                         (HWREG32(0x40012024)) /* Conversion Memory Control Register */
#define ADC14MCTL4                                         (HWREG32(0x40012028)) /* Conversion Memory Control Register */
#define ADC14MCTL5                                         (HWREG32(0x4001202C)) /* Conversion Memory Control Register */
#define ADC14MCTL6                                         (HWREG32(0x40012030)) /* Conversion Memory Control Register */
#define ADC14MCTL7                                         (HWREG32(0x40012034)) /* Conversion Memory Control Register */
#define ADC14MCTL8                                         (HWREG32(0x40012038)) /* Conversion Memory Control Register */
#define ADC14MCTL9                                         (HWREG32(0x4001203C)) /* Conversion Memory Control Register */
#define ADC14MCTL10                                        (HWREG32(0x40012040)) /* Conversion Memory Control Register */
#define ADC14MCTL11                                        (HWREG32(0x40012044)) /* Conversion Memory Control Register */
#define ADC14MCTL12                                        (HWREG32(0x40012048)) /* Conversion Memory Control Register */
#define ADC14MCTL13                                        (HWREG32(0x4001204C)) /* Conversion Memory Control Register */
#define ADC14MCTL14                                        (HWREG32(0x40012050)) /* Conversion Memory Control Register */
#define ADC14MCTL15                                        (HWREG32(0x40012054)) /* Conversion Memory Control Register */
#define ADC14MCTL16                                        (HWREG32(0x40012058)) /* Conversion Memory Control Register */
#define ADC14MCTL17                                        (HWREG32(0x4001205C)) /* Conversion Memory Control Register */
#define ADC14MCTL18                                        (HWREG32(0x40012060)) /* Conversion Memory Control Register */
#define ADC14MCTL19                                        (HWREG32(0x40012064)) /* Conversion Memory Control Register */
#define ADC14MCTL20                                        (HWREG32(0x40012068)) /* Conversion Memory Control Register */
#define ADC14MCTL21                                        (HWREG32(0x4001206C)) /* Conversion Memory Control Register */
#define ADC14MCTL22                                        (HWREG32(0x40012070)) /* Conversion Memory Control Register */
#define ADC14MCTL23                                        (HWREG32(0x40012074)) /* Conversion Memory Control Register */
#define ADC14MCTL24                                        (HWREG32(0x40012078)) /* Conversion Memory Control Register */
#define ADC14MCTL25                                        (HWREG32(0x4001207C)) /* Conversion Memory Control Register */
#define ADC14MCTL26                                        (HWREG32(0x40012080)) /* Conversion Memory Control Register */
#define ADC14MCTL27                                        (HWREG32(0x40012084)) /* Conversion Memory Control Register */
#define ADC14MCTL28                                        (HWREG32(0x40012088)) /* Conversion Memory Control Register */
#define ADC14MCTL29                                        (HWREG32(0x4001208C)) /* Conversion Memory Control Register */
#define ADC14MCTL30                                        (HWREG32(0x40012090)) /* Conversion Memory Control Register */
#define ADC14MCTL31                                        (HWREG32(0x40012094)) /* Conversion Memory Control Register */
#define ADC14MEM0                                          (HWREG32(0x40012098)) /* Conversion Memory Register */
#define ADC14MEM1                                          (HWREG32(0x4001209C)) /* Conversion Memory Register */
#define ADC14MEM2                                          (HWREG32(0x400120A0)) /* Conversion Memory Register */
#define ADC14MEM3                                          (HWREG32(0x400120A4)) /* Conversion Memory Register */
#define ADC14MEM4                                          (HWREG32(0x400120A8)) /* Conversion Memory Register */
#define ADC14MEM5                                          (HWREG32(0x400120AC)) /* Conversion Memory Register */
#define ADC14MEM6                                          (HWREG32(0x400120B0)) /* Conversion Memory Register */
#define ADC14MEM7                                          (HWREG32(0x400120B4)) /* Conversion Memory Register */
#define ADC14MEM8                                          (HWREG32(0x400120B8)) /* Conversion Memory Register */
#define ADC14MEM9                                          (HWREG32(0x400120BC)) /* Conversion Memory Register */
#define ADC14MEM10                                         (HWREG32(0x400120C0)) /* Conversion Memory Register */
#define ADC14MEM11                                         (HWREG32(0x400120C4)) /* Conversion Memory Register */
#define ADC14MEM12                                         (HWREG32(0x400120C8)) /* Conversion Memory Register */
#define ADC14MEM13                                         (HWREG32(0x400120CC)) /* Conversion Memory Register */
#define ADC14MEM14                                         (HWREG32(0x400120D0)) /* Conversion Memory Register */
#define ADC14MEM15                                         (HWREG32(0x400120D4)) /* Conversion Memory Register */
#define ADC14MEM16                                         (HWREG32(0x400120D8)) /* Conversion Memory Register */
#define ADC14MEM17                                         (HWREG32(0x400120DC)) /* Conversion Memory Register */
#define ADC14MEM18                                         (HWREG32(0x400120E0)) /* Conversion Memory Register */
#define ADC14MEM19                                         (HWREG32(0x400120E4)) /* Conversion Memory Register */
#define ADC14MEM20                                         (HWREG32(0x400120E8)) /* Conversion Memory Register */
#define ADC14MEM21                                         (HWREG32(0x400120EC)) /* Conversion Memory Register */
#define ADC14MEM22                                         (HWREG32(0x400120F0)) /* Conversion Memory Register */
#define ADC14MEM23                                         (HWREG32(0x400120F4)) /* Conversion Memory Register */
#define ADC14MEM24                                         (HWREG32(0x400120F8)) /* Conversion Memory Register */
#define ADC14MEM25                                         (HWREG32(0x400120FC)) /* Conversion Memory Register */
#define ADC14MEM26                                         (HWREG32(0x40012100)) /* Conversion Memory Register */
#define ADC14MEM27                                         (HWREG32(0x40012104)) /* Conversion Memory Register */
#define ADC14MEM28                                         (HWREG32(0x40012108)) /* Conversion Memory Register */
#define ADC14MEM29                                         (HWREG32(0x4001210C)) /* Conversion Memory Register */
#define ADC14MEM30                                         (HWREG32(0x40012110)) /* Conversion Memory Register */
#define ADC14MEM31                                         (HWREG32(0x40012114)) /* Conversion Memory Register */
#define ADC14IER0                                          (HWREG32(0x4001213C)) /* Interrupt Enable 0 Register  */
#define ADC14IER1                                          (HWREG32(0x40012140)) /* Interrupt Enable 1 Register  */
#define ADC14IFGR0                                         (HWREG32(0x40012144)) /* Interrupt Flag 0 Register  */
#define ADC14IFGR1                                         (HWREG32(0x40012148)) /* Interrupt Flag 1 Register  */
#define ADC14CLRIFGR0                                      (HWREG32(0x4001214C)) /* Clear Interrupt Flag 0 Register  */
#define ADC14CLRIFGR1                                      (HWREG32(0x40012150)) /* Clear Interrupt Flag 1 Register  */
#define ADC14IV                                            (HWREG32(0x40012154)) /* Interrupt Vector Register */

