helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/* Register offsets from FPB_BASE address */
#define OFS_FPB_FP_CTRL                                    (0x00000000)          /* Flash Patch Control Register */
#define OFS_FPB_FP_REMAP                                   (0x00000004)          /* Flash Patch Remap Register */
#define OFS_FPB_FP_COMP0                                   (0x00000008)          /* Flash Patch Comparator Registers */
#define OFS_FPB_FP_COMP1                                   (0x0000000C)          /* Flash Patch Comparator Registers */
#define OFS_FPB_FP_COMP2                                   (0x00000010)          /* Flash Patch Comparator Registers */
#define OFS_FPB_FP_COMP3                                   (0x00000014)          /* Flash Patch Comparator Registers */
#define OFS_FPB_FP_COMP4                                   (0x00000018)          /* Flash Patch Comparator Registers */
#define OFS_FPB_FP_COMP5                                   (0x0000001C)          /* Flash Patch Comparator Registers */
#define OFS_FPB_FP_COMP6                                   (0x00000020)          /* Flash Patch Comparator Registers */
#define OFS_FPB_FP_COMP7                                   (0x00000024)          /* Flash Patch Comparator Registers */


/***************************************************************************
// FPU Registers
/***************************************************************************
#define FPU_FPCCR                                          (HWREG32(0xE000EF34)) /* Floating Point Context Control Register */
#define FPU_FPCAR                                          (HWREG32(0xE000EF38)) /* Floating-Point Context Address Register */
#define FPU_FPDSCR                                         (HWREG32(0xE000EF3C)) /* Floating Point Default Status Control Register */
#define FPU_MVFR0                                          (HWREG32(0xE000EF40)) /* Media and FP Feature Register 0 (MVFR0) */
#define FPU_MVFR1                                          (HWREG32(0xE000EF44)) /* Media and FP Feature Register 1 (MVFR1) */

/* Register offsets from FPU_BASE address */
#define OFS_FPU_FPCCR                                      (0x00000F34)          /* Floating Point Context Control Register */
#define OFS_FPU_FPCAR                                      (0x00000F38)          /* Floating-Point Context Address Register */
#define OFS_FPU_FPDSCR                                     (0x00000F3C)          /* Floating Point Default Status Control Register */
#define OFS_FPU_MVFR0                                      (0x00000F40)          /* Media and FP Feature Register 0 (MVFR0) */
#define OFS_FPU_MVFR1                                      (0x00000F44)          /* Media and FP Feature Register 1 (MVFR1) */


/***************************************************************************
// ITM Registers
/***************************************************************************
#define ITM_STIM0                                          (HWREG32(0xE0000000)) /* ITM Stimulus Port 0 */
#define ITM_STIM1                                          (HWREG32(0xE0000004)) /* ITM Stimulus Port 1 */
#define ITM_STIM2                                          (HWREG32(0xE0000008)) /* ITM Stimulus Port 2 */
#define ITM_STIM3                                          (HWREG32(0xE000000C)) /* ITM Stimulus Port 3 */
#define ITM_STIM4                                          (HWREG32(0xE0000010)) /* ITM Stimulus Port 4 */
#define ITM_STIM5                                          (HWREG32(0xE0000014)) /* ITM Stimulus Port 5 */
#define ITM_STIM6                                          (HWREG32(0xE0000018)) /* ITM Stimulus Port 6 */
#define ITM_STIM7                                          (HWREG32(0xE000001C)) /* ITM Stimulus Port 7 */
#define ITM_STIM8                                          (HWREG32(0xE0000020)) /* ITM Stimulus Port 8 */
#define ITM_STIM9                                          (HWREG32(0xE0000024)) /* ITM Stimulus Port 9 */
#define ITM_STIM10                                         (HWREG32(0xE0000028)) /* ITM Stimulus Port 10 */
#define ITM_STIM11                                         (HWREG32(0xE000002C)) /* ITM Stimulus Port 11 */
#define ITM_STIM12                                         (HWREG32(0xE0000030)) /* ITM Stimulus Port 12 */
#define ITM_STIM13                                         (HWREG32(0xE0000034)) /* ITM Stimulus Port 13 */
#define ITM_STIM14                                         (HWREG32(0xE0000038)) /* ITM Stimulus Port 14 */
#define ITM_STIM15                                         (HWREG32(0xE000003C)) /* ITM Stimulus Port 15 */
#define ITM_STIM16                                         (HWREG32(0xE0000040)) /* ITM Stimulus Port 16 */
#define ITM_STIM17                                         (HWREG32(0xE0000044)) /* ITM Stimulus Port 17 */
#define ITM_STIM18                                         (HWREG32(0xE0000048)) /* ITM Stimulus Port 18 */
#define ITM_STIM19                                         (HWREG32(0xE000004C)) /* ITM Stimulus Port 19 */
#define ITM_STIM20                                         (HWREG32(0xE0000050)) /* ITM Stimulus Port 20 */
#define ITM_STIM21                                         (HWREG32(0xE0000054)) /* ITM Stimulus Port 21 */
#define ITM_STIM22                                         (HWREG32(0xE0000058)) /* ITM Stimulus Port 22 */
#define ITM_STIM23                                         (HWREG32(0xE000005C)) /* ITM Stimulus Port 23 */
#define ITM_STIM24                                         (HWREG32(0xE0000060)) /* ITM Stimulus Port 24 */
#define ITM_STIM25                                         (HWREG32(0xE0000064)) /* ITM Stimulus Port 25 */
#define ITM_STIM26                                         (HWREG32(0xE0000068)) /* ITM Stimulus Port 26 */
#define ITM_STIM27                                         (HWREG32(0xE000006C)) /* ITM Stimulus Port 27 */
#define ITM_STIM28                                         (HWREG32(0xE0000070)) /* ITM Stimulus Port 28 */
#define ITM_STIM29                                         (HWREG32(0xE0000074)) /* ITM Stimulus Port 29 */
#define ITM_STIM30                                         (HWREG32(0xE0000078)) /* ITM Stimulus Port 30 */
#define ITM_STIM31                                         (HWREG32(0xE000007C)) /* ITM Stimulus Port 31 */
#define ITM_TER                                            (HWREG32(0xE0000E00)) /* ITM Trace Enable Register */
#define ITM_TPR                                            (HWREG32(0xE0000E40)) /* ITM Trace Privilege Register */
#define ITM_TCR                                            (HWREG32(0xE0000E80)) /* ITM Trace Control Register */
#define ITM_IWR                                            (HWREG32(0xE0000EF8)) /* ITM Integration Write Register */
#define ITM_IMCR                                           (HWREG32(0xE0000F00)) /* ITM Integration Mode Control Register */
#define ITM_LAR                                            (HWREG32(0xE0000FB0)) /* ITM Lock Access Register */
#define ITM_LSR                                            (HWREG32(0xE0000FB4)) /* ITM Lock Status Register */

/* Register offsets from ITM_BASE address */
#define OFS_ITM_STIM0                                      (0x00000000)          /* ITM Stimulus Port 0 */
#define OFS_ITM_STIM1                                      (0x00000004)          /* ITM Stimulus Port 1 */
#define OFS_ITM_STIM2                                      (0x00000008)          /* ITM Stimulus Port 2 */
#define OFS_ITM_STIM3                                      (0x0000000C)          /* ITM Stimulus Port 3 */
#define OFS_ITM_STIM4                                      (0x00000010)          /* ITM Stimulus Port 4 */
#define OFS_ITM_STIM5                                      (0x00000014)          /* ITM Stimulus Port 5 */
#define OFS_ITM_STIM6                                      (0x00000018)          /* ITM Stimulus Port 6 */
#define OFS_ITM_STIM7                                      (0x0000001C)          /* ITM Stimulus Port 7 */
#define OFS_ITM_STIM8                                      (0x00000020)          /* ITM Stimulus Port 8 */
#define OFS_ITM_STIM9                                      (0x00000024)          /* ITM Stimulus Port 9 */
#define OFS_ITM_STIM10                                     (0x00000028)          /* ITM Stimulus Port 10 */
#define OFS_ITM_STIM11                                     (0x0000002C)          /* ITM Stimulus Port 11 */
#define OFS_ITM_STIM12                                     (0x00000030)          /* ITM Stimulus Port 12 */
#define OFS_ITM_STIM13                                     (0x00000034)          /* ITM Stimulus Port 13 */
#define OFS_ITM_STIM14                                     (0x00000038)          /* ITM Stimulus Port 14 */
#define OFS_ITM_STIM15                                     (0x0000003C)          /* ITM Stimulus Port 15 */
#define OFS_ITM_STIM16                                     (0x00000040)          /* ITM Stimulus Port 16 */
#define OFS_ITM_STIM17                                     (0x00000044)          /* ITM Stimulus Port 17 */
#define OFS_ITM_STIM18                                     (0x00000048)          /* ITM Stimulus Port 18 */
#define OFS_ITM_STIM19                                     (0x0000004C)          /* ITM Stimulus Port 19 */
#define OFS_ITM_STIM20                                     (0x00000050)          /* ITM Stimulus Port 20 */
#define OFS_ITM_STIM21                                     (0x00000054)          /* ITM Stimulus Port 21 */
#define OFS_ITM_STIM22                                     (0x00000058)          /* ITM Stimulus Port 22 */
#define OFS_ITM_STIM23                                     (0x0000005C)          /* ITM Stimulus Port 23 */
#define OFS_ITM_STIM24                                     (0x00000060)          /* ITM Stimulus Port 24 */
#define OFS_ITM_STIM25                                     (0x00000064)          /* ITM Stimulus Port 25 */
#define OFS_ITM_STIM26                                     (0x00000068)          /* ITM Stimulus Port 26 */
#define OFS_ITM_STIM27                                     (0x0000006C)          /* ITM Stimulus Port 27 */
#define OFS_ITM_STIM28                                     (0x00000070)          /* ITM Stimulus Port 28 */
#define OFS_ITM_STIM29                                     (0x00000074)          /* ITM Stimulus Port 29 */
#define OFS_ITM_STIM30                                     (0x00000078)          /* ITM Stimulus Port 30 */
#define OFS_ITM_STIM31                                     (0x0000007C)          /* ITM Stimulus Port 31 */
#define OFS_ITM_TER                                        (0x00000E00)          /* ITM Trace Enable Register */
#define OFS_ITM_TPR                                        (0x00000E40)          /* ITM Trace Privilege Register */
#define OFS_ITM_TCR                                        (0x00000E80)          /* ITM Trace Control Register */
#define OFS_ITM_IWR                                        (0x00000EF8)          /* ITM Integration Write Register */
#define OFS_ITM_IMCR                                       (0x00000F00)          /* ITM Integration Mode Control Register */
#define OFS_ITM_LAR                                        (0x00000FB0)          /* ITM Lock Access Register */
#define OFS_ITM_LSR                                        (0x00000FB4)          /* ITM Lock Status Register */


/***************************************************************************
// MPU Registers
/***************************************************************************
#define MPU_TYPE                                           (HWREG32(0xE000ED90)) /* MPU Type Register */
#define MPU_CTRL                                           (HWREG32(0xE000ED94)) /* MPU Control Register */
#define MPU_RNR                                            (HWREG32(0xE000ED98)) /* MPU Region Number Register */
#define MPU_RBAR                                           (HWREG32(0xE000ED9C)) /* MPU Region Base Address Register */
#define MPU_RASR                                           (HWREG32(0xE000EDA0)) /* MPU Region Attribute and Size Register */
#define MPU_RBAR_A1                                        (HWREG32(0xE000EDA4)) /* MPU Alias 1 Region Base Address register */
#define MPU_RASR_A1                                        (HWREG32(0xE000EDA8)) /* MPU Alias 1 Region Attribute and Size register */
#define MPU_RBAR_A2                                        (HWREG32(0xE000EDAC)) /* MPU Alias 2 Region Base Address register */
#define MPU_RASR_A2                                        (HWREG32(0xE000EDB0)) /* MPU Alias 2 Region Attribute and Size register */
#define MPU_RBAR_A3                                        (HWREG32(0xE000EDB4)) /* MPU Alias 3 Region Base Address register */
#define MPU_RASR_A3                                        (HWREG32(0xE000EDB8)) /* MPU Alias 3 Region Attribute and Size register */

/* Register offsets from MPU_BASE address */
#define OFS_MPU_TYPE                                       (0x00000D90)          /* MPU Type Register */
#define OFS_MPU_CTRL                                       (0x00000D94)          /* MPU Control Register */
#define OFS_MPU_RNR                                        (0x00000D98)          /* MPU Region Number Register */
#define OFS_MPU_RBAR                                       (0x00000D9C)          /* MPU Region Base Address Register */
#define OFS_MPU_RASR                                       (0x00000DA0)          /* MPU Region Attribute and Size Register */
#define OFS_MPU_RBAR_A1                                    (0x00000DA4)          /* MPU Alias 1 Region Base Address register */
#define OFS_MPU_RASR_A1                                    (0x00000DA8)          /* MPU Alias 1 Region Attribute and Size register */
#define OFS_MPU_RBAR_A2                                    (0x00000DAC)          /* MPU Alias 2 Region Base Address register */
#define OFS_MPU_RASR_A2                                    (0x00000DB0)          /* MPU Alias 2 Region Attribute and Size register */
#define OFS_MPU_RBAR_A3                                    (0x00000DB4)          /* MPU Alias 3 Region Base Address register */
#define OFS_MPU_RASR_A3                                    (0x00000DB8)          /* MPU Alias 3 Region Attribute and Size register */


/***************************************************************************
// NVIC Registers
/***************************************************************************
#define NVIC_ISER0                                         (HWREG32(0xE000E100)) /* Irq 0 to 31 Set Enable Register */
#define NVIC_ISER1                                         (HWREG32(0xE000E104)) /* Irq 32 to 63 Set Enable Register */
#define NVIC_ICER0                                         (HWREG32(0xE000E180)) /* Irq 0 to 31 Clear Enable Register */
#define NVIC_ICER1                                         (HWREG32(0xE000E184)) /* Irq 32 to 63 Clear Enable Register */
#define NVIC_ISPR0                                         (HWREG32(0xE000E200)) /* Irq 0 to 31 Set Pending Register */
#define NVIC_ISPR1                                         (HWREG32(0xE000E204)) /* Irq 32 to 63 Set Pending Register */
#define NVIC_ICPR0                                         (HWREG32(0xE000E280)) /* Irq 0 to 31 Clear Pending Register */
#define NVIC_ICPR1                                         (HWREG32(0xE000E284)) /* Irq 32 to 63 Clear Pending Register */
#define NVIC_IABR0                                         (HWREG32(0xE000E300)) /* Irq 0 to 31 Active Bit Register */
#define NVIC_IABR1                                         (HWREG32(0xE000E304)) /* Irq 32 to 63 Active Bit Register */
#define NVIC_IPR0                                          (HWREG32(0xE000E400)) /* Irq 0 to 3 Priority Register */
#define NVIC_IPR1                                          (HWREG32(0xE000E404)) /* Irq 4 to 7 Priority Register */
#define NVIC_IPR2                                          (HWREG32(0xE000E408)) /* Irq 8 to 11 Priority Register */
#define NVIC_IPR3                                          (HWREG32(0xE000E40C)) /* Irq 12 to 15 Priority Register */
#define NVIC_IPR4                                          (HWREG32(0xE000E410)) /* Irq 16 to 19 Priority Register */
#define NVIC_IPR5                                          (HWREG32(0xE000E414)) /* Irq 20 to 23 Priority Register */
#define NVIC_IPR6                                          (HWREG32(0xE000E418)) /* Irq 24 to 27 Priority Register */
#define NVIC_IPR7                                          (HWREG32(0xE000E41C)) /* Irq 28 to 31 Priority Register */
#define NVIC_IPR8                                          (HWREG32(0xE000E420)) /* Irq 32 to 35 Priority Register */
#define NVIC_IPR9                                          (HWREG32(0xE000E424)) /* Irq 36 to 39 Priority Register */
#define NVIC_IPR10                                         (HWREG32(0xE000E428)) /* Irq 40 to 43 Priority Register */
#define NVIC_IPR11                                         (HWREG32(0xE000E42C)) /* Irq 44 to 47 Priority Register */
#define NVIC_IPR12                                         (HWREG32(0xE000E430)) /* Irq 48 to 51 Priority Register */
#define NVIC_IPR13                                         (HWREG32(0xE000E434)) /* Irq 52 to 55 Priority Register */
#define NVIC_IPR14                                         (HWREG32(0xE000E438)) /* Irq 56 to 59 Priority Register */
#define NVIC_IPR15                                         (HWREG32(0xE000E43C)) /* Irq 60 to 63 Priority Register */
#define NVIC_STIR                                          (HWREG32(0xE000EF00)) /* Software Trigger Interrupt Register */

/* Register offsets from NVIC_BASE address */
#define OFS_NVIC_ISER0                                     (0x00000100)          /* Irq 0 to 31 Set Enable Register */
#define OFS_NVIC_ISER1                                     (0x00000104)          /* Irq 32 to 63 Set Enable Register */
#define OFS_NVIC_ICER0                                     (0x00000180)          /* Irq 0 to 31 Clear Enable Register */
#define OFS_NVIC_ICER1                                     (0x00000184)          /* Irq 32 to 63 Clear Enable Register */
#define OFS_NVIC_ISPR0                                     (0x00000200)          /* Irq 0 to 31 Set Pending Register */
#define OFS_NVIC_ISPR1                                     (0x00000204)          /* Irq 32 to 63 Set Pending Register */
#define OFS_NVIC_ICPR0                                     (0x00000280)          /* Irq 0 to 31 Clear Pending Register */
#define OFS_NVIC_ICPR1                                     (0x00000284)          /* Irq 32 to 63 Clear Pending Register */
#define OFS_NVIC_IABR0                                     (0x00000300)          /* Irq 0 to 31 Active Bit Register */
#define OFS_NVIC_IABR1                                     (0x00000304)          /* Irq 32 to 63 Active Bit Register */
#define OFS_NVIC_IPR0                                      (0x00000400)          /* Irq 0 to 3 Priority Register */
#define OFS_NVIC_IPR1                                      (0x00000404)          /* Irq 4 to 7 Priority Register */
#define OFS_NVIC_IPR2                                      (0x00000408)          /* Irq 8 to 11 Priority Register */
#define OFS_NVIC_IPR3                                      (0x0000040C)          /* Irq 12 to 15 Priority Register */
#define OFS_NVIC_IPR4                                      (0x00000410)          /* Irq 16 to 19 Priority Register */
#define OFS_NVIC_IPR5                                      (0x00000414)          /* Irq 20 to 23 Priority Register */
#define OFS_NVIC_IPR6                                      (0x00000418)          /* Irq 24 to 27 Priority Register */
#define OFS_NVIC_IPR7                                      (0x0000041C)          /* Irq 28 to 31 Priority Register */
#define OFS_NVIC_IPR8                                      (0x00000420)          /* Irq 32 to 35 Priority Register */
#define OFS_NVIC_IPR9                                      (0x00000424)          /* Irq 36 to 39 Priority Register */
#define OFS_NVIC_IPR10                                     (0x00000428)          /* Irq 40 to 43 Priority Register */
#define OFS_NVIC_IPR11                                     (0x0000042C)          /* Irq 44 to 47 Priority Register */
#define OFS_NVIC_IPR12                                     (0x00000430)          /* Irq 48 to 51 Priority Register */
#define OFS_NVIC_IPR13                                     (0x00000434)          /* Irq 52 to 55 Priority Register */
#define OFS_NVIC_IPR14                                     (0x00000438)          /* Irq 56 to 59 Priority Register */
#define OFS_NVIC_IPR15                                     (0x0000043C)          /* Irq 60 to 63 Priority Register */
#define OFS_NVIC_STIR                                      (0x00000F00)          /* Software Trigger Interrupt Register */


/***************************************************************************
// PCM Registers
/***************************************************************************
#define PCMCTL0                                            (HWREG32(0x40010000)) /* Control 0 Register */
#define PCMCTL1                                            (HWREG32(0x40010004)) /* Control 1 Register */
#define PCMIE                                              (HWREG32(0x40010008)) /* Interrupt Enable Register */
#define PCMIFG                                             (HWREG32(0x4001000C)) /* Interrupt Flag Register */
#define PCMCLRIFG                                          (HWREG32(0x40010010)) /* Clear Interrupt Flag Register */

/* Register offsets from PCM_BASE address */
#define OFS_PCMCTL0                                        (0x00000000)          /* Control 0 Register */
#define OFS_PCMCTL1                                        (0x00000004)          /* Control 1 Register */
#define OFS_PCMIE                                          (0x00000008)          /* Interrupt Enable Register */
#define OFS_PCMIFG                                         (0x0000000c)          /* Interrupt Flag Register */
#define OFS_PCMCLRIFG                                      (0x00000010)          /* Clear Interrupt Flag Register */


