helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// PMAP Registers
/***************************************************************************
#define PMAPKEYID                                          (HWREG16(0x40005000)) /* Port Mapping Key Register */
#define PMAPCTL                                            (HWREG16(0x40005002)) /* Port Mapping Control Register */
#define P1MAP01                                            (HWREG16(0x40005008)) /* Port mapping register, P1.0 and P1.1 */
#define P1MAP23                                            (HWREG16(0x4000500A)) /* Port mapping register, P1.2 and P1.3 */
#define P1MAP45                                            (HWREG16(0x4000500C)) /* Port mapping register, P1.4 and P1.5 */
#define P1MAP67                                            (HWREG16(0x4000500E)) /* Port mapping register, P1.6 and P1.7 */
#define P2MAP01                                            (HWREG16(0x40005010)) /* Port mapping register, P2.0 and P2.1 */
#define P2MAP23                                            (HWREG16(0x40005012)) /* Port mapping register, P2.2 and P2.3 */
#define P2MAP45                                            (HWREG16(0x40005014)) /* Port mapping register, P2.4 and P2.5 */
#define P2MAP67                                            (HWREG16(0x40005016)) /* Port mapping register, P2.6 and P2.7 */
#define P3MAP01                                            (HWREG16(0x40005018)) /* Port mapping register, P3.0 and P3.1 */
#define P3MAP23                                            (HWREG16(0x4000501A)) /* Port mapping register, P3.2 and P3.3 */
#define P3MAP45                                            (HWREG16(0x4000501C)) /* Port mapping register, P3.4 and P3.5 */
#define P3MAP67                                            (HWREG16(0x4000501E)) /* Port mapping register, P3.6 and P3.7 */
#define P4MAP01                                            (HWREG16(0x40005020)) /* Port mapping register, P4.0 and P4.1 */
#define P4MAP23                                            (HWREG16(0x40005022)) /* Port mapping register, P4.2 and P4.3 */
#define P4MAP45                                            (HWREG16(0x40005024)) /* Port mapping register, P4.4 and P4.5 */
#define P4MAP67                                            (HWREG16(0x40005026)) /* Port mapping register, P4.6 and P4.7 */
#define P5MAP01                                            (HWREG16(0x40005028)) /* Port mapping register, P5.0 and P5.1 */
#define P5MAP23                                            (HWREG16(0x4000502A)) /* Port mapping register, P5.2 and P5.3 */
#define P5MAP45                                            (HWREG16(0x4000502C)) /* Port mapping register, P5.4 and P5.5 */
#define P5MAP67                                            (HWREG16(0x4000502E)) /* Port mapping register, P5.6 and P5.7 */
#define P6MAP01                                            (HWREG16(0x40005030)) /* Port mapping register, P6.0 and P6.1 */
#define P6MAP23                                            (HWREG16(0x40005032)) /* Port mapping register, P6.2 and P6.3 */
#define P6MAP45                                            (HWREG16(0x40005034)) /* Port mapping register, P6.4 and P6.5 */
#define P6MAP67                                            (HWREG16(0x40005036)) /* Port mapping register, P6.6 and P6.7 */
#define P7MAP01                                            (HWREG16(0x40005038)) /* Port mapping register, P7.0 and P7.1 */
#define P7MAP23                                            (HWREG16(0x4000503A)) /* Port mapping register, P7.2 and P7.3 */
#define P7MAP45                                            (HWREG16(0x4000503C)) /* Port mapping register, P7.4 and P7.5 */
#define P7MAP67                                            (HWREG16(0x4000503E)) /* Port mapping register, P7.6 and P7.7 */

/* Register offsets from PMAP_BASE address */
#define OFS_PMAPKEYID                                      (0x0000)              /* Port Mapping Key Register */
#define OFS_PMAPCTL                                        (0x0002)              /* Port Mapping Control Register */
#define OFS_P1MAP01                                        (0x0008)              /* Port mapping register, P1.0 and P1.1 */
#define OFS_P1MAP23                                        (0x000a)              /* Port mapping register, P1.2 and P1.3 */
#define OFS_P1MAP45                                        (0x000c)              /* Port mapping register, P1.4 and P1.5 */
#define OFS_P1MAP67                                        (0x000e)              /* Port mapping register, P1.6 and P1.7 */
#define OFS_P2MAP01                                        (0x0010)              /* Port mapping register, P2.0 and P2.1 */
#define OFS_P2MAP23                                        (0x0012)              /* Port mapping register, P2.2 and P2.3 */
#define OFS_P2MAP45                                        (0x0014)              /* Port mapping register, P2.4 and P2.5 */
#define OFS_P2MAP67                                        (0x0016)              /* Port mapping register, P2.6 and P2.7 */
#define OFS_P3MAP01                                        (0x0018)              /* Port mapping register, P3.0 and P3.1 */
#define OFS_P3MAP23                                        (0x001a)              /* Port mapping register, P3.2 and P3.3 */
#define OFS_P3MAP45                                        (0x001c)              /* Port mapping register, P3.4 and P3.5 */
#define OFS_P3MAP67                                        (0x001e)              /* Port mapping register, P3.6 and P3.7 */
#define OFS_P4MAP01                                        (0x0020)              /* Port mapping register, P4.0 and P4.1 */
#define OFS_P4MAP23                                        (0x0022)              /* Port mapping register, P4.2 and P4.3 */
#define OFS_P4MAP45                                        (0x0024)              /* Port mapping register, P4.4 and P4.5 */
#define OFS_P4MAP67                                        (0x0026)              /* Port mapping register, P4.6 and P4.7 */
#define OFS_P5MAP01                                        (0x0028)              /* Port mapping register, P5.0 and P5.1 */
#define OFS_P5MAP23                                        (0x002a)              /* Port mapping register, P5.2 and P5.3 */
#define OFS_P5MAP45                                        (0x002c)              /* Port mapping register, P5.4 and P5.5 */
#define OFS_P5MAP67                                        (0x002e)              /* Port mapping register, P5.6 and P5.7 */
#define OFS_P6MAP01                                        (0x0030)              /* Port mapping register, P6.0 and P6.1 */
#define OFS_P6MAP23                                        (0x0032)              /* Port mapping register, P6.2 and P6.3 */
#define OFS_P6MAP45                                        (0x0034)              /* Port mapping register, P6.4 and P6.5 */
#define OFS_P6MAP67                                        (0x0036)              /* Port mapping register, P6.6 and P6.7 */
#define OFS_P7MAP01                                        (0x0038)              /* Port mapping register, P7.0 and P7.1 */
#define OFS_P7MAP23                                        (0x003a)              /* Port mapping register, P7.2 and P7.3 */
#define OFS_P7MAP45                                        (0x003c)              /* Port mapping register, P7.4 and P7.5 */
#define OFS_P7MAP67                                        (0x003e)              /* Port mapping register, P7.6 and P7.7 */


/***************************************************************************
// PSS Registers
/***************************************************************************
#define PSSKEY                                             (HWREG32(0x40010800)) /* Key Register */
#define PSSCTL0                                            (HWREG32(0x40010804)) /* Control 0 Register */
#define PSSIE                                              (HWREG32(0x40010834)) /* Interrupt Enable Register */
#define PSSIFG                                             (HWREG32(0x40010838)) /* Interrupt Flag Register */
#define PSSCLRIFG                                          (HWREG32(0x4001083C)) /* Clear Interrupt Flag Register */

/* Register offsets from PSS_BASE address */
#define OFS_PSSKEY                                         (0x00000000)          /* Key Register */
#define OFS_PSSCTL0                                        (0x00000004)          /* Control 0 Register */
#define OFS_PSSIE                                          (0x00000034)          /* Interrupt Enable Register */
#define OFS_PSSIFG                                         (0x00000038)          /* Interrupt Flag Register */
#define OFS_PSSCLRIFG                                      (0x0000003c)          /* Clear Interrupt Flag Register */


/***************************************************************************
// REF_A Registers
/***************************************************************************
#define REFCTL0                                            (HWREG16(0x40003000)) /* REF Control Register 0 */

/* Register offsets from REF_A_BASE address */
#define OFS_REFCTL0                                        (0x0000)              /* REF Control Register 0 */

#define REFCTL0_L                                          (HWREG8_L(REFCTL0))   /* REF Control Register 0 */
#define REFCTL0_H                                          (HWREG8_H(REFCTL0))   /* REF Control Register 0 */

/***************************************************************************
// RSTCTL Registers
/***************************************************************************
#define RSTCTL_RESET_REQ                                   (HWREG32(0xE0042000)) /* Reset Request Register */
#define RSTCTL_HARDRESET_STAT                              (HWREG32(0xE0042004)) /* Hard Reset Status Register */
#define RSTCTL_HARDRESET_CLR                               (HWREG32(0xE0042008)) /* Hard Reset Status Clear Register */
#define RSTCTL_HARDRESET_SET                               (HWREG32(0xE004200C)) /* Hard Reset Status Set Register */
#define RSTCTL_SOFTRESET_STAT                              (HWREG32(0xE0042010)) /* Soft Reset Status Register */
#define RSTCTL_SOFTRESET_CLR                               (HWREG32(0xE0042014)) /* Soft Reset Status Clear Register */
#define RSTCTL_SOFTRESET_SET                               (HWREG32(0xE0042018)) /* Soft Reset Status Set Register */
#define RSTCTL_PSSRESET_STAT                               (HWREG32(0xE0042100)) /* PSS Reset Status Register */
#define RSTCTL_PSSRESET_CLR                                (HWREG32(0xE0042104)) /* PSS Reset Status Clear Register */
#define RSTCTL_PCMRESET_STAT                               (HWREG32(0xE0042108)) /* PCM Reset Status Register */
#define RSTCTL_PCMRESET_CLR                                (HWREG32(0xE004210C)) /* PCM Reset Status Clear Register */
#define RSTCTL_PINRESET_STAT                               (HWREG32(0xE0042110)) /* Pin Reset Status Register */
#define RSTCTL_PINRESET_CLR                                (HWREG32(0xE0042114)) /* Pin Reset Status Clear Register */
#define RSTCTL_REBOOTRESET_STAT                            (HWREG32(0xE0042118)) /* Reboot Reset Status Register */
#define RSTCTL_REBOOTRESET_CLR                             (HWREG32(0xE004211C)) /* Reboot Reset Status Clear Register */

/* Register offsets from RSTCTL_BASE address */
#define OFS_RSTCTL_RESET_REQ                               (0x00000000)          /* Reset Request Register */
#define OFS_RSTCTL_HARDRESET_STAT                          (0x00000004)          /* Hard Reset Status Register */
#define OFS_RSTCTL_HARDRESET_CLR                           (0x00000008)          /* Hard Reset Status Clear Register */
#define OFS_RSTCTL_HARDRESET_SET                           (0x0000000c)          /* Hard Reset Status Set Register */
#define OFS_RSTCTL_SOFTRESET_STAT                          (0x00000010)          /* Soft Reset Status Register */
#define OFS_RSTCTL_SOFTRESET_CLR                           (0x00000014)          /* Soft Reset Status Clear Register */
#define OFS_RSTCTL_SOFTRESET_SET                           (0x00000018)          /* Soft Reset Status Set Register */
#define OFS_RSTCTL_PSSRESET_STAT                           (0x00000100)          /* PSS Reset Status Register */
#define OFS_RSTCTL_PSSRESET_CLR                            (0x00000104)          /* PSS Reset Status Clear Register */
#define OFS_RSTCTL_PCMRESET_STAT                           (0x00000108)          /* PCM Reset Status Register */
#define OFS_RSTCTL_PCMRESET_CLR                            (0x0000010c)          /* PCM Reset Status Clear Register */
#define OFS_RSTCTL_PINRESET_STAT                           (0x00000110)          /* Pin Reset Status Register */
#define OFS_RSTCTL_PINRESET_CLR                            (0x00000114)          /* Pin Reset Status Clear Register */
#define OFS_RSTCTL_REBOOTRESET_STAT                        (0x00000118)          /* Reboot Reset Status Register */
#define OFS_RSTCTL_REBOOTRESET_CLR                         (0x0000011c)          /* Reboot Reset Status Clear Register */


/***************************************************************************
// RTC_C Registers
/***************************************************************************
#define RTCCTL0                                            (HWREG16(0x40004400)) /* RTCCTL0 Register */
#define RTCCTL13                                           (HWREG16(0x40004402)) /* RTCCTL13 Register */
#define RTCOCAL                                            (HWREG16(0x40004404)) /* RTCOCAL Register */
#define RTCTCMP                                            (HWREG16(0x40004406)) /* RTCTCMP Register */
#define RTCPS0CTL                                          (HWREG16(0x40004408)) /* Real-Time Clock Prescale Timer 0 Control Register */
#define RTCPS1CTL                                          (HWREG16(0x4000440A)) /* Real-Time Clock Prescale Timer 1 Control Register */
#define RTCPS                                              (HWREG16(0x4000440C)) /* Real-Time Clock Prescale Timer Counter Register */
#define RTCIV                                              (HWREG16(0x4000440E)) /* Real-Time Clock Interrupt Vector Register */
#define RTCTIM0                                            (HWREG16(0x40004410)) /* RTCTIM0 Register ? Hexadecimal Format */
#define RTCTIM0_BCD                                        (HWREG16(0x40004410)) /*  */
#define RTCTIM1                                            (HWREG16(0x40004412)) /* Real-Time Clock Hour, Day of Week */
#define RTCTIM1_BCD                                        (HWREG16(0x40004412)) /*  */
#define RTCDATE                                            (HWREG16(0x40004414)) /* RTCDATE - Hexadecimal Format */
#define RTCDATE_BCD                                        (HWREG16(0x40004414)) /*  */
#define RTCYEAR                                            (HWREG16(0x40004416)) /* RTCYEAR Register ? Hexadecimal Format */
#define RTCYEAR_BCD                                        (HWREG16(0x40004416)) /*  */
#define RTCAMINHR                                          (HWREG16(0x40004418)) /* RTCMINHR - Hexadecimal Format */
#define RTCAMINHR_BCD                                      (HWREG16(0x40004418)) /*  */
#define RTCADOWDAY                                         (HWREG16(0x4000441A)) /* RTCADOWDAY - Hexadecimal Format */
#define RTCADOWDAY_BCD                                     (HWREG16(0x4000441A)) /*  */
#define RTCBIN2BCD                                         (HWREG16(0x4000441C)) /* Binary-to-BCD Conversion Register */
#define RTCBCD2BIN                                         (HWREG16(0x4000441E)) /* BCD-to-Binary Conversion Register */

/* Register offsets from RTC_C_BASE address */
#define OFS_RTCCTL0                                        (0x0000)              /* RTCCTL0 Register */
#define OFS_RTCCTL13                                       (0x0002)              /* RTCCTL13 Register */
#define OFS_RTCOCAL                                        (0x0004)              /* RTCOCAL Register */
#define OFS_RTCTCMP                                        (0x0006)              /* RTCTCMP Register */
#define OFS_RTCPS0CTL                                      (0x0008)              /* Real-Time Clock Prescale Timer 0 Control Register */
#define OFS_RTCPS1CTL                                      (0x000a)              /* Real-Time Clock Prescale Timer 1 Control Register */
#define OFS_RTCPS                                          (0x000c)              /* Real-Time Clock Prescale Timer Counter Register */
#define OFS_RTCIV                                          (0x000e)              /* Real-Time Clock Interrupt Vector Register */
#define OFS_RTCTIM0                                        (0x0010)              /* RTCTIM0 Register ? Hexadecimal Format */
#define OFS_RTCTIM0_BCD                                    (0x0010)              /*  */
#define OFS_RTCTIM1                                        (0x0012)              /* Real-Time Clock Hour, Day of Week */
#define OFS_RTCTIM1_BCD                                    (0x0012)              /*  */
#define OFS_RTCDATE                                        (0x0014)              /* RTCDATE - Hexadecimal Format */
#define OFS_RTCDATE_BCD                                    (0x0014)              /*  */
#define OFS_RTCYEAR                                        (0x0016)              /* RTCYEAR Register ? Hexadecimal Format */
#define OFS_RTCYEAR_BCD                                    (0x0016)              /*  */
#define OFS_RTCAMINHR                                      (0x0018)              /* RTCMINHR - Hexadecimal Format */
#define OFS_RTCAMINHR_BCD                                  (0x0018)              /*  */
#define OFS_RTCADOWDAY                                     (0x001a)              /* RTCADOWDAY - Hexadecimal Format */
#define OFS_RTCADOWDAY_BCD                                 (0x001a)              /*  */
#define OFS_RTCBIN2BCD                                     (0x001c)              /* Binary-to-BCD Conversion Register */
#define OFS_RTCBCD2BIN                                     (0x001e)              /* BCD-to-Binary Conversion Register */

