helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// ADC14 Registers
/***************************************************************************
typedef struct {
  union {    /* ADC14CTL0 Register */
    __IO uint32_t r;
    struct { /* ADC14CTL0 Bits */
      __IO uint32_t bSC                 	:	1;  /* ADC14 start conversion */
      __IO uint32_t bENC                	:	1;  /* ADC14 enable conversion */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bON                 	:	1;  /* ADC14 on */
      __I  uint32_t bRESERVED1          	:	2;  /* Reserved */
      __IO uint32_t bMSC                	:	1;  /* ADC14 multiple sample and conversion */
      __IO uint32_t bSHT0               	:	4;  /* ADC14 sample-and-hold time */
      __IO uint32_t bSHT1               	:	4;  /* ADC14 sample-and-hold time */
      __I  uint32_t bBUSY               	:	1;  /* ADC14 busy */
      __IO uint32_t bCONSEQ             	:	2;  /* ADC14 conversion sequence mode select */
      __IO uint32_t bSSEL               	:	3;  /* ADC14 clock source select */
      __IO uint32_t bDIV                	:	3;  /* ADC14 clock divider */
      __IO uint32_t bISSH               	:	1;  /* ADC14 invert signal sample-and-hold */
      __IO uint32_t bSHP                	:	1;  /* ADC14 sample-and-hold pulse-mode select */
      __IO uint32_t bSHS                	:	3;  /* ADC14 sample-and-hold source select */
      __IO uint32_t bPDIV               	:	2;  /* ADC14 predivider */
    } b;
  } rCTL0;
  union {    /* ADC14CTL1 Register */
    __IO uint32_t r;
    struct { /* ADC14CTL1 Bits */
      __IO uint32_t bPWRMD              	:	2;  /* ADC14 power modes */
      __IO uint32_t bREFBURST           	:	1;  /* ADC14 reference buffer burst */
      __IO uint32_t bDF                 	:	1;  /* ADC14 data read-back format */
      __IO uint32_t bRES                	:	2;  /* ADC14 resolution */
      __I  uint32_t bRESERVED0          	:	10;  /* Reserved */
      __IO uint32_t bCSTARTADD          	:	5;  /* ADC14 conversion start address */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bBATMAP             	:	1;  /* Controls 1/2 AVCC ADC input channel selection */
      __IO uint32_t bTCMAP              	:	1;  /* Controls temperature sensor ADC input channel selection */
      __IO uint32_t bCH0MAP             	:	1;  /* Controls internal channel 0 selection to ADC input channel MAX-2 */
      __IO uint32_t bCH1MAP             	:	1;  /* Controls internal channel 1 selection to ADC input channel MAX-3 */
      __IO uint32_t bCH2MAP             	:	1;  /* Controls internal channel 2 selection to ADC input channel MAX-4 */
      __IO uint32_t bCH3MAP             	:	1;  /* Controls internal channel 3 selection to ADC input channel MAX-5 */
      __I  uint32_t bRESERVED2          	:	4;  /* Reserved */
    } b;
  } rCTL1;
  union {    /* ADC14LO0 Register */
    __IO uint32_t r;
    struct { /* ADC14LO0 Bits */
      __IO uint32_t bLO0                	:	16;  /* Low threshold 0 */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rLO0;
  union {    /* ADC14HI0 Register */
    __IO uint32_t r;
    struct { /* ADC14HI0 Bits */
      __IO uint32_t bHI0                	:	16;  /* High threshold 0 */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rHI0;
  union {    /* ADC14LO1 Register */
    __IO uint32_t r;
    struct { /* ADC14LO1 Bits */
      __IO uint32_t bLO1                	:	16;  /* Low threshold 1 */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rLO1;
  union {    /* ADC14HI1 Register */
    __IO uint32_t r;
    struct { /* ADC14HI1 Bits */
      __IO uint32_t bHI1                	:	16;  /* High threshold 1 */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rHI1;
  union {    /* ADC14MCTL0 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL0 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL0;
  union {    /* ADC14MCTL1 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL1 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL1;
  union {    /* ADC14MCTL2 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL2 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL2;
  union {    /* ADC14MCTL3 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL3 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL3;
  union {    /* ADC14MCTL4 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL4 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL4;
  union {    /* ADC14MCTL5 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL5 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL5;
  union {    /* ADC14MCTL6 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL6 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL6;
  union {    /* ADC14MCTL7 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL7 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL7;
  union {    /* ADC14MCTL8 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL8 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL8;
  union {    /* ADC14MCTL9 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL9 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL9;
  union {    /* ADC14MCTL10 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL10 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL10;
  union {    /* ADC14MCTL11 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL11 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL11;
  union {    /* ADC14MCTL12 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL12 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL12;
  union {    /* ADC14MCTL13 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL13 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL13;
  union {    /* ADC14MCTL14 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL14 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL14;
  union {    /* ADC14MCTL15 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL15 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL15;
  union {    /* ADC14MCTL16 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL16 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL16;
  union {    /* ADC14MCTL17 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL17 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL17;
  union {    /* ADC14MCTL18 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL18 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL18;
  union {    /* ADC14MCTL19 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL19 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL19;
  union {    /* ADC14MCTL20 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL20 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL20;
  union {    /* ADC14MCTL21 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL21 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL21;
  union {    /* ADC14MCTL22 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL22 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL22;
  union {    /* ADC14MCTL23 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL23 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
      __IO uint32_t bWINC               	:	1;  /* Comparator window enable */
      __IO uint32_t bWINCTH             	:	1;  /* Window comparator threshold register selection */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rMCTL23;
  union {    /* ADC14MCTL24 Register */
    __IO uint32_t r;
    struct { /* ADC14MCTL24 Bits */
      __IO uint32_t bINCH               	:	5;  /* Input channel select */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bEOS                	:	1;  /* End of sequence */
      __IO uint32_t bVRSEL              	:	4;  /* Selects combinations of V(R+) and V(R-) sources */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bDIF                	:	1;  /* Differential mode */
