helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// CS Registers
/***************************************************************************
typedef struct {
  union {    /* CSKEY Register */
    __IO uint32_t r;
    struct { /* CSKEY Bits */
      __IO uint32_t bKEY                	:	16;  /* Write xxxx_695Ah to unlock */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rKEY;
  union {    /* CSCTL0 Register */
    __IO uint32_t r;
    struct { /* CSCTL0 Bits */
      __IO uint32_t bDCOTUNE            	:	13;  /* DCO frequency tuning select */
      __I  uint32_t bRESERVED0          	:	3;  /* Reserved */
      __IO uint32_t bDCORSEL            	:	3;  /* DCO frequency range select */
      __I  uint32_t bRESERVED1          	:	3;  /* Reserved */
      __IO uint32_t bDCORES             	:	1;  /* Enables the DCO external resistor mode */
      __IO uint32_t bDCOEN              	:	1;  /* Enables the DCO oscillator */
      __IO uint32_t bDIS_DCO_DELAY_CNT  	:	1;  /*  */
      __I  uint32_t bRESERVED2          	:	7;  /* Reserved */
    } b;
  } rCTL0;
  union {    /* CSCTL1 Register */
    __IO uint32_t r;
    struct { /* CSCTL1 Bits */
      __IO uint32_t bSELM               	:	3;  /* Selects the MCLK source */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bSELS               	:	3;  /* Selects the SMCLK and HSMCLK source */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bSELA               	:	3;  /* Selects the ACLK source */
      __I  uint32_t bRESERVED2          	:	1;  /* Reserved */
      __IO uint32_t bSELB               	:	1;  /* Selects the BCLK source */
      __I  uint32_t bRESERVED3          	:	3;  /* Reserved */
      __IO uint32_t bDIVM               	:	3;  /* MCLK source divider */
      __I  uint32_t bRESERVED4          	:	1;  /* Reserved */
      __IO uint32_t bDIVHS              	:	3;  /* HSMCLK source divider */
      __I  uint32_t bRESERVED5          	:	1;  /* Reserved */
      __IO uint32_t bDIVA               	:	3;  /* ACLK source divider */
      __I  uint32_t bRESERVED6          	:	1;  /* Reserved */
      __IO uint32_t bDIVS               	:	3;  /* SMCLK source divider */
      __I  uint32_t bRESERVED7          	:	1;  /* Reserved */
    } b;
  } rCTL1;
  union {    /* CSCTL2 Register */
    __IO uint32_t r;
    struct { /* CSCTL2 Bits */
      __IO uint32_t bLFXTDRIVE          	:	3;  /* LFXT oscillator current can be adjusted to its drive needs */
      __IO uint32_t bRESERVED0          	:	4;  /* Reserved */
      __IO uint32_t bLFXTAGCOFF         	:	1;  /* Disables the automatic gain control of the LFXT crystal */
      __IO uint32_t bLFXT_EN            	:	1;  /* Turns on the LFXT oscillator regardless if used as a clock resource */
      __IO uint32_t bLFXTBYPASS         	:	1;  /* LFXT bypass select */
      __I  uint32_t bRESERVED1          	:	6;  /* Reserved */
      __IO uint32_t bHFXTDRIVE          	:	1;  /* HFXT oscillator drive selection */
      __IO uint32_t bRESERVED5          	:	2;  /* Reserved */
      __I  uint32_t bRESERVED2          	:	1;  /* Reserved */
      __IO uint32_t bHFXTFREQ           	:	3;  /* HFXT frequency selection */
      __I  uint32_t bRESERVED3          	:	1;  /* Reserved */
      __IO uint32_t bHFXT_EN            	:	1;  /* Turns on the HFXT oscillator regardless if used as a clock resource */
      __IO uint32_t bHFXTBYPASS         	:	1;  /* HFXT bypass select */
      __I  uint32_t bRESERVED4          	:	6;  /* Reserved */
    } b;
  } rCTL2;
  union {    /* CSCTL3 Register */
    __IO uint32_t r;
    struct { /* CSCTL3 Bits */
      __IO uint32_t bFCNTLF             	:	2;  /* Start flag counter for LFXT */
      __O  uint32_t bRFCNTLF            	:	1;  /* Reset start fault counter for LFXT */
      __IO uint32_t bFCNTLF_EN          	:	1;  /* Enable start fault counter for LFXT */
      __IO uint32_t bFCNTHF             	:	2;  /* Start flag counter for HFXT */
      __O  uint32_t bRFCNTHF            	:	1;  /* Reset start fault counter for HFXT */
      __IO uint32_t bFCNTHF_EN          	:	1;  /* Enable start fault counter for HFXT */
      __IO uint32_t bFCNTHF2            	:	2;  /* Start flag counter for HFXT2 */
      __O  uint32_t bRFCNTHF2           	:	1;  /* Reset start fault counter for HFXT2 */
      __IO uint32_t bFCNTHF2_EN         	:	1;  /* Enable start fault counter for HFXT2 */
      __I  uint32_t bRESERVED0          	:	20;  /* Reserved */
    } b;
  } rCTL3;
  union {    /* CSCTL4 Register */
    __IO uint32_t r;
    struct { /* CSCTL4 Bits */
      __IO uint32_t bHFXT2DRIVE         	:	3;  /* HFXT2 oscillator current can be adjusted to its drive needs */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bHFXT2FREQ          	:	3;  /* HFXT2 frequency selection */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bHFXT2_EN           	:	1;  /* Turns on the HFXT2 oscillator */
      __IO uint32_t bHFXT2BYPASS        	:	1;  /* HFXT2 bypass select */
      __I  uint32_t bRESERVED2          	:	22;  /* Reserved */
    } b;
  } rCTL4;
  union {    /* CSCTL5 Register */
    __IO uint32_t r;
    struct { /* CSCTL5 Bits */
      __IO uint32_t bREFCNTSEL          	:	3;  /* Reference counter source select */
      __IO uint32_t bREFCNTPS           	:	3;  /* Reference clock prescaler */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __O  uint32_t bCALSTART           	:	1;  /* Start clock calibration counters */
      __IO uint32_t bPERCNTSEL          	:	3;  /* Period counter source select */
      __I  uint32_t bRESERVED1          	:	21;  /* Reserved */
    } b;
  } rCTL5;
  union {    /* CSCTL6 Register */
    __IO uint32_t r;
    struct { /* CSCTL6 Bits */
      __I  uint32_t bPERCNT             	:	16;  /* Calibration period counter */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rCTL6;
  union {    /* CSCTL7 Register */
    __IO uint32_t r;
    struct { /* CSCTL7 Bits */
      __IO uint32_t bREFCNT             	:	16;  /* Calibration reference period counter */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rCTL7;
  uint8_t  RESERVED0[12];
  union {    /* CSCLKEN Register */
    __IO uint32_t r;
    struct { /* CSCLKEN Bits */
      __IO uint32_t bACLK_EN            	:	1;  /* ACLK system clock conditional request enable */
      __IO uint32_t bMCLK_EN            	:	1;  /* MCLK system clock conditional request enable */
      __IO uint32_t bHSMCLK_EN          	:	1;  /* HSMCLK system clock conditional request enable */
      __IO uint32_t bSMCLK_EN           	:	1;  /* SMCLK system clock conditional request enable */
      __I  uint32_t bRESERVED0          	:	4;  /* Reserved */
      __IO uint32_t bVLO_EN             	:	1;  /* Turns on the VLO oscillator */
      __IO uint32_t bREFO_EN            	:	1;  /* Turns on the REFO oscillator */
      __IO uint32_t bMODOSC_EN          	:	1;  /* Turns on the MODOSC oscillator */
      __I  uint32_t bRESERVED1          	:	4;  /* Reserved */
      __IO uint32_t bREFOFSEL           	:	1;  /* Selects REFO nominal frequency */
      __I  uint32_t bRESERVED2          	:	16;  /* Reserved */
    } b;
  } rCLKEN;
  union {    /* CSSTAT Register */
    __I uint32_t r;
    struct { /* CSSTAT Bits */
      __I  uint32_t bDCO_ON             	:	1;  /* DCO status */
      __I  uint32_t bDCOBIAS_ON         	:	1;  /* DCO bias status */
      __I  uint32_t bHFXT_ON            	:	1;  /* HFXT status */
      __I  uint32_t bHFXT2_ON           	:	1;  /* HFXT2 status */
      __I  uint32_t bMODOSC_ON          	:	1;  /* MODOSC status */
      __I  uint32_t bVLO_ON             	:	1;  /* VLO status */
      __I  uint32_t bLFXT_ON            	:	1;  /* LFXT status */
      __I  uint32_t bREFO_ON            	:	1;  /* REFO status */
      __I  uint32_t bRESERVED0          	:	8;  /* Reserved */
      __I  uint32_t bACLK_ON            	:	1;  /* ACLK system clock status */
      __I  uint32_t bMCLK_ON            	:	1;  /* MCLK system clock status */
      __I  uint32_t bHSMCLK_ON          	:	1;  /* HSMCLK system clock status */
      __I  uint32_t bSMCLK_ON           	:	1;  /* SMCLK system clock status */
      __I  uint32_t bMODCLK_ON          	:	1;  /* MODCLK system clock status */
      __I  uint32_t bVLOCLK_ON          	:	1;  /* VLOCLK system clock status */
      __I  uint32_t bLFXTCLK_ON         	:	1;  /* LFXTCLK system clock status */
      __I  uint32_t bREFOCLK_ON         	:	1;  /* REFOCLK system clock status */
      __I  uint32_t bACLK_READY         	:	1;  /* ACLK Ready status */
      __I  uint32_t bMCLK_READY         	:	1;  /* MCLK Ready status */
      __I  uint32_t bHSMCLK_READY       	:	1;  /* HSMCLK Ready status */
      __I  uint32_t bSMCLK_READY        	:	1;  /* SMCLK Ready status */
      __I  uint32_t bBCLK_READY         	:	1;  /* BCLK Ready status */
      __I  uint32_t bRESERVED1          	:	3;  /* Reserved */
    } b;
  } rSTAT;
  uint8_t  RESERVED1[8];
  union {    /* CSIE Register */
    __IO uint32_t r;
    struct { /* CSIE Bits */
      __IO uint32_t bLFXTIE             	:	1;  /* LFXT oscillator fault flag interrupt enable */
      __IO uint32_t bHFXTIE             	:	1;  /* HFXT oscillator fault flag interrupt enable */
      __IO uint32_t bHFXT2IE            	:	1;  /* HFXT2 oscillator fault flag interrupt enable */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bDCOMINIE           	:	1;  /* DCO minimum fault flag interrupt enable */
      __IO uint32_t bDCOMAXIE           	:	1;  /* DCO maximum fault flag interrupt enable */
      __IO uint32_t bDCORIE             	:	1;  /* DCO external resistor fault flag interrupt enable */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bFCNTLFIE           	:	1;  /* Start fault counter interrupt enable LFXT */
      __IO uint32_t bFCNTHFIE           	:	1;  /* Start fault counter interrupt enable HFXT */
      __IO uint32_t bFCNTHF2IE          	:	1;  /* Start fault counter interrupt enable HFXT2 */
      __I  uint32_t bRESERVED2          	:	1;  /* Reserved */
      __IO uint32_t bPLLOOLIE           	:	1;  /* PLL out-of-lock interrupt enable */
      __IO uint32_t bPLLLOSIE           	:	1;  /* PLL loss-of-signal interrupt enable */
      __IO uint32_t bPLLOORIE           	:	1;  /* PLL out-of-range interrupt enable */
      __IO uint32_t bCALIE              	:	1;  /* REFCNT period counter interrupt enable */
      __I  uint32_t bRESERVED3          	:	16;  /* Reserved */
    } b;
  } rIE;
  uint8_t  RESERVED2[4];
  union {    /* CSIFG Register */
    __I uint32_t r;
    struct { /* CSIFG Bits */
      __I  uint32_t bLFXTIFG            	:	1;  /* LFXT oscillator fault flag */
      __I  uint32_t bHFXTIFG            	:	1;  /* HFXT oscillator fault flag */
      __I  uint32_t bHFXT2IFG           	:	1;  /* HFXT2 oscillator fault flag */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __I  uint32_t bDCOMINIFG          	:	1;  /* DCO minimum fault flag */
      __I  uint32_t bDCOMAXIFG          	:	1;  /* DCO maximum fault flag */
      __I  uint32_t bDCORIFG            	:	1;  /* DCO external resistor fault flag */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __I  uint32_t bFCNTLFIFG          	:	1;  /* Start fault counter interrupt flag LFXT */
      __I  uint32_t bFCNTHFIFG          	:	1;  /* Start fault counter interrupt flag HFXT */
      __I  uint32_t bRESERVED2          	:	1;  /* Reserved */
      __I  uint32_t bFCNTHF2IFG         	:	1;  /* Start fault counter interrupt flag HFXT2 */
      __I  uint32_t bPLLOOLIFG          	:	1;  /* PLL out-of-lock interrupt flag */
      __I  uint32_t bPLLLOSIFG          	:	1;  /* PLL loss-of-signal interrupt flag */
      __I  uint32_t bPLLOORIFG          	:	1;  /* PLL out-of-range interrupt flag */
      __I  uint32_t bCALIFG             	:	1;  /* REFCNT period counter expired */
      __I  uint32_t bRESERVED3          	:	16;  /* Reserved */
    } b;
  } rIFG;
  uint8_t  RESERVED3[4];
  union {    /* CSCLRIFG Register */
    __IO uint32_t r;
    struct { /* CSCLRIFG Bits */
      __O  uint32_t bCLR_LFXTIFG        	:	1;  /* Clear LFXT oscillator fault interrupt flag */
      __O  uint32_t bCLR_HFXTIFG        	:	1;  /* Clear HFXT oscillator fault interrupt flag */
      __O  uint32_t bCLR_HFXT2IFG       	:	1;  /* Clear HFXT2 oscillator fault interrupt flag */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __O  uint32_t bCLR_DCOMINIFG      	:	1;  /* Clear DCO minimum fault interrupt flag */
      __O  uint32_t bCLR_DCOMAXIFG      	:	1;  /* Clear DCO maximum fault interrupt flag */
      __O  uint32_t bCLR_DCORIFG        	:	1;  /* Clear DCO external resistor fault interrupt flag */
      __O  uint32_t bCLR_CALIFG         	:	1;  /* REFCNT period counter clear interrupt flag */
      __O  uint32_t bCLR_FCNTLFIFG      	:	1;  /* Start fault counter clear interrupt flag LFXT */
      __O  uint32_t bCLR_FCNTHFIFG      	:	1;  /* Start fault counter clear interrupt flag HFXT */
      __O  uint32_t bCLR_FCNTHF2IFG     	:	1;  /* Start fault counter clear interrupt flag HFXT2 */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __O  uint32_t bCLR_PLLOOLIFG      	:	1;  /* PLL out-of-lock clear interrupt flag */
      __O  uint32_t bCLR_PLLLOSIFG      	:	1;  /* PLL loss-of-signal clear interrupt flag */
      __O  uint32_t bCLR_PLLOORIFG      	:	1;  /* PLL out-of-range clear interrupt flag */
      __I  uint32_t bRESERVED2          	:	17;  /* Reserved */
    } b;
  } rCLRIFG;
  uint8_t  RESERVED4[4];
  union {    /* CSSETIFG Register */
    __IO uint32_t r;
    struct { /* CSSETIFG Bits */
      __O  uint32_t bSET_LFXTIFG        	:	1;  /* Set LFXT oscillator fault interrupt flag */
      __O  uint32_t bSET_HFXTIFG        	:	1;  /* Set HFXT oscillator fault interrupt flag */
      __O  uint32_t bSET_HFXT2IFG       	:	1;  /* Set HFXT2 oscillator fault interrupt flag */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __O  uint32_t bSET_DCOMINIFG      	:	1;  /* Set DCO minimum fault interrupt flag */
      __O  uint32_t bSET_DCOMAXIFG      	:	1;  /* Set DCO maximum fault interrupt flag */
      __O  uint32_t bSET_DCORIFG        	:	1;  /* Set DCO external resistor fault interrupt flag */
      __O  uint32_t bSET_CALIFG         	:	1;  /* REFCNT period counter set interrupt flag */
      __O  uint32_t bSET_FCNTLFIFG      	:	1;  /* Start fault counter set interrupt flag LFXT */
      __O  uint32_t bSET_FCNTHFIFG      	:	1;  /* Start fault counter set interrupt flag HFXT */
      __O  uint32_t bSET_FCNTHF2IFG     	:	1;  /* Start fault counter set interrupt flag HFXT2 */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __O  uint32_t bSET_PLLOOLIFG      	:	1;  /* PLL out-of-lock set interrupt flag */
      __O  uint32_t bSET_PLLLOSIFG      	:	1;  /* PLL loss-of-signal set interrupt flag */
      __O  uint32_t bSET_PLLOORIFG      	:	1;  /* PLL out-of-range set interrupt flag */
      __I  uint32_t bRESERVED2          	:	17;  /* Reserved */
    } b;
  } rSETIFG;
  uint8_t  RESERVED5[4];
  union {    /* CSDCOERCAL Register */
    __IO uint32_t r;
    struct { /* CSDCOERCAL Bits */
      __IO uint32_t bDCO_TCTRIM         	:	2;  /* DCO Temperature compensation Trim */
      __I  uint32_t bRESERVED0          	:	14;  /* Reserved */
      __IO uint32_t bDCO_FTRIM          	:	11;  /* DCO frequency trim */
      __I  uint32_t bRESERVED1          	:	5;  /* Reserved */
    } b;
  } rDCOERCAL;
} CS_Type;


