helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// FLCTL Registers
/***************************************************************************
typedef struct {
  union {    /* FLCTL_POWER_STAT Register */
    __I uint32_t r;
    struct { /* FLCTL_POWER_STAT Bits */
      __I  uint32_t bPSTAT              	:	3;  /*  */
      __I  uint32_t bLDOSTAT            	:	1;  /* PSS FLDO GOOD status */
      __I  uint32_t bVREFSTAT           	:	1;  /* PSS VREF stable status */
      __I  uint32_t bIREFSTAT           	:	1;  /* PSS IREF stable status */
      __I  uint32_t bTRIMSTAT           	:	1;  /* PSS trim done status */
      __I  uint32_t bRD_2T              	:	1;  /* Indicates if Flash is being accessed in 2T mode */
      __I  uint32_t bRESERVED0          	:	24;  /* Reserved */
    } b;
  } rPOWER_STAT;
  uint8_t  RESERVED0[12];
  union {    /* FLCTL_BANK0_RDCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_BANK0_RDCTL Bits */
      __IO uint32_t bRD_MODE            	:	4;  /* Flash read mode control setting for Bank 0 */
      __IO uint32_t bBUFI               	:	1;  /* Enables read buffering feature for instruction fetches to this Bank */
      __IO uint32_t bBUFD               	:	1;  /* Enables read buffering feature for data reads to this Bank */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bRESERVED2          	:	1;  /* Reserved */
      __IO uint32_t bRESERVED3          	:	1;  /* Reserved */
      __IO uint32_t bRESERVED4          	:	1;  /* Reserved */
      __IO uint32_t bWAIT               	:	4;  /* Number of wait states for read */
      __I  uint32_t bRD_MODE_STATUS     	:	4;  /* Read mode */
      __I  uint32_t bRESERVED5          	:	12;  /* Reserved */
    } b;
  } rBANK0_RDCTL;
  union {    /* FLCTL_BANK1_RDCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_BANK1_RDCTL Bits */
      __IO uint32_t bRD_MODE            	:	4;  /* Flash read mode control setting for Bank 0 */
      __IO uint32_t bBUFI               	:	1;  /* Enables read buffering feature for instruction fetches to this Bank */
      __IO uint32_t bBUFD               	:	1;  /* Enables read buffering feature for data reads to this Bank */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bRESERVED2          	:	1;  /* Reserved */
      __IO uint32_t bRESERVED3          	:	1;  /* Reserved */
      __IO uint32_t bRESERVED4          	:	1;  /* Reserved */
      __IO uint32_t bWAIT               	:	4;  /* Number of wait states for read */
      __I  uint32_t bRD_MODE_STATUS     	:	4;  /* Read mode */
      __I  uint32_t bRESERVED5          	:	12;  /* Reserved */
    } b;
  } rBANK1_RDCTL;
  uint8_t  RESERVED1[8];
  union {    /* FLCTL_RDBRST_CTLSTAT Register */
    __IO uint32_t r;
    struct { /* FLCTL_RDBRST_CTLSTAT Bits */
      __O  uint32_t bSTART              	:	1;  /* Start of burst/compare operation */
      __IO uint32_t bMEM_TYPE           	:	2;  /* Type of memory that burst is carried out on */
      __IO uint32_t bSTOP_FAIL          	:	1;  /* Terminate burst/compare operation */
      __IO uint32_t bDATA_CMP           	:	1;  /* Data pattern used for comparison against memory read data */
      __IO uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bTEST_EN            	:	1;  /* Enable comparison against test data compare registers */
      __I  uint32_t bRESERVED1          	:	9;  /* Reserved */
      __I  uint32_t bBRST_STAT          	:	2;  /* Status of Burst/Compare operation */
      __I  uint32_t bCMP_ERR            	:	1;  /* Burst/Compare Operation encountered atleast one data */
      __I  uint32_t bADDR_ERR           	:	1;  /* Burst/Compare Operation was terminated due to access to */
      __I  uint32_t bRESERVED2          	:	3;  /* Reserved */
      __O  uint32_t bCLR_STAT           	:	1;  /* Clear status bits 19-16 of this register */
      __I  uint32_t bRESERVED3          	:	8;  /* Reserved */
    } b;
  } rRDBRST_CTLSTAT;
  union {    /* FLCTL_RDBRST_STARTADDR Register */
    __IO uint32_t r;
    struct { /* FLCTL_RDBRST_STARTADDR Bits */
      __IO uint32_t bSTART_ADDRESS      	:	21;  /* Start Address of Burst Operation */
      __I  uint32_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rRDBRST_STARTADDR;
  union {    /* FLCTL_RDBRST_LEN Register */
    __IO uint32_t r;
    struct { /* FLCTL_RDBRST_LEN Bits */
      __IO uint32_t bBURST_LENGTH       	:	21;  /* Length of Burst Operation */
      __I  uint32_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rRDBRST_LEN;
  uint8_t  RESERVED2[16];
  union {    /* FLCTL_RDBRST_FAILADDR Register */
    __IO uint32_t r;
    struct { /* FLCTL_RDBRST_FAILADDR Bits */
      __IO uint32_t bFAIL_ADDRESS       	:	21;  /* Reflects address of last failed compare */
      __I  uint32_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rRDBRST_FAILADDR;
  union {    /* FLCTL_RDBRST_FAILCNT Register */
    __IO uint32_t r;
    struct { /* FLCTL_RDBRST_FAILCNT Bits */
      __IO uint32_t bFAIL_COUNT         	:	17;  /* Number of failures encountered in burst operation */
      __I  uint32_t bRESERVED0          	:	15;  /* Reserved */
    } b;
  } rRDBRST_FAILCNT;
  uint8_t  RESERVED3[12];
  union {    /* FLCTL_PRG_CTLSTAT Register */
    __IO uint32_t r;
    struct { /* FLCTL_PRG_CTLSTAT Bits */
      __IO uint32_t bENABLE             	:	1;  /* Master control for all word program operations */
      __IO uint32_t bMODE               	:	1;  /* Write mode */
      __IO uint32_t bVER_PRE            	:	1;  /* Controls automatic pre program verify operations */
      __IO uint32_t bVER_PST            	:	1;  /* Controls automatic post program verify operations */
      __I  uint32_t bRESERVED0          	:	12;  /* Reserved */
      __I  uint32_t bSTATUS             	:	2;  /* Status of program operations in the Flash memory */
      __I  uint32_t bBNK_ACT            	:	1;  /* Bank active */
      __I  uint32_t bRESERVED1          	:	13;  /* Reserved */
    } b;
  } rPRG_CTLSTAT;
  union {    /* FLCTL_PRGBRST_CTLSTAT Register */
    __IO uint32_t r;
    struct { /* FLCTL_PRGBRST_CTLSTAT Bits */
      __O  uint32_t bSTART              	:	1;  /* Trigger start of burst program operation */
      __IO uint32_t bTYPE               	:	2;  /* Type of memory that burst program is carried out on */
      __IO uint32_t bLEN                	:	3;  /* Length of burst */
      __IO uint32_t bAUTO_PRE           	:	1;  /* Auto-Verify operation before the Burst Program */
      __IO uint32_t bAUTO_PST           	:	1;  /* Auto-Verify operation after the Burst Program */
      __I  uint32_t bRESERVED0          	:	8;  /* Reserved */
      __I  uint32_t bBURST_STATUS       	:	3;  /* Status of a Burst Operation */
      __I  uint32_t bPRE_ERR            	:	1;  /* Burst Operation encountered preprogram auto-verify errors */
      __I  uint32_t bPST_ERR            	:	1;  /* Burst Operation encountered postprogram auto-verify errors */
      __I  uint32_t bADDR_ERR           	:	1;  /* Burst Operation was terminated due to attempted program of reserved memory */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __O  uint32_t bCLR_STAT           	:	1;  /* Clear status bits 21-16 of this register */
      __I  uint32_t bRESERVED2          	:	8;  /* Reserved */
    } b;
  } rPRGBRST_CTLSTAT;
  union {    /* FLCTL_PRGBRST_STARTADDR Register */
    __IO uint32_t r;
    struct { /* FLCTL_PRGBRST_STARTADDR Bits */
      __IO uint32_t bSTART_ADDRESS      	:	22;  /* Start Address of Program Burst Operation */
      __I  uint32_t bRESERVED0          	:	10;  /* Reserved */
    } b;
  } rPRGBRST_STARTADDR;
  uint8_t  RESERVED4[4];
  __IO uint32_t rPRGBRST_DATA0_0; /* Program Burst Data0 Register0 */
  __IO uint32_t rPRGBRST_DATA0_1; /* Program Burst Data0 Register1 */
  __IO uint32_t rPRGBRST_DATA0_2; /* Program Burst Data0 Register2 */
  __IO uint32_t rPRGBRST_DATA0_3; /* Program Burst Data0 Register3 */
  __IO uint32_t rPRGBRST_DATA1_0; /* Program Burst Data1 Register0 */
  __IO uint32_t rPRGBRST_DATA1_1; /* Program Burst Data1 Register1 */
  __IO uint32_t rPRGBRST_DATA1_2; /* Program Burst Data1 Register2 */
  __IO uint32_t rPRGBRST_DATA1_3; /* Program Burst Data1 Register3 */
  __IO uint32_t rPRGBRST_DATA2_0; /* Program Burst Data2 Register0 */
  __IO uint32_t rPRGBRST_DATA2_1; /* Program Burst Data2 Register1 */
  __IO uint32_t rPRGBRST_DATA2_2; /* Program Burst Data2 Register2 */
  __IO uint32_t rPRGBRST_DATA2_3; /* Program Burst Data2 Register3 */
  __IO uint32_t rPRGBRST_DATA3_0; /* Program Burst Data3 Register0 */
  __IO uint32_t rPRGBRST_DATA3_1; /* Program Burst Data3 Register1 */
  __IO uint32_t rPRGBRST_DATA3_2; /* Program Burst Data3 Register2 */
  __IO uint32_t rPRGBRST_DATA3_3; /* Program Burst Data3 Register3 */
  union {    /* FLCTL_ERASE_CTLSTAT Register */
    __IO uint32_t r;
    struct { /* FLCTL_ERASE_CTLSTAT Bits */
      __O  uint32_t bSTART              	:	1;  /* Start of Erase operation */
      __IO uint32_t bMODE               	:	1;  /* Erase mode selected by application */
      __IO uint32_t bTYPE               	:	2;  /* Type of memory that erase operation is carried out on */
      __I  uint32_t bRESERVED0          	:	12;  /* Reserved */
      __I  uint32_t bSTATUS             	:	2;  /* Status of erase operations in the Flash memory */
      __I  uint32_t bADDR_ERR           	:	1;  /* Erase Operation was terminated due to attempted erase of reserved memory address */
      __O  uint32_t bCLR_STAT           	:	1;  /* Clear status bits 18-16 of this register */
      __I  uint32_t bRESERVED1          	:	12;  /* Reserved */
    } b;
  } rERASE_CTLSTAT;
  union {    /* FLCTL_ERASE_SECTADDR Register */
    __IO uint32_t r;
    struct { /* FLCTL_ERASE_SECTADDR Bits */
      __IO uint32_t bSECT_ADDRESS       	:	22;  /* Address of Sector being Erased */
      __I  uint32_t bRESERVED0          	:	10;  /* Reserved */
    } b;
  } rERASE_SECTADDR;
  uint8_t  RESERVED5[8];
  union {    /* FLCTL_BANK0_INFO_WEPROT Register */
    __IO uint32_t r;
    struct { /* FLCTL_BANK0_INFO_WEPROT Bits */
      __IO uint32_t bPROT0              	:	1;  /* Protects Sector 0 from program or erase */
      __IO uint32_t bPROT1              	:	1;  /* Protects Sector 1 from program or erase */
      __I  uint32_t bRESERVED0          	:	30;  /* Reserved */
    } b;
  } rBANK0_INFO_WEPROT;
  union {    /* FLCTL_BANK0_MAIN_WEPROT Register */
    __IO uint32_t r;
    struct { /* FLCTL_BANK0_MAIN_WEPROT Bits */
      __IO uint32_t bPROT0              	:	1;  /* Protects Sector 0 from program or erase */
      __IO uint32_t bPROT1              	:	1;  /* Protects Sector 1 from program or erase */
      __IO uint32_t bPROT2              	:	1;  /* Protects Sector 2 from program or erase */
      __IO uint32_t bPROT3              	:	1;  /* Protects Sector 3 from program or erase */
      __IO uint32_t bPROT4              	:	1;  /* Protects Sector 4 from program or erase */
      __IO uint32_t bPROT5              	:	1;  /* Protects Sector 5 from program or erase */
      __IO uint32_t bPROT6              	:	1;  /* Protects Sector 6 from program or erase */
      __IO uint32_t bPROT7              	:	1;  /* Protects Sector 7 from program or erase */
      __IO uint32_t bPROT8              	:	1;  /* Protects Sector 8 from program or erase */
      __IO uint32_t bPROT9              	:	1;  /* Protects Sector 9 from program or erase */
      __IO uint32_t bPROT10             	:	1;  /* Protects Sector 10 from program or erase */
      __IO uint32_t bPROT11             	:	1;  /* Protects Sector 11 from program or erase */
      __IO uint32_t bPROT12             	:	1;  /* Protects Sector 12 from program or erase */
      __IO uint32_t bPROT13             	:	1;  /* Protects Sector 13 from program or erase */
      __IO uint32_t bPROT14             	:	1;  /* Protects Sector 14 from program or erase */
      __IO uint32_t bPROT15             	:	1;  /* Protects Sector 15 from program or erase */
      __IO uint32_t bPROT16             	:	1;  /* Protects Sector 16 from program or erase */
      __IO uint32_t bPROT17             	:	1;  /* Protects Sector 17 from program or erase */
      __IO uint32_t bPROT18             	:	1;  /* Protects Sector 18 from program or erase */
      __IO uint32_t bPROT19             	:	1;  /* Protects Sector 19 from program or erase */
      __IO uint32_t bPROT20             	:	1;  /* Protects Sector 20 from program or erase */
      __IO uint32_t bPROT21             	:	1;  /* Protects Sector 21 from program or erase */
      __IO uint32_t bPROT22             	:	1;  /* Protects Sector 22 from program or erase */
      __IO uint32_t bPROT23             	:	1;  /* Protects Sector 23 from program or erase */
      __IO uint32_t bPROT24             	:	1;  /* Protects Sector 24 from program or erase */
      __IO uint32_t bPROT25             	:	1;  /* Protects Sector 25 from program or erase */
      __IO uint32_t bPROT26             	:	1;  /* Protects Sector 26 from program or erase */
      __IO uint32_t bPROT27             	:	1;  /* Protects Sector 27 from program or erase */
      __IO uint32_t bPROT28             	:	1;  /* Protects Sector 28 from program or erase */
      __IO uint32_t bPROT29             	:	1;  /* Protects Sector 29 from program or erase */
      __IO uint32_t bPROT30             	:	1;  /* Protects Sector 30 from program or erase */
      __IO uint32_t bPROT31             	:	1;  /* Protects Sector 31 from program or erase */
    } b;
  } rBANK0_MAIN_WEPROT;
  uint8_t  RESERVED6[8];
  union {    /* FLCTL_BANK1_INFO_WEPROT Register */
    __IO uint32_t r;
    struct { /* FLCTL_BANK1_INFO_WEPROT Bits */
      __IO uint32_t bPROT0              	:	1;  /* Protects Sector 0 from program or erase operations */
      __IO uint32_t bPROT1              	:	1;  /* Protects Sector 1 from program or erase operations */
      __I  uint32_t bRESERVED0          	:	30;  /* Reserved */
    } b;
  } rBANK1_INFO_WEPROT;
  union {    /* FLCTL_BANK1_MAIN_WEPROT Register */
    __IO uint32_t r;
    struct { /* FLCTL_BANK1_MAIN_WEPROT Bits */
      __IO uint32_t bPROT0              	:	1;  /* Protects Sector 0 from program or erase operations */
      __IO uint32_t bPROT1              	:	1;  /* Protects Sector 1 from program or erase operations */
      __IO uint32_t bPROT2              	:	1;  /* Protects Sector 2 from program or erase operations */
      __IO uint32_t bPROT3              	:	1;  /* Protects Sector 3 from program or erase operations */
      __IO uint32_t bPROT4              	:	1;  /* Protects Sector 4 from program or erase operations */
      __IO uint32_t bPROT5              	:	1;  /* Protects Sector 5 from program or erase operations */
      __IO uint32_t bPROT6              	:	1;  /* Protects Sector 6 from program or erase operations */
      __IO uint32_t bPROT7              	:	1;  /* Protects Sector 7 from program or erase operations */
      __IO uint32_t bPROT8              	:	1;  /* Protects Sector 8 from program or erase operations */
      __IO uint32_t bPROT9              	:	1;  /* Protects Sector 9 from program or erase operations */
      __IO uint32_t bPROT10             	:	1;  /* Protects Sector 10 from program or erase operations */
      __IO uint32_t bPROT11             	:	1;  /* Protects Sector 11 from program or erase operations */
      __IO uint32_t bPROT12             	:	1;  /* Protects Sector 12 from program or erase operations */
      __IO uint32_t bPROT13             	:	1;  /* Protects Sector 13 from program or erase operations */
      __IO uint32_t bPROT14             	:	1;  /* Protects Sector 14 from program or erase operations */
      __IO uint32_t bPROT15             	:	1;  /* Protects Sector 15 from program or erase operations */
      __IO uint32_t bPROT16             	:	1;  /* Protects Sector 16 from program or erase operations */
      __IO uint32_t bPROT17             	:	1;  /* Protects Sector 17 from program or erase operations */
      __IO uint32_t bPROT18             	:	1;  /* Protects Sector 18 from program or erase operations */
      __IO uint32_t bPROT19             	:	1;  /* Protects Sector 19 from program or erase operations */
      __IO uint32_t bPROT20             	:	1;  /* Protects Sector 20 from program or erase operations */
      __IO uint32_t bPROT21             	:	1;  /* Protects Sector 21 from program or erase operations */
      __IO uint32_t bPROT22             	:	1;  /* Protects Sector 22 from program or erase operations */
      __IO uint32_t bPROT23             	:	1;  /* Protects Sector 23 from program or erase operations */
      __IO uint32_t bPROT24             	:	1;  /* Protects Sector 24 from program or erase operations */
      __IO uint32_t bPROT25             	:	1;  /* Protects Sector 25 from program or erase operations */
      __IO uint32_t bPROT26             	:	1;  /* Protects Sector 26 from program or erase operations */
      __IO uint32_t bPROT27             	:	1;  /* Protects Sector 27 from program or erase operations */
      __IO uint32_t bPROT28             	:	1;  /* Protects Sector 28 from program or erase operations */
      __IO uint32_t bPROT29             	:	1;  /* Protects Sector 29 from program or erase operations */
      __IO uint32_t bPROT30             	:	1;  /* Protects Sector 30 from program or erase operations */
      __IO uint32_t bPROT31             	:	1;  /* Protects Sector 31 from program or erase operations */
    } b;
  } rBANK1_MAIN_WEPROT;
  uint8_t  RESERVED7[8];
  union {    /* FLCTL_BMRK_CTLSTAT Register */
    __IO uint32_t r;
    struct { /* FLCTL_BMRK_CTLSTAT Bits */
      __IO uint32_t bI_BMRK             	:	1;  /*  */
      __IO uint32_t bD_BMRK             	:	1;  /*  */
      __IO uint32_t bCMP_EN             	:	1;  /*  */
      __IO uint32_t bCMP_SEL            	:	1;  /*  */
      __I  uint32_t bRESERVED0          	:	28;  /* Reserved */
    } b;
  } rBMRK_CTLSTAT;
  __IO uint32_t rBMRK_IFETCH; /* Benchmark Instruction Fetch Count Register */
  __IO uint32_t rBMRK_DREAD; /* Benchmark Data Read Count Register */
  __IO uint32_t rBMRK_CMP; /* Benchmark Count Compare Register */
  uint8_t  RESERVED8[16];
  union {    /* FLCTL_IFG Register */
    __IO uint32_t r;
    struct { /* FLCTL_IFG Bits */
      __I  uint32_t bRDBRST             	:	1;  /*  */
      __I  uint32_t bAVPRE              	:	1;  /*  */
      __I  uint32_t bAVPST              	:	1;  /*  */
      __I  uint32_t bPRG                	:	1;  /*  */
      __I  uint32_t bPRGB               	:	1;  /*  */
      __I  uint32_t bERASE              	:	1;  /*  */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __I  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __I  uint32_t bBMRK               	:	1;  /*  */
      __I  uint32_t bPRG_ERR            	:	1;  /*  */
      __I  uint32_t bRESERVED2          	:	22;  /* Reserved */
    } b;
  } rIFG;
  union {    /* FLCTL_IE Register */
    __IO uint32_t r;
    struct { /* FLCTL_IE Bits */
      __IO uint32_t bRDBRST             	:	1;  /*  */
      __IO uint32_t bAVPRE              	:	1;  /*  */
      __IO uint32_t bAVPST              	:	1;  /*  */
      __IO uint32_t bPRG                	:	1;  /*  */
      __IO uint32_t bPRGB               	:	1;  /*  */
      __IO uint32_t bERASE              	:	1;  /*  */
      __IO uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bRESERVED1          	:	1;  /* Reserved */
      __IO uint32_t bBMRK               	:	1;  /*  */
      __IO uint32_t bPRG_ERR            	:	1;  /*  */
      __I  uint32_t bRESERVED2          	:	22;  /* Reserved */
    } b;
  } rIE;
  union {    /* FLCTL_CLRIFG Register */
    __IO uint32_t r;
    struct { /* FLCTL_CLRIFG Bits */
      __O  uint32_t bRDBRST             	:	1;  /*  */
      __O  uint32_t bAVPRE              	:	1;  /*  */
      __O  uint32_t bAVPST              	:	1;  /*  */
      __O  uint32_t bPRG                	:	1;  /*  */
      __O  uint32_t bPRGB               	:	1;  /*  */
      __O  uint32_t bERASE              	:	1;  /*  */
      __O  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __O  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __O  uint32_t bBMRK               	:	1;  /*  */
      __O  uint32_t bPRG_ERR            	:	1;  /*  */
      __I  uint32_t bRESERVED2          	:	22;  /* Reserved */
    } b;
  } rCLRIFG;
  union {    /* FLCTL_SETIFG Register */
    __IO uint32_t r;
    struct { /* FLCTL_SETIFG Bits */
      __O  uint32_t bRDBRST             	:	1;  /*  */
      __O  uint32_t bAVPRE              	:	1;  /*  */
      __O  uint32_t bAVPST              	:	1;  /*  */
      __O  uint32_t bPRG                	:	1;  /*  */
      __O  uint32_t bPRGB               	:	1;  /*  */
      __O  uint32_t bERASE              	:	1;  /*  */
      __O  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __O  uint32_t bRESERVED1          	:	1;  /* Reserved */
      __O  uint32_t bBMRK               	:	1;  /*  */
      __O  uint32_t bPRG_ERR            	:	1;  /*  */
      __I  uint32_t bRESERVED2          	:	22;  /* Reserved */
    } b;
  } rSETIFG;
  union {    /* FLCTL_READ_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_READ_TIMCTL Bits */
      __IO uint32_t bSETUP              	:	8;  /*  */
      __IO uint32_t bHOLD               	:	4;  /*  */
      __IO uint32_t bIREF_BOOST1        	:	4;  /*  */
      __IO uint32_t bSETUP_LONG         	:	8;  /*  */
      __I  uint32_t bRESERVED0          	:	8;  /* Reserved */
    } b;
  } rREAD_TIMCTL;
  union {    /* FLCTL_READMARGIN_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_READMARGIN_TIMCTL Bits */
      __IO uint32_t bSETUP              	:	8;  /*  */
      __IO uint32_t bHOLD               	:	4;  /*  */
      __I  uint32_t bRESERVED0          	:	4;  /* Reserved */
      __I  uint32_t bRESERVED1          	:	16;  /* Reserved */
    } b;
  } rREADMARGIN_TIMCTL;
  union {    /* FLCTL_PRGVER_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_PRGVER_TIMCTL Bits */
      __IO uint32_t bSETUP              	:	8;  /*  */
      __IO uint32_t bACTIVE             	:	4;  /*  */
      __IO uint32_t bHOLD               	:	4;  /*  */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rPRGVER_TIMCTL;
  union {    /* FLCTL_ERSVER_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_ERSVER_TIMCTL Bits */
      __IO uint32_t bSETUP              	:	8;  /*  */
      __IO uint32_t bHOLD               	:	4;  /*  */
      __I  uint32_t bRESERVED0          	:	4;  /* Reserved */
      __I  uint32_t bRESERVED1          	:	16;  /* Reserved */
    } b;
  } rERSVER_TIMCTL;
  union {    /* FLCTL_LKGVER_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_LKGVER_TIMCTL Bits */
      __IO uint32_t bSETUP              	:	8;  /*  */
      __IO uint32_t bHOLD               	:	4;  /*  */
      __I  uint32_t bRESERVED0          	:	4;  /* Reserved */
      __I  uint32_t bRESERVED1          	:	16;  /* Reserved */
    } b;
  } rLKGVER_TIMCTL;
  union {    /* FLCTL_PROGRAM_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_PROGRAM_TIMCTL Bits */
      __IO uint32_t bSETUP              	:	8;  /*  */
      __IO uint32_t bACTIVE             	:	20;  /*  */
      __IO uint32_t bHOLD               	:	4;  /*  */
    } b;
  } rPROGRAM_TIMCTL;
  union {    /* FLCTL_ERASE_TIMCTL Register */
    __IO uint32_t r;
