helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
    struct { /* FLCTL_ERASE_TIMCTL Bits */
      __IO uint32_t bSETUP              	:	8;  /*  */
      __IO uint32_t bACTIVE             	:	20;  /*  */
      __IO uint32_t bHOLD               	:	4;  /*  */
    } b;
  } rERASE_TIMCTL;
  union {    /* FLCTL_MASSERASE_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_MASSERASE_TIMCTL Bits */
      __IO uint32_t bBOOST_ACTIVE       	:	8;  /*  */
      __IO uint32_t bBOOST_HOLD         	:	8;  /*  */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMASSERASE_TIMCTL;
  union {    /* FLCTL_BURSTPRG_TIMCTL Register */
    __IO uint32_t r;
    struct { /* FLCTL_BURSTPRG_TIMCTL Bits */
      __I  uint32_t bRESERVED0          	:	8;  /* Reserved */
      __IO uint32_t bACTIVE             	:	20;  /*  */
      __I  uint32_t bRESERVED1          	:	4;  /* Reserved */
    } b;
  } rBURSTPRG_TIMCTL;
} FLCTL_Type;


/***************************************************************************
// PCM Registers
/***************************************************************************
typedef struct {
  union {    /* PCMCTL0 Register */
    __IO uint32_t r;
    struct { /* PCMCTL0 Bits */
      __IO uint32_t bAMR                	:	4;  /* Active Mode Request */
      __IO uint32_t bLPMR               	:	4;  /* Low Power Mode Request */
      __I  uint32_t bCPM                	:	6;  /* Current Power Mode */
      __I  uint32_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint32_t bKEY                	:	16;  /* PCM key */
    } b;
  } rCTL0;
  union {    /* PCMCTL1 Register */
    __IO uint32_t r;
    struct { /* PCMCTL1 Bits */
      __IO uint32_t bLOCKLPM5           	:	1;  /* Lock LPM5 */
      __IO uint32_t bLOCKBKUP           	:	1;  /* Lock Backup */
      __IO uint32_t bFORCE_LPM_ENTRY    	:	1;  /* Force LPM entry */
      __I  uint32_t bRESERVED0          	:	5;  /* Reserved */
      __IO uint32_t bPMR_BUSY           	:	1;  /* Power mode request busy flag */
      __I  uint32_t bRESERVED1          	:	7;  /* Reserved */
      __IO uint32_t bKEY                	:	16;  /* PCM key */
    } b;
  } rCTL1;
  union {    /* PCMIE Register */
    __IO uint32_t r;
    struct { /* PCMIE Bits */
      __IO uint32_t bLPM_INVALID_TR_IE  	:	1;  /* LPM invalid transition interrupt enable */
      __IO uint32_t bLPM_INVALID_CLK_IE 	:	1;  /* LPM invalid clock interrupt enable */
      __IO uint32_t bAM_INVALID_TR_IE   	:	1;  /* Active mode invalid transition interrupt enable */
      __I  uint32_t bRESERVED0          	:	3;  /* Reserved */
      __IO uint32_t bDCDC_ERROR_IE      	:	1;  /* DC-DC error interrupt enable */
      __I  uint32_t bRESERVED1          	:	25;  /* Reserved */
    } b;
  } rIE;
  union {    /* PCMIFG Register */
    __I uint32_t r;
    struct { /* PCMIFG Bits */
      __I  uint32_t bLPM_INVALID_TR_IFG 	:	1;  /* LPM invalid transition flag */
      __I  uint32_t bLPM_INVALID_CLK_IFG	:	1;  /* LPM invalid clock flag */
      __I  uint32_t bAM_INVALID_TR_IFG  	:	1;  /* Active mode invalid transition flag */
      __I  uint32_t bRESERVED0          	:	3;  /* Reserved */
      __I  uint32_t bDCDC_ERROR_IFG     	:	1;  /* DC-DC error flag */
      __I  uint32_t bRESERVED1          	:	25;  /* Reserved */
    } b;
  } rIFG;
  union {    /* PCMCLRIFG Register */
    __O uint32_t r;
    struct { /* PCMCLRIFG Bits */
      __O  uint32_t bCLR_LPM_INVALID_TR_IFG	:	1;  /* Clear LPM invalid transition flag */
      __O  uint32_t bCLR_LPM_INVALID_CLK_IFG	:	1;  /* Clear LPM invalid clock flag */
      __O  uint32_t bCLR_AM_INVALID_TR_IFG	:	1;  /* Clear active mode invalid transition flag */
      __O  uint32_t bRESERVED0          	:	3;  /* Reserved */
      __O  uint32_t bCLR_DCDC_ERROR_IFG 	:	1;  /* Clear DC-DC error flag */
      __O  uint32_t bRESERVED1          	:	25;  /* Reserved */
    } b;
  } rCLRIFG;
} PCM_Type;


/***************************************************************************
// PMAP Registers
/***************************************************************************
typedef struct {
  __IO uint16_t rKEYID; /* Port Mapping Key Register */
  union {    /* PMAPCTL Register */
    __IO uint16_t r;
    struct { /* PMAPCTL Bits */
      __I  uint16_t bLOCKED             	:	1;  /* Port mapping lock bit */
      __IO uint16_t bPRECFG             	:	1;  /* Port mapping reconfiguration control bit */
      __I  uint16_t bRESERVED0          	:	14;  /* Reserved */
    } b;
  } rCTL;
  uint8_t  RESERVED0[4];
  __IO uint16_t rP1MAP01; /* Port mapping register, P1.0 and P1.1 */
  __IO uint16_t rP1MAP23; /* Port mapping register, P1.2 and P1.3 */
  __IO uint16_t rP1MAP45; /* Port mapping register, P1.4 and P1.5 */
  __IO uint16_t rP1MAP67; /* Port mapping register, P1.6 and P1.7 */
  __IO uint16_t rP2MAP01; /* Port mapping register, P2.0 and P2.1 */
  __IO uint16_t rP2MAP23; /* Port mapping register, P2.2 and P2.3 */
  __IO uint16_t rP2MAP45; /* Port mapping register, P2.4 and P2.5 */
  __IO uint16_t rP2MAP67; /* Port mapping register, P2.6 and P2.7 */
  __IO uint16_t rP3MAP01; /* Port mapping register, P3.0 and P3.1 */
  __IO uint16_t rP3MAP23; /* Port mapping register, P3.2 and P3.3 */
  __IO uint16_t rP3MAP45; /* Port mapping register, P3.4 and P3.5 */
  __IO uint16_t rP3MAP67; /* Port mapping register, P3.6 and P3.7 */
  __IO uint16_t rP4MAP01; /* Port mapping register, P4.0 and P4.1 */
  __IO uint16_t rP4MAP23; /* Port mapping register, P4.2 and P4.3 */
  __IO uint16_t rP4MAP45; /* Port mapping register, P4.4 and P4.5 */
  __IO uint16_t rP4MAP67; /* Port mapping register, P4.6 and P4.7 */
  __IO uint16_t rP5MAP01; /* Port mapping register, P5.0 and P5.1 */
  __IO uint16_t rP5MAP23; /* Port mapping register, P5.2 and P5.3 */
  __IO uint16_t rP5MAP45; /* Port mapping register, P5.4 and P5.5 */
  __IO uint16_t rP5MAP67; /* Port mapping register, P5.6 and P5.7 */
  __IO uint16_t rP6MAP01; /* Port mapping register, P6.0 and P6.1 */
  __IO uint16_t rP6MAP23; /* Port mapping register, P6.2 and P6.3 */
  __IO uint16_t rP6MAP45; /* Port mapping register, P6.4 and P6.5 */
  __IO uint16_t rP6MAP67; /* Port mapping register, P6.6 and P6.7 */
  __IO uint16_t rP7MAP01; /* Port mapping register, P7.0 and P7.1 */
  __IO uint16_t rP7MAP23; /* Port mapping register, P7.2 and P7.3 */
  __IO uint16_t rP7MAP45; /* Port mapping register, P7.4 and P7.5 */
  __IO uint16_t rP7MAP67; /* Port mapping register, P7.6 and P7.7 */
} PMAP_Type;


/***************************************************************************
// PSS Registers
/***************************************************************************
typedef struct {
  union {    /* PSSKEY Register */
    __IO uint32_t r;
    struct { /* PSSKEY Bits */
      __IO uint32_t bKEY                	:	16;  /* PSS control key */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rKEY;
  union {    /* PSSCTL0 Register */
    __IO uint32_t r;
    struct { /* PSSCTL0 Bits */
      __IO uint32_t bSVSMHOFF           	:	1;  /* SVSM high-side off */
      __IO uint32_t bSVSMHLP            	:	1;  /* SVSM high-side low power normal performance mode */
      __IO uint32_t bSVSMHS             	:	1;  /* Supply supervisor or monitor selection for the high-side */
      __IO uint32_t bSVSMHTH            	:	3;  /* SVSM high-side reset voltage level */
      __IO uint32_t bSVMHOE             	:	1;  /* SVSM high-side output enable */
      __IO uint32_t bSVMHOUTPOLAL       	:	1;  /* SVMHOUT pin polarity active low */
      __IO uint32_t bSVSLOFF            	:	1;  /* SVS low-side off */
      __IO uint32_t bSVSLLP             	:	1;  /* SVS low-side low power normal performance mode */
      __IO uint32_t bDCDC_FORCE         	:	1;  /* Disables automatic supply voltage detection */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bVCORETRAN          	:	2;  /* Controls VCORE Level Transition time */
      __I  uint32_t bRESERVED1          	:	18;  /* Reserved */
    } b;
  } rCTL0;
  uint8_t  RESERVED0[44];
  union {    /* PSSIE Register */
    __IO uint32_t r;
    struct { /* PSSIE Bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bSVSMHIE            	:	1;  /* High-side SVSM interrupt enable */
      __I  uint32_t bRESERVED1          	:	30;  /* Reserved */
    } b;
  } rIE;
  union {    /* PSSIFG Register */
    __I uint32_t r;
    struct { /* PSSIFG Bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __I  uint32_t bSVSMHIFG           	:	1;  /* High-side SVSM interrupt flag */
      __I  uint32_t bRESERVED1          	:	30;  /* Reserved */
    } b;
  } rIFG;
  union {    /* PSSCLRIFG Register */
    __IO uint32_t r;
    struct { /* PSSCLRIFG Bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __O  uint32_t bCLRSVSMHIFG        	:	1;  /* SVSMH clear interrupt flag */
      __I  uint32_t bRESERVED1          	:	30;  /* Reserved */
    } b;
  } rCLRIFG;
} PSS_Type;


/***************************************************************************
// REF_A Registers
/***************************************************************************
typedef struct {
  union {    /* REFCTL0 Register */
    __IO uint16_t r;
    struct { /* REFCTL0 Bits */
      __IO uint16_t bON                 	:	1;  /* Reference enable */
      __IO uint16_t bOUT                	:	1;  /* Reference output buffer */
      __IO uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bTCOFF              	:	1;  /* Temperature sensor disabled */
      __IO uint16_t bVSEL               	:	2;  /* Reference voltage level select */
      __IO uint16_t bGENOT              	:	1;  /* Reference generator one-time trigger */
      __IO uint16_t bBGOT               	:	1;  /* Bandgap and bandgap buffer one-time trigger */
      __I  uint16_t bGENACT             	:	1;  /* Reference generator active */
      __I  uint16_t bBGACT              	:	1;  /* Reference bandgap active */
      __I  uint16_t bGENBUSY            	:	1;  /* Reference generator busy */
      __I  uint16_t bBGMODE             	:	1;  /* Bandgap mode */
      __I  uint16_t bGENRDY             	:	1;  /* Variable reference voltage ready status */
      __I  uint16_t bBGRDY              	:	1;  /* Buffered bandgap voltage ready status */
      __I  uint16_t bRESERVED1          	:	2;  /* Reserved */
    } b;
  } rCTL0;
} REF_A_Type;


