helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// RTC_C Registers
/***************************************************************************
typedef struct {
  union {    /* RTCCTL0 Register */
    __IO uint16_t r;
    struct { /* RTCCTL0 Bits */
      __IO uint16_t bRDYIFG             	:	1;  /* Real-time clock ready interrupt flag */
      __IO uint16_t bAIFG               	:	1;  /* Real-time clock alarm interrupt flag */
      __IO uint16_t bTEVIFG             	:	1;  /* Real-time clock time event interrupt flag */
      __IO uint16_t bOFIFG              	:	1;  /* 32-kHz crystal oscillator fault interrupt flag */
      __IO uint16_t bRDYIE              	:	1;  /* Real-time clock ready interrupt enable */
      __IO uint16_t bAIE                	:	1;  /* Real-time clock alarm interrupt enable */
      __IO uint16_t bTEVIE              	:	1;  /* Real-time clock time event interrupt enable */
      __IO uint16_t bOFIE               	:	1;  /* 32-kHz crystal oscillator fault interrupt enable */
      __IO uint16_t bKEY                	:	8;  /* Real-time clock key */
    } b;
  } rCTL0;
  union {    /* RTCCTL13 Register */
    __IO uint16_t r;
    struct { /* RTCCTL13 Bits */
      __IO uint16_t bTEV                	:	2;  /* Real-time clock time event */
      __IO uint16_t bSSEL               	:	2;  /* Real-time clock source select */
      __I  uint16_t bRDY                	:	1;  /* Real-time clock ready */
      __I  uint16_t bMODE               	:	1;  /*  */
      __IO uint16_t bHOLD               	:	1;  /* Real-time clock hold */
      __IO uint16_t bBCD                	:	1;  /* Real-time clock BCD select */
      __IO uint16_t bCALF               	:	2;  /* Real-time clock calibration frequency */
      __I  uint16_t bRESERVED0          	:	6;  /* Reserved */
    } b;
  } rCTL13;
  union {    /* RTCOCAL Register */
    __IO uint16_t r;
    struct { /* RTCOCAL Bits */
      __IO uint16_t bOCAL               	:	8;  /* Real-time clock offset error calibration */
      __I  uint16_t bRESERVED0          	:	7;  /* Reserved */
      __IO uint16_t bOCALS              	:	1;  /* Real-time clock offset error calibration sign */
    } b;
  } rOCAL;
  union {    /* RTCTCMP Register */
    __IO uint16_t r;
    struct { /* RTCTCMP Bits */
      __IO uint16_t bTCMP               	:	8;  /* Real-time clock temperature compensation */
      __I  uint16_t bRESERVED0          	:	5;  /* Reserved */
      __I  uint16_t bTCOK               	:	1;  /* Real-time clock temperature compensation write OK */
      __I  uint16_t bTCRDY              	:	1;  /* Real-time clock temperature compensation ready */
      __IO uint16_t bTCMPS              	:	1;  /* Real-time clock temperature compensation sign */
    } b;
  } rTCMP;
  union {    /* RTCPS0CTL Register */
    __IO uint16_t r;
    struct { /* RTCPS0CTL Bits */
      __IO uint16_t bRT0PSIFG           	:	1;  /* Prescale timer 0 interrupt flag */
      __IO uint16_t bRT0PSIE            	:	1;  /* Prescale timer 0 interrupt enable */
      __IO uint16_t bRT0IP              	:	3;  /* Prescale timer 0 interrupt interval */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rPS0CTL;
  union {    /* RTCPS1CTL Register */
    __IO uint16_t r;
    struct { /* RTCPS1CTL Bits */
      __IO uint16_t bRT1PSIFG           	:	1;  /* Prescale timer 1 interrupt flag */
      __IO uint16_t bRT1PSIE            	:	1;  /* Prescale timer 1 interrupt enable */
      __IO uint16_t bRT1IP              	:	3;  /* Prescale timer 1 interrupt interval */
      __I  uint16_t bRESERVED0          	:	11;  /* Reserved */
    } b;
  } rPS1CTL;
  union {    /* RTCPS Register */
    __IO uint16_t r;
    struct { /* RTCPS Bits */
      __IO uint16_t bRT0PS              	:	8;  /* Prescale timer 0 counter value */
      __IO uint16_t bRT1PS              	:	8;  /* Prescale timer 1 counter value */
    } b;
  } rPS;
  __I uint16_t rIV; /* Real-Time Clock Interrupt Vector Register */
  union {    /* RTCTIM0 Register */
    __IO uint16_t r;
    struct { /* RTCTIM0 Bits */
      __IO uint16_t bSEC                	:	6;  /* Seconds (0 to 59) */
      __I  uint16_t bRESERVED0          	:	2;  /* Reserved */
      __IO uint16_t bMIN                	:	6;  /* Minutes (0 to 59) */
      __I  uint16_t bRESERVED1          	:	2;  /* Reserved */
    } b;
    struct { /* RTCTIM0_BCD Bits */
      __IO uint16_t bSEC_LD             	:	4;  /* Seconds ? low digit (0 to 9) */
      __IO uint16_t bSEC_HD             	:	3;  /* Seconds ? high digit (0 to 5) */
      __I  uint16_t bRESERVED           	:	1;  /* Reserved */
      __IO uint16_t bMIN_LD             	:	4;  /* Minutes ? low digit (0 to 9) */
      __IO uint16_t bMIN_HD             	:	3;  /* Minutes ? high digit (0 to 5) */
    } a;
  } rTIM0;
  union {    /* RTCTIM1 Register */
    __IO uint16_t r;
    struct { /* RTCTIM1 Bits */
      __IO uint16_t bHOUR               	:	5;  /* Hours (0 to 23) */
      __I  uint16_t bRESERVED0          	:	3;  /* Reserved */
      __IO uint16_t bDOW                	:	3;  /* Day of week (0 to 6) */
      __I  uint16_t bRESERVED1          	:	5;  /* Reserved */
    } b;
    struct { /* RTCTIM1_BCD Bits */
      __IO uint16_t bHOUR_LD            	:	4;  /* Hours ? low digit (0 to 9) */
      __IO uint16_t bHOUR_HD            	:	2;  /* Hours ? high digit (0 to 2) */
      __I  uint16_t bRESERVED           	:	2;  /* Reserved */
      __IO uint16_t bDOW                	:	3;  /* Day of week (0 to 6) */
    } a;
  } rTIM1;
  union {    /* RTCDATE Register */
    __IO uint16_t r;
    struct { /* RTCDATE Bits */
      __IO uint16_t bDAY                	:	5;  /* Day of month (1 to 28, 29, 30, 31) */
      __I  uint16_t bRESERVED0          	:	3;  /* Reserved */
      __IO uint16_t bMON                	:	4;  /* Month (1 to 12) */
      __I  uint16_t bRESERVED1          	:	4;  /* Reserved */
    } b;
    struct { /* RTCDATE_BCD Bits */
      __IO uint16_t bDAY_LD             	:	4;  /* Day of month ? low digit (0 to 9) */
      __IO uint16_t bDAY_HD             	:	2;  /* Day of month ? high digit (0 to 3) */
      __I  uint16_t bRESERVED           	:	2;  /* Reserved */
      __IO uint16_t bMON_LD             	:	4;  /* Month ? low digit (0 to 9) */
      __IO uint16_t bMON_HD             	:	1;  /* Month ? high digit (0 or 1) */
    } a;
  } rDATE;
  union {    /* RTCYEAR Register */
    __IO uint16_t r;
    struct { /* RTCYEAR Bits */
      __IO uint16_t bYEAR_LB            	:	8;  /* Year ? low byte. Valid values for Year are 0 to 4095. */
      __IO uint16_t bYEAR_HB            	:	4;  /* Year ? high byte. Valid values for Year are 0 to 4095. */
      __I  uint16_t bRESERVED0          	:	4;  /* Reserved */
    } b;
    struct { /* RTCYEAR_BCD Bits */
      __IO uint16_t bYEAR               	:	4;  /* Year ? lowest digit (0 to 9) */
      __IO uint16_t bDEC                	:	4;  /* Decade (0 to 9) */
      __IO uint16_t bCENT_LD            	:	4;  /* Century ? low digit (0 to 9) */
      __IO uint16_t bCENT_HD            	:	3;  /* Century ? high digit (0 to 4) */
      __I  uint16_t bRESERVED           	:	1;  /* Reserved */
    } a;
  } rYEAR;
  union {    /* RTCAMINHR Register */
    __IO uint16_t r;
    struct { /* RTCAMINHR Bits */
      __IO uint16_t bMIN                	:	6;  /* Minutes (0 to 59) */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bMINAE              	:	1;  /* Alarm enable */
      __IO uint16_t bHOUR               	:	5;  /* Hours (0 to 23) */
      __I  uint16_t bRESERVED1          	:	2;  /* Reserved */
      __IO uint16_t bHOURAE             	:	1;  /* Alarm enable */
    } b;
    struct { /* RTCAMINHR_BCD Bits */
      __IO uint16_t bMIN_LD             	:	4;  /* Minutes ? low digit (0 to 9) */
      __IO uint16_t bMIN_HD             	:	3;  /* Minutes ? high digit (0 to 5) */
      __IO uint16_t b                   	:	1;  /* Alarm enable */
      __IO uint16_t bHOUR_LD            	:	4;  /* Hours ? low digit (0 to 9) */
      __IO uint16_t bHOUR_HD            	:	2;  /* Hours ? high digit (0 to 2) */
      __I  uint16_t bRESERVED           	:	1;  /* Reserved */
      __IO uint16_t bHOURAE             	:	1;  /* Alarm enable */
    } a;
  } rAMINHR;
  union {    /* RTCADOWDAY Register */
    __IO uint16_t r;
    struct { /* RTCADOWDAY Bits */
      __IO uint16_t bDOW                	:	3;  /* Day of week (0 to 6) */
      __I  uint16_t bRESERVED0          	:	4;  /* Reserved */
      __IO uint16_t bDOWAE              	:	1;  /* Alarm enable */
      __IO uint16_t bDAY                	:	5;  /* Day of month (1 to 28, 29, 30, 31) */
      __I  uint16_t bRESERVED1          	:	2;  /* Reserved */
      __IO uint16_t bDAYAE              	:	1;  /* Alarm enable */
    } b;
    struct { /* RTCADOWDAY_BCD Bits */
      __IO uint16_t bDOW                	:	3;  /* Day of week (0 to 6) */
      __I  uint16_t bRESERVED           	:	4;  /* Reserved */
      __IO uint16_t bDOWAE              	:	1;  /* Alarm enable */
      __IO uint16_t bDAY_LD             	:	4;  /* Day of month ? low digit (0 to 9) */
      __IO uint16_t bDAY_HD             	:	2;  /* Day of month ? high digit (0 to 3) */
      __IO uint16_t bDAYAE              	:	1;  /* Alarm enable */
    } a;
  } rADOWDAY;
  __IO uint16_t rBIN2BCD; /* Binary-to-BCD Conversion Register */
  __IO uint16_t rBCD2BIN; /* BCD-to-Binary Conversion Register */
} RTC_C_Type;


/***************************************************************************
// SYSCTL Registers
/***************************************************************************
typedef struct {
  union {    /* SYS_REBOOT_CTL Register */
    __IO uint32_t r;
    struct { /* SYS_REBOOT_CTL Bits */
      __IO uint32_t bREBOOT             	:	1;  /* Write 1 initiates a Reboot of the device */
      __I  uint32_t bRESERVED0          	:	7;  /* Reserved */
      __O  uint32_t bWKEY               	:	8;  /* Key to enable writes to bit 0 */
      __I  uint32_t bRESERVED1          	:	16;  /* Reserved */
    } b;
  } rREBOOT_CTL;
  union {    /* SYS_NMI_CTLSTAT Register */
    __IO uint32_t r;
    struct { /* SYS_NMI_CTLSTAT Bits */
      __IO uint32_t bCS_SRC             	:	1;  /* CS interrupt as a source of NMI */
      __IO uint32_t bPSS_SRC            	:	1;  /* PSS interrupt as a source of NMI */
      __IO uint32_t bPCM_SRC            	:	1;  /* PCM interrupt as a source of NMI */
      __IO uint32_t bPIN_SRC            	:	1;  /*  */
      __I  uint32_t bRESERVED0          	:	12;  /* Reserved */
      __I  uint32_t bCS_FLG             	:	1;  /* CS interrupt was the source of NMI */
      __I  uint32_t bPSS_FLG            	:	1;  /* PSS interrupt was the source of NMI */
      __I  uint32_t bPCM_FLG            	:	1;  /* PCM interrupt was the source of NMI */
      __IO uint32_t bPIN_FLG            	:	1;  /* RSTn/NMI pin was the source of NMI */
      __I  uint32_t bRESERVED1          	:	12;  /* Reserved */
    } b;
  } rNMI_CTLSTAT;
  union {    /* SYS_WDTRESET_CTL Register */
    __IO uint32_t r;
    struct { /* SYS_WDTRESET_CTL Bits */
      __IO uint32_t bTIMEOUT            	:	1;  /* WDT timeout reset type */
      __IO uint32_t bVIOLATION          	:	1;  /* WDT password violation reset type */
      __I  uint32_t bRESERVED0          	:	30;  /* Reserved */
    } b;
  } rWDTRESET_CTL;
  union {    /* SYS_PERIHALT_CTL Register */
    __IO uint32_t r;
    struct { /* SYS_PERIHALT_CTL Bits */
      __IO uint32_t bT16_0              	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bT16_1              	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bT16_2              	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bT16_3              	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bT32_0              	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUA0               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUA1               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUA2               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUA3               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUB0               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUB1               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUB2               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bEUB3               	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bADC                	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bWDT                	:	1;  /* Freezes IP operation when CPU is halted */
      __IO uint32_t bDMA                	:	1;  /* Freezes IP operation when CPU is halted */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rPERIHALT_CTL;
  __I uint32_t rSRAM_SIZE; /* SRAM Size Register */
  union {    /* SYS_SRAM_BANKEN Register */
    __IO uint32_t r;
    struct { /* SYS_SRAM_BANKEN Bits */
      __I  uint32_t bBNK0_EN            	:	1;  /* SRAM Bank0 enable */
      __IO uint32_t bBNK1_EN            	:	1;  /* SRAM Bank1 enable */
      __IO uint32_t bBNK2_EN            	:	1;  /* SRAM Bank1 enable */
      __IO uint32_t bBNK3_EN            	:	1;  /* SRAM Bank1 enable */
      __IO uint32_t bBNK4_EN            	:	1;  /* SRAM Bank1 enable */
      __IO uint32_t bBNK5_EN            	:	1;  /* SRAM Bank1 enable */
      __IO uint32_t bBNK6_EN            	:	1;  /* SRAM Bank1 enable */
      __IO uint32_t bBNK7_EN            	:	1;  /* SRAM Bank1 enable */
      __I  uint32_t bRESERVED0          	:	8;  /* Reserved */
      __I  uint32_t bSRAM_RDY           	:	1;  /* SRAM ready */
      __I  uint32_t bRESERVED1          	:	15;  /* Reserved */
    } b;
  } rSRAM_BANKEN;
  union {    /* SYS_SRAM_BANKRET Register */
    __IO uint32_t r;
    struct { /* SYS_SRAM_BANKRET Bits */
      __I  uint32_t bBNK0_RET           	:	1;  /* Bank0 retention */
      __IO uint32_t bBNK1_RET           	:	1;  /* Bank1 retention */
      __IO uint32_t bBNK2_RET           	:	1;  /* Bank2 retention */
      __IO uint32_t bBNK3_RET           	:	1;  /* Bank3 retention */
      __IO uint32_t bBNK4_RET           	:	1;  /* Bank4 retention */
      __IO uint32_t bBNK5_RET           	:	1;  /* Bank5 retention */
      __IO uint32_t bBNK6_RET           	:	1;  /* Bank6 retention */
      __IO uint32_t bBNK7_RET           	:	1;  /* Bank7 retention */
      __I  uint32_t bRESERVED0          	:	8;  /* Reserved */
      __I  uint32_t bSRAM_RDY           	:	1;  /* SRAM ready */
      __I  uint32_t bRESERVED1          	:	15;  /* Reserved */
    } b;
  } rSRAM_BANKRET;
  uint8_t  RESERVED0[4];
  __I uint32_t rFLASH_SIZE; /* Flash Size Register */
  uint8_t  RESERVED1[12];
  union {    /* SYS_DIO_GLTFLT_CTL Register */
    __IO uint32_t r;
    struct { /* SYS_DIO_GLTFLT_CTL Bits */
      __IO uint32_t bGLTCH_EN           	:	1;  /* Glitch filter enable */
      __I  uint32_t bRESERVED0          	:	31;  /* Reserved */
    } b;
  } rDIO_GLTFLT_CTL;
  uint8_t  RESERVED2[12];
  union {    /* SYS_SECDATA_UNLOCK Register */
    __IO uint32_t r;
    struct { /* SYS_SECDATA_UNLOCK Bits */
      __IO uint32_t bUNLKEY             	:	16;  /* Unlock key */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rSECDATA_UNLOCK;
  uint8_t  RESERVED3[4028];
  union {    /* SYS_MASTER_UNLOCK Register */
    __IO uint32_t r;
    struct { /* SYS_MASTER_UNLOCK Bits */
      __IO uint32_t bUNLKEY             	:	16;  /* Unlock Key */
      __I  uint32_t bRESERVED0          	:	16;  /* Reserved */
    } b;
  } rMASTER_UNLOCK;
  __IO uint32_t rBOOTOVER_REQ0; /* Boot Override Request Register */
  __IO uint32_t rBOOTOVER_REQ1; /* Boot Override Request Register */
  __IO uint32_t rBOOTOVER_ACK; /* Boot Override Acknowledge Register */
  union {    /* SYS_RESET_REQ Register */
    __IO uint32_t r;
    struct { /* SYS_RESET_REQ Bits */
      __O  uint32_t bPOR                	:	1;  /* Generate POR */
      __O  uint32_t bREBOOT             	:	1;  /* Generate Reboot_Reset */
      __I  uint32_t bRESERVED0          	:	6;  /* Reserved */
      __O  uint32_t bWKEY               	:	8;  /* Write key */
      __I  uint32_t bRESERVED1          	:	16;  /* Reserved */
    } b;
  } rRESET_REQ;
  union {    /* SYS_RESET_STATOVER Register */
    __IO uint32_t r;
    struct { /* SYS_RESET_STATOVER Bits */
      __I  uint32_t bSOFT               	:	1;  /* Indicates if SOFT Reset is active */
      __I  uint32_t bHARD               	:	1;  /* Indicates if HARD Reset is active */
      __I  uint32_t bREBOOT             	:	1;  /* Indicates if Reboot Reset is active */
      __I  uint32_t bRESERVED0          	:	5;  /* Reserved */
      __IO uint32_t bSOFT_OVER          	:	1;  /* SOFT_Reset overwrite request */
      __IO uint32_t bHARD_OVER          	:	1;  /* HARD_Reset overwrite request */
      __IO uint32_t bRBT_OVER           	:	1;  /* Reboot Reset overwrite request */
      __I  uint32_t bRESERVED1          	:	21;  /* Reserved */
    } b;
  } rRESET_STATOVER;
  uint8_t  RESERVED4[8];
  union {    /* SYS_SYSTEM_STAT Register */
    __I uint32_t r;
    struct { /* SYS_SYSTEM_STAT Bits */
      __I  uint32_t bRESERVED0          	:	3;  /* Reserved */
      __I  uint32_t bDBG_SEC_ACT        	:	1;  /* Debug Security active */
      __I  uint32_t bJTAG_SWD_LOCK_ACT  	:	1;  /* Indicates if JTAG and SWD Lock is active */
      __I  uint32_t bIP_PROT_ACT        	:	1;  /* Indicates if IP protection is active */
      __I  uint32_t bRESERVED1          	:	26;  /* Reserved */
    } b;
  } rSYSTEM_STAT;
} SYSCTL_Type;


/***************************************************************************
// TIMER32 Registers
/***************************************************************************
typedef struct {
  __IO uint32_t rLOAD1; /* Timer 1 Load Register */
  __I uint32_t rVALUE1; /* Timer 1 Current Value Register */
  union {    /* T32CONTROL1 Register */
    __IO uint32_t r;
    struct { /* T32CONTROL1 Bits */
      __IO uint32_t bONESHOT            	:	1;  /* Selects one-shot or wrapping counter mode */
      __IO uint32_t bSIZE               	:	1;  /* Selects 16 or 32 bit counter operation */
      __IO uint32_t bPRESCALE           	:	2;  /* Prescale bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bIE                 	:	1;  /* Interrupt enable bit */
      __IO uint32_t bMODE               	:	1;  /* Mode bit */
      __IO uint32_t bENABLE             	:	1;  /*  */
      __I  uint32_t bRESERVED1          	:	24;  /* Reserved */
    } b;
  } rCONTROL1;
  __O uint32_t rINTCLR1; /* Timer 1 Interrupt Clear Register */
  union {    /* T32RIS1 Register */
    __I uint32_t r;
    struct { /* T32RIS1 Bits */
      __I  uint32_t bRAW_IFG            	:	1;  /* Raw interrupt status */
      __I  uint32_t b                   	:	31;  /*  */
    } b;
  } rRIS1;
  union {    /* T32MIS1 Register */
    __I uint32_t r;
    struct { /* T32MIS1 Bits */
      __I  uint32_t b                   	:	1;  /* Enabled interrupt status */
      __I  uint32_t bRESERVED0          	:	31;  /* Reserved */
    } b;
  } rMIS1;
  __IO uint32_t rBGLOAD1; /* Timer 1 Background Load Register */
  uint8_t  RESERVED0[4];
  __IO uint32_t rLOAD2; /* Timer 2 Load Register */
  __I uint32_t rVALUE2; /* Timer 2 Current Value Register */
  union {    /* T32CONTROL2 Register */
    __IO uint32_t r;
    struct { /* T32CONTROL2 Bits */
      __IO uint32_t bONESHOT            	:	1;  /* Selects one-shot or wrapping counter mode */
      __IO uint32_t bSIZE               	:	1;  /* Selects 16 or 32 bit counter operation */
      __IO uint32_t bPRESCALE           	:	2;  /* Prescale bits */
      __I  uint32_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint32_t bIE                 	:	1;  /* Interrupt enable bit */
      __IO uint32_t bMODE               	:	1;  /* Mode bit */
      __IO uint32_t bENABLE             	:	1;  /*  */
      __I  uint32_t bRESERVED1          	:	24;  /* Reserved */
    } b;
  } rCONTROL2;
  __O uint32_t rINTCLR2; /* Timer 2 Interrupt Clear Register */
  union {    /* T32RIS2 Register */
    __I uint32_t r;
    struct { /* T32RIS2 Bits */
      __I  uint32_t bRAW_IFG            	:	1;  /* Raw interrupt status */
      __I  uint32_t bRESERVED0          	:	31;  /* Reserved */
    } b;
  } rRIS2;
  union {    /* T32MIS2 Register */
    __I uint32_t r;
    struct { /* T32MIS2 Bits */
      __I  uint32_t bIFG                	:	1;  /* Enabled interrupt status */
      __I  uint32_t bRESERVED0          	:	31;  /* Reserved */
    } b;
  } rMIS2;
  __IO uint32_t rBGLOAD2; /* Timer 2 Background Load Register */
} TIMER32_Type;


