helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// TIMER_A2 Registers
/***************************************************************************
typedef struct {
  union {    /* TA2CTL Register */
    __IO uint16_t r;
    struct { /* TA2CTL Bits */
      __IO uint16_t bIFG                	:	1;  /* TimerA interrupt flag */
      __IO uint16_t bIE                 	:	1;  /* TimerA interrupt enable */
      __IO uint16_t bCLR                	:	1;  /* TimerA clear */
      __IO uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bMC                 	:	2;  /* Mode control */
      __IO uint16_t bID                 	:	2;  /* Input divider */
      __IO uint16_t bSSEL               	:	2;  /* TimerA clock source select */
      __IO uint16_t bRESERVED1          	:	6;  /* Reserved */
    } b;
  } rCTL;
  union {    /* TA2CCTL0 Register */
    __IO uint16_t r;
    struct { /* TA2CCTL0 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL0;
  union {    /* TA2CCTL1 Register */
    __IO uint16_t r;
    struct { /* TA2CCTL1 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL1;
  union {    /* TA2CCTL2 Register */
    __IO uint16_t r;
    struct { /* TA2CCTL2 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL2;
  union {    /* TA2CCTL3 Register */
    __IO uint16_t r;
    struct { /* TA2CCTL3 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL3;
  union {    /* TA2CCTL4 Register */
    __IO uint16_t r;
    struct { /* TA2CCTL4 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL4;
  union {    /* TA2CCTL5 Register */
    __IO uint16_t r;
    struct { /* TA2CCTL5 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL5;
  union {    /* TA2CCTL6 Register */
    __IO uint16_t r;
    struct { /* TA2CCTL6 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL6;
  __IO uint16_t rR; /* TimerA register */
  __IO uint16_t rCCR0; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR1; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR2; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR3; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR4; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR5; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR6; /* Timer_A Capture/Compare  Register */
  union {    /* TA2EX0 Register */
    __IO uint16_t r;
    struct { /* TA2EX0 Bits */
      __IO uint16_t bIDEX               	:	3;  /* Input divider expansion */
      __I  uint16_t bRESERVED0          	:	13;  /* Reserved */
    } b;
  } rEX0;
  uint8_t  RESERVED0[12];
  __I uint16_t rIV; /* TimerAx Interrupt Vector Register */
} TIMER_A2_Type;


/***************************************************************************
// TIMER_A3 Registers
/***************************************************************************
typedef struct {
  union {    /* TA3CTL Register */
    __IO uint16_t r;
    struct { /* TA3CTL Bits */
      __IO uint16_t bIFG                	:	1;  /* TimerA interrupt flag */
      __IO uint16_t bIE                 	:	1;  /* TimerA interrupt enable */
      __IO uint16_t bCLR                	:	1;  /* TimerA clear */
      __IO uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bMC                 	:	2;  /* Mode control */
      __IO uint16_t bID                 	:	2;  /* Input divider */
      __IO uint16_t bSSEL               	:	2;  /* TimerA clock source select */
      __IO uint16_t bRESERVED1          	:	6;  /* Reserved */
    } b;
  } rCTL;
  union {    /* TA3CCTL0 Register */
    __IO uint16_t r;
    struct { /* TA3CCTL0 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL0;
  union {    /* TA3CCTL1 Register */
    __IO uint16_t r;
    struct { /* TA3CCTL1 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL1;
  union {    /* TA3CCTL2 Register */
    __IO uint16_t r;
    struct { /* TA3CCTL2 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL2;
  union {    /* TA3CCTL3 Register */
    __IO uint16_t r;
    struct { /* TA3CCTL3 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL3;
  union {    /* TA3CCTL4 Register */
    __IO uint16_t r;
    struct { /* TA3CCTL4 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL4;
  union {    /* TA3CCTL5 Register */
    __IO uint16_t r;
    struct { /* TA3CCTL5 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL5;
  union {    /* TA3CCTL6 Register */
    __IO uint16_t r;
    struct { /* TA3CCTL6 Bits */
      __IO uint16_t bCCIFG              	:	1;  /* Capture/compare interrupt flag */
      __IO uint16_t bCOV                	:	1;  /* Capture overflow */
      __IO uint16_t bOUT                	:	1;  /* Output */
      __I  uint16_t bCCI                	:	1;  /* Capture/compare input */
      __IO uint16_t bCCIE               	:	1;  /* Capture/compare interrupt enable */
      __IO uint16_t bOUTMOD             	:	3;  /* Output mode */
      __IO uint16_t bCAP                	:	1;  /* Capture mode */
      __I  uint16_t bRESERVED0          	:	1;  /* Reserved */
      __IO uint16_t bSCCI               	:	1;  /* Synchronized capture/compare input */
      __IO uint16_t bSCS                	:	1;  /* Synchronize capture source */
      __IO uint16_t bCCIS               	:	2;  /* Capture/compare input select */
      __IO uint16_t bCM                 	:	2;  /* Capture mode */
    } b;
  } rCCTL6;
  __IO uint16_t rR; /* TimerA register */
  __IO uint16_t rCCR0; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR1; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR2; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR3; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR4; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR5; /* Timer_A Capture/Compare  Register */
  __IO uint16_t rCCR6; /* Timer_A Capture/Compare  Register */
  union {    /* TA3EX0 Register */
    __IO uint16_t r;
    struct { /* TA3EX0 Bits */
      __IO uint16_t bIDEX               	:	3;  /* Input divider expansion */
      __I  uint16_t bRESERVED0          	:	13;  /* Reserved */
    } b;
  } rEX0;
  uint8_t  RESERVED0[12];
  __I uint16_t rIV; /* TimerAx Interrupt Vector Register */
} TIMER_A3_Type;


