helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// TLV Registers
/***************************************************************************
typedef struct {
  __IO uint32_t rTLV_CHECKSUM; /* TLV Checksum */
  __IO uint32_t rDEVICE_INFO_TAG; /* Device Info Tag */
  __IO uint32_t rDEVICE_INFO_LEN; /* Device Info Length */
  __IO uint32_t rDEVICE_ID; /* Device ID */
  __IO uint32_t rHWREV; /* HW Revision */
  __IO uint32_t rBCREV; /* Boot Code Revision */
  __IO uint32_t rROM_DRVLIB_REV; /* ROM Driver Library Revision */
  __IO uint32_t rDIE_REC_TAG; /* Die Record Tag */
  __IO uint32_t rDIE_REC_LEN; /* Die Record Length */
  __IO uint32_t rDIE_XPOS; /* Die X-Position */
  __IO uint32_t rDIE_YPOS; /* Die Y-Position */
  __IO uint32_t rWAFER_ID; /* Wafer ID */
  __IO uint32_t rLOT_ID; /* Lot ID */
  __IO uint32_t rRESERVED0; /* Reserved */
  __IO uint32_t rRESERVED1; /* Reserved */
  __IO uint32_t rRESERVED2; /* Reserved */
  __IO uint32_t rTEST_RESULTS; /* Test Results */
  __IO uint32_t rCS_CAL_TAG; /* Clock System Calibration Tag */
  __IO uint32_t rCS_CAL_LEN; /* Clock System Calibration Length */
  __IO uint32_t rDCOIR_FCAL_RSEL04; /* DCO IR mode: Frequency calibration for DCORSEL 0 to 4 */
  __IO uint32_t rDCOIR_FCAL_RSEL5; /* DCO IR mode: Frequency calibration for DCORSEL 5 */
  __IO uint32_t rDCOIR_MAXPOSTUNE_RSEL04; /* DCO IR mode: Max Positive Tune for DCORSEL 0 to 4 */
  __IO uint32_t rDCOIR_MAXNEGTUNE_RSEL04; /* DCO IR mode: Max Negative Tune for DCORSEL 0 to 4 */
  __IO uint32_t rDCOIR_MAXPOSTUNE_RSEL5; /* DCO IR mode: Max Positive Tune for DCORSEL 5 */
  __IO uint32_t rDCOIR_MAXNEGTUNE_RSEL5; /* DCO IR mode: Max Negative Tune for DCORSEL 5 */
  __IO uint32_t rDCOIR_CONSTK_RSEL04; /* DCO IR mode: DCO Constant (K) for DCORSEL 0 to 4 */
  __IO uint32_t rDCOIR_CONSTK_RSEL5; /* DCO IR mode: DCO Constant (K) for DCORSEL 5 */
  __IO uint32_t rDCOER_FCAL_RSEL04; /* DCO ER mode: Frequency calibration for DCORSEL 0 to 4 */
  __IO uint32_t rDCOER_FCAL_RSEL5; /* DCO ER mode: Frequency calibration for DCORSEL 5 */
  __IO uint32_t rDCOER_MAXPOSTUNE_RSEL04; /* DCO ER mode: Max Positive Tune for DCORSEL 0 to 4 */
  __IO uint32_t rDCOER_MAXNEGTUNE_RSEL04; /* DCO ER mode: Max Negative Tune for DCORSEL 0 to 4 */
  __IO uint32_t rDCOER_MAXPOSTUNE_RSEL5; /* DCO ER mode: Max Positive Tune for DCORSEL 5 */
  __IO uint32_t rDCOER_MAXNEGTUNE_RSEL5; /* DCO ER mode: Max Negative Tune for DCORSEL 5 */
  __IO uint32_t rDCOER_CONSTK_RSEL04; /* DCO ER mode: DCO Constant (K) for DCORSEL 0 to 4 */
  __IO uint32_t rDCOER_CONSTK_RSEL5; /* DCO ER mode: DCO Constant (K) for DCORSEL 5 */
  __IO uint32_t rADC14_CAL_TAG; /* ADC14 Calibration Tag */
  __IO uint32_t rADC14_CAL_LEN; /* ADC14 Calibration Length */
  __IO uint32_t rADC14_GF_EXTREF30C; /* ADC14 Gain Factor for External Reference 30°C */
  __IO uint32_t rADC14_GF_EXTREF85C; /* ADC14 Gain Factor for External Reference 85°C */
  __IO uint32_t rADC14_GF_BUF_EXTREF30C; /* ADC14 Gain Factor for Buffered External Reference 30°C */
  __IO uint32_t rADC14_GF_BUF_EXTREF85C; /* ADC14 Gain Factor for Buffered External Reference 85°C */
  __IO uint32_t rADC14_GF_BUF1P2V_INTREF30C_REFOUT0; /* ADC14 Gain Factor for Buffered 1.2V Internal Reference 30°C (REFOUT = 0) */
  __IO uint32_t rADC14_GF_BUF1P2V_INTREF85C_REFOUT0; /* ADC14 Gain Factor for Buffered 1.2V Internal Reference 85°C (REFOUT = 0) */
  __IO uint32_t rADC14_GF_BUF1P2V_INTREF30C_REFOUT1; /* ADC14 Gain Factor for Buffered 1.2V Internal Reference 30°C (REFOUT = 1) */
  __IO uint32_t rADC14_GF_BUF1P2V_INTREF85C_REFOUT1; /* ADC14 Gain Factor for Buffered 1.2V Internal Reference 85°C (REFOUT = 1) */
  __IO uint32_t rADC14_GF_BUF1P45V_INTREF30C_REFOUT0; /* ADC14 Gain Factor for Buffered 1.45V Internal Reference 30°C (REFOUT = 0) */
  __IO uint32_t rADC14_GF_BUF1P45V_INTREF85C_REFOUT0; /* ADC14 Gain Factor for Buffered 1.45V Internal Reference 85°C (REFOUT = 0) */
  __IO uint32_t rADC14_GF_BUF1P45V_INTREF30C_REFOUT1; /* ADC14 Gain Factor for Buffered 1.45V Internal Reference 30°C (REFOUT = 1) */
  __IO uint32_t rADC14_GF_BUF1P45V_INTREF85C_REFOUT1; /* ADC14 Gain Factor for Buffered 1.45V Internal Reference 85°C (REFOUT = 1) */
  __IO uint32_t rADC14_GF_BUF2P5V_INTREF30C_REFOUT0; /* ADC14 Gain Factor for Buffered 2.5V Internal Reference 30°C (REFOUT = 0) */
  __IO uint32_t rADC14_GF_BUF2P5V_INTREF85C_REFOUT0; /* ADC14 Gain Factor for Buffered 2.5V Internal Reference 85°C (REFOUT = 0) */
  __IO uint32_t rADC14_GF_BUF2P5V_INTREF30C_REFOUT1; /* ADC14 Gain Factor for Buffered 2.5V Internal Reference 30°C (REFOUT = 1) */
  __IO uint32_t rADC14_GF_BUF2P5V_INTREF85C_REFOUT1; /* ADC14 Gain Factor for Buffered 2.5V Internal Reference 85°C (REFOUT = 1) */
  __IO uint32_t rADC14_OFFSET_VRSEL_1; /* ADC14 Offset (ADC14VRSEL = 1h) */
  __IO uint32_t rADC14_OFFSET_VRSEL_E; /* ADC14 Offset (ADC14VRSEL = Eh) */
  __IO uint32_t rADC14_REF1P2V_TS30C; /* ADC14 1.2V Reference Temp. Sensor 30°C */
  __IO uint32_t rADC14_REF1P2V_TS85C; /* ADC14 1.2V Reference Temp. Sensor 85°C */
  __IO uint32_t rADC14_REF1P45V_TS30C; /* ADC14 1.45V Reference Temp. Sensor 30°C */
  __IO uint32_t rADC14_REF1P45V_TS85C; /* ADC14 1.45V Reference Temp. Sensor 85°C */
  __IO uint32_t rADC14_REF2P5V_TS30C; /* ADC14 2.5V Reference Temp. Sensor 30°C */
  __IO uint32_t rADC14_REF2P5V_TS85C; /* ADC14 2.5V Reference Temp. Sensor 85°C */
  __IO uint32_t rREF_CAL_TAG; /* REF Calibration Tag */
  __IO uint32_t rREF_CAL_LEN; /* REF Calibration Length */
  __IO uint32_t rREF_1P2V; /* REF 1.2V Reference */
  __IO uint32_t rREF_1P45V; /* REF 1.45V Reference */
  __IO uint32_t rREF_2P5V; /* REF 2.5V Reference */
  __IO uint32_t rRANDOM_NUM_TAG; /* 128-bit Random Number Tag */
  __IO uint32_t rRANDOM_NUM_LEN; /* 128-bit Random Number Length */
  __IO uint32_t rRANDOM_NUM_1; /* 32-bit Random Number 1 */
  __IO uint32_t rRANDOM_NUM_2; /* 32-bit Random Number 2 */
  __IO uint32_t rRANDOM_NUM_3; /* 32-bit Random Number 3 */
  __IO uint32_t rRANDOM_NUM_4; /* 32-bit Random Number 4 */
  __IO uint32_t rBSL_CFG_TAG; /* BSL Configuration Tag */
  __IO uint32_t rBSL_CFG_LEN; /* BSL Configuration Length */
  __IO uint32_t rBSL_PERIPHIF_SEL; /* BSL Peripheral Interface Selection */
  __IO uint32_t rBSL_PORTIF_CFG_UART; /* BSL Port Interface Configuration for UART */
  __IO uint32_t rBSL_PORTIF_CFG_SPI; /* BSL Port Interface Configuration for SPI */
  __IO uint32_t rBSL_PORTIF_CFG_I2C; /* BSL Port Interface Configuration for I2C */
  __IO uint32_t rTLV_END; /* TLV End Word */
} TLV_Type;


/***************************************************************************
// WDT_A Registers
/***************************************************************************
typedef struct {
  uint8_t  RESERVED0[12];
  union {    /* WDTCTL Register */
    __IO uint16_t r;
    struct { /* WDTCTL Bits */
      __IO uint16_t bIS                 	:	3;  /* Watchdog timer interval select */
      __O  uint16_t bCNTCL              	:	1;  /* Watchdog timer counter clear */
      __IO uint16_t bTMSEL              	:	1;  /* Watchdog timer mode select */
      __IO uint16_t bSSEL               	:	2;  /* Watchdog timer clock source select */
      __IO uint16_t bHOLD               	:	1;  /* Watchdog timer hold */
      __IO uint16_t bPW                 	:	8;  /* Watchdog timer password */
    } b;
  } rCTL;
} WDT_A_Type;


/***************************************************************************
// Peripheral register control bits
/***************************************************************************

