helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// ADC14 Bits
/***************************************************************************
/* ADC14CTL0[ADC14SC] Bits */
#define ADC14SC_OFS                                        ( 0)                  /* ADC14SC Offset */
#define ADC14SC                                            (0x00000001)          /* ADC14 start conversion */
/* ADC14CTL0[ADC14ENC] Bits */
#define ADC14ENC_OFS                                       ( 1)                  /* ADC14ENC Offset */
#define ADC14ENC                                           (0x00000002)          /* ADC14 enable conversion */
/* ADC14CTL0[ADC14ON] Bits */
#define ADC14ON_OFS                                        ( 4)                  /* ADC14ON Offset */
#define ADC14ON                                            (0x00000010)          /* ADC14 on */
/* ADC14CTL0[ADC14MSC] Bits */
#define ADC14MSC_OFS                                       ( 7)                  /* ADC14MSC Offset */
#define ADC14MSC                                           (0x00000080)          /* ADC14 multiple sample and conversion */
/* ADC14CTL0[ADC14SHT0] Bits */
#define ADC14SHT0_OFS                                      ( 8)                  /* ADC14SHT0 Offset */
#define ADC14SHT0_M                                        (0x00000f00)          /* ADC14 sample-and-hold time */
#define ADC14SHT00                                         (0x00000100)          /* ADC14 sample-and-hold time */
#define ADC14SHT01                                         (0x00000200)          /* ADC14 sample-and-hold time */
#define ADC14SHT02                                         (0x00000400)          /* ADC14 sample-and-hold time */
#define ADC14SHT03                                         (0x00000800)          /* ADC14 sample-and-hold time */
#define ADC14SHT0_0                                        (0x00000000)          /* 4 */
#define ADC14SHT0_1                                        (0x00000100)          /* 8 */
#define ADC14SHT0_2                                        (0x00000200)          /* 16 */
#define ADC14SHT0_3                                        (0x00000300)          /* 32 */
#define ADC14SHT0_4                                        (0x00000400)          /* 64 */
#define ADC14SHT0_5                                        (0x00000500)          /* 96 */
#define ADC14SHT0_6                                        (0x00000600)          /* 128 */
#define ADC14SHT0_7                                        (0x00000700)          /* 192 */
#define ADC14SHT0__4                                       (0x00000000)          /* 4 */
#define ADC14SHT0__8                                       (0x00000100)          /* 8 */
#define ADC14SHT0__16                                      (0x00000200)          /* 16 */
#define ADC14SHT0__32                                      (0x00000300)          /* 32 */
#define ADC14SHT0__64                                      (0x00000400)          /* 64 */
#define ADC14SHT0__96                                      (0x00000500)          /* 96 */
#define ADC14SHT0__128                                     (0x00000600)          /* 128 */
#define ADC14SHT0__192                                     (0x00000700)          /* 192 */
/* ADC14CTL0[ADC14SHT1] Bits */
#define ADC14SHT1_OFS                                      (12)                  /* ADC14SHT1 Offset */
#define ADC14SHT1_M                                        (0x0000f000)          /* ADC14 sample-and-hold time */
#define ADC14SHT10                                         (0x00001000)          /* ADC14 sample-and-hold time */
#define ADC14SHT11                                         (0x00002000)          /* ADC14 sample-and-hold time */
#define ADC14SHT12                                         (0x00004000)          /* ADC14 sample-and-hold time */
#define ADC14SHT13                                         (0x00008000)          /* ADC14 sample-and-hold time */
#define ADC14SHT1_0                                        (0x00000000)          /* 4 */
#define ADC14SHT1_1                                        (0x00001000)          /* 8 */
#define ADC14SHT1_2                                        (0x00002000)          /* 16 */
#define ADC14SHT1_3                                        (0x00003000)          /* 32 */
#define ADC14SHT1_4                                        (0x00004000)          /* 64 */
#define ADC14SHT1_5                                        (0x00005000)          /* 96 */
#define ADC14SHT1_6                                        (0x00006000)          /* 128 */
#define ADC14SHT1_7                                        (0x00007000)          /* 192 */
#define ADC14SHT1__4                                       (0x00000000)          /* 4 */
#define ADC14SHT1__8                                       (0x00001000)          /* 8 */
#define ADC14SHT1__16                                      (0x00002000)          /* 16 */
#define ADC14SHT1__32                                      (0x00003000)          /* 32 */
#define ADC14SHT1__64                                      (0x00004000)          /* 64 */
#define ADC14SHT1__96                                      (0x00005000)          /* 96 */
#define ADC14SHT1__128                                     (0x00006000)          /* 128 */
#define ADC14SHT1__192                                     (0x00007000)          /* 192 */
/* ADC14CTL0[ADC14BUSY] Bits */
#define ADC14BUSY_OFS                                      (16)                  /* ADC14BUSY Offset */
#define ADC14BUSY                                          (0x00010000)          /* ADC14 busy */
/* ADC14CTL0[ADC14CONSEQ] Bits */
#define ADC14CONSEQ_OFS                                    (17)                  /* ADC14CONSEQ Offset */
#define ADC14CONSEQ_M                                      (0x00060000)          /* ADC14 conversion sequence mode select */
#define ADC14CONSEQ0                                       (0x00020000)          /* ADC14 conversion sequence mode select */
#define ADC14CONSEQ1                                       (0x00040000)          /* ADC14 conversion sequence mode select */
#define ADC14CONSEQ_0                                      (0x00000000)          /* Single-channel, single-conversion */
#define ADC14CONSEQ_1                                      (0x00020000)          /* Sequence-of-channels */
#define ADC14CONSEQ_2                                      (0x00040000)          /* Repeat-single-channel */
#define ADC14CONSEQ_3                                      (0x00060000)          /* Repeat-sequence-of-channels */
/* ADC14CTL0[ADC14SSEL] Bits */
#define ADC14SSEL_OFS                                      (19)                  /* ADC14SSEL Offset */
#define ADC14SSEL_M                                        (0x00380000)          /* ADC14 clock source select */
#define ADC14SSEL0                                         (0x00080000)          /* ADC14 clock source select */
#define ADC14SSEL1                                         (0x00100000)          /* ADC14 clock source select */
#define ADC14SSEL2                                         (0x00200000)          /* ADC14 clock source select */
#define ADC14SSEL_0                                        (0x00000000)          /* MODCLK */
#define ADC14SSEL_1                                        (0x00080000)          /* SYSCLK */
#define ADC14SSEL_2                                        (0x00100000)          /* ACLK */
#define ADC14SSEL_3                                        (0x00180000)          /* MCLK */
#define ADC14SSEL_4                                        (0x00200000)          /* SMCLK */
#define ADC14SSEL_5                                        (0x00280000)          /* HSMCLK */
#define ADC14SSEL__MODCLK                                  (0x00000000)          /* MODCLK */
#define ADC14SSEL__SYSCLK                                  (0x00080000)          /* SYSCLK */
#define ADC14SSEL__ACLK                                    (0x00100000)          /* ACLK */
#define ADC14SSEL__MCLK                                    (0x00180000)          /* MCLK */
#define ADC14SSEL__SMCLK                                   (0x00200000)          /* SMCLK */
#define ADC14SSEL__HSMCLK                                  (0x00280000)          /* HSMCLK */
/* ADC14CTL0[ADC14DIV] Bits */
#define ADC14DIV_OFS                                       (22)                  /* ADC14DIV Offset */
#define ADC14DIV_M                                         (0x01c00000)          /* ADC14 clock divider */
#define ADC14DIV0                                          (0x00400000)          /* ADC14 clock divider */
#define ADC14DIV1                                          (0x00800000)          /* ADC14 clock divider */
#define ADC14DIV2                                          (0x01000000)          /* ADC14 clock divider */
#define ADC14DIV_0                                         (0x00000000)          /* /1 */
#define ADC14DIV_1                                         (0x00400000)          /* /2 */
#define ADC14DIV_2                                         (0x00800000)          /* /3 */
#define ADC14DIV_3                                         (0x00c00000)          /* /4 */
#define ADC14DIV_4                                         (0x01000000)          /* /5 */
#define ADC14DIV_5                                         (0x01400000)          /* /6 */
#define ADC14DIV_6                                         (0x01800000)          /* /7 */
#define ADC14DIV_7                                         (0x01c00000)          /* /8 */
#define ADC14DIV__1                                        (0x00000000)          /* /1 */
#define ADC14DIV__2                                        (0x00400000)          /* /2 */
#define ADC14DIV__3                                        (0x00800000)          /* /3 */
#define ADC14DIV__4                                        (0x00c00000)          /* /4 */
#define ADC14DIV__5                                        (0x01000000)          /* /5 */
#define ADC14DIV__6                                        (0x01400000)          /* /6 */
#define ADC14DIV__7                                        (0x01800000)          /* /7 */
#define ADC14DIV__8                                        (0x01c00000)          /* /8 */
/* ADC14CTL0[ADC14ISSH] Bits */
#define ADC14ISSH_OFS                                      (25)                  /* ADC14ISSH Offset */
#define ADC14ISSH                                          (0x02000000)          /* ADC14 invert signal sample-and-hold */
/* ADC14CTL0[ADC14SHP] Bits */
#define ADC14SHP_OFS                                       (26)                  /* ADC14SHP Offset */
#define ADC14SHP                                           (0x04000000)          /* ADC14 sample-and-hold pulse-mode select */
/* ADC14CTL0[ADC14SHS] Bits */
#define ADC14SHS_OFS                                       (27)                  /* ADC14SHS Offset */
#define ADC14SHS_M                                         (0x38000000)          /* ADC14 sample-and-hold source select */
#define ADC14SHS0                                          (0x08000000)          /* ADC14 sample-and-hold source select */
#define ADC14SHS1                                          (0x10000000)          /* ADC14 sample-and-hold source select */
#define ADC14SHS2                                          (0x20000000)          /* ADC14 sample-and-hold source select */
#define ADC14SHS_0                                         (0x00000000)          /* ADC14SC bit */
#define ADC14SHS_1                                         (0x08000000)          /* See device-specific data sheet for source */
#define ADC14SHS_2                                         (0x10000000)          /* See device-specific data sheet for source */
#define ADC14SHS_3                                         (0x18000000)          /* See device-specific data sheet for source */
#define ADC14SHS_4                                         (0x20000000)          /* See device-specific data sheet for source */
#define ADC14SHS_5                                         (0x28000000)          /* See device-specific data sheet for source */
#define ADC14SHS_6                                         (0x30000000)          /* See device-specific data sheet for source */
#define ADC14SHS_7                                         (0x38000000)          /* See device-specific data sheet for source */
/* ADC14CTL0[ADC14PDIV] Bits */
#define ADC14PDIV_OFS                                      (30)                  /* ADC14PDIV Offset */
#define ADC14PDIV_M                                        (0xc0000000)          /* ADC14 predivider */
#define ADC14PDIV0                                         (0x40000000)          /* ADC14 predivider */
#define ADC14PDIV1                                         (0x80000000)          /* ADC14 predivider */
#define ADC14PDIV_0                                        (0x00000000)          /* Predivide by 1 */
#define ADC14PDIV_1                                        (0x40000000)          /* Predivide by 4 */
#define ADC14PDIV_2                                        (0x80000000)          /* Predivide by 32 */
#define ADC14PDIV_3                                        (0xc0000000)          /* Predivide by 64 */
#define ADC14PDIV__1                                       (0x00000000)          /* Predivide by 1 */
#define ADC14PDIV__4                                       (0x40000000)          /* Predivide by 4 */
#define ADC14PDIV__32                                      (0x80000000)          /* Predivide by 32 */
#define ADC14PDIV__64                                      (0xc0000000)          /* Predivide by 64 */
/* ADC14CTL1[ADC14PWRMD] Bits */
#define ADC14PWRMD_OFS                                     ( 0)                  /* ADC14PWRMD Offset */
#define ADC14PWRMD_M                                       (0x00000003)          /* ADC14 power modes */
#define ADC14PWRMD0                                        (0x00000001)          /* ADC14 power modes */
#define ADC14PWRMD1                                        (0x00000002)          /* ADC14 power modes */
#define ADC14PWRMD_0                                       (0x00000000)          /* Regular power mode for use with any resolution setting. Sample rate can be up to 1 Msps. */
#define ADC14PWRMD_2                                       (0x00000002)          /* Low-power mode for 12-bit, 10-bit, and 8-bit resolution settings. Sample rate must not exceed 200 ksps. */
/* ADC14CTL1[ADC14REFBURST] Bits */
#define ADC14REFBURST_OFS                                  ( 2)                  /* ADC14REFBURST Offset */
#define ADC14REFBURST                                      (0x00000004)          /* ADC14 reference buffer burst */
/* ADC14CTL1[ADC14DF] Bits */
#define ADC14DF_OFS                                        ( 3)                  /* ADC14DF Offset */
#define ADC14DF                                            (0x00000008)          /* ADC14 data read-back format */
/* ADC14CTL1[ADC14RES] Bits */
#define ADC14RES_OFS                                       ( 4)                  /* ADC14RES Offset */
#define ADC14RES_M                                         (0x00000030)          /* ADC14 resolution */
#define ADC14RES0                                          (0x00000010)          /* ADC14 resolution */
#define ADC14RES1                                          (0x00000020)          /* ADC14 resolution */
#define ADC14RES_0                                         (0x00000000)          /* 8 bit (9 clock cycle conversion time) */
#define ADC14RES_1                                         (0x00000010)          /* 10 bit (11 clock cycle conversion time) */
#define ADC14RES_2                                         (0x00000020)          /* 12 bit (14 clock cycle conversion time) */
#define ADC14RES_3                                         (0x00000030)          /* 14 bit (16 clock cycle conversion time) */
#define ADC14RES__8BIT                                     (0x00000000)          /* 8 bit (9 clock cycle conversion time) */
#define ADC14RES__10BIT                                    (0x00000010)          /* 10 bit (11 clock cycle conversion time) */
#define ADC14RES__12BIT                                    (0x00000020)          /* 12 bit (14 clock cycle conversion time) */
#define ADC14RES__14BIT                                    (0x00000030)          /* 14 bit (16 clock cycle conversion time) */
/* ADC14CTL1[ADC14CSTARTADD] Bits */
#define ADC14CSTARTADD_OFS                                 (16)                  /* ADC14CSTARTADD Offset */
#define ADC14CSTARTADD_M                                   (0x001f0000)          /* ADC14 conversion start address */
/* ADC14CTL1[ADC14BATMAP] Bits */
#define ADC14BATMAP_OFS                                    (22)                  /* ADC14BATMAP Offset */
#define ADC14BATMAP                                        (0x00400000)          /* Controls 1/2 AVCC ADC input channel selection */
/* ADC14CTL1[ADC14TCMAP] Bits */
#define ADC14TCMAP_OFS                                     (23)                  /* ADC14TCMAP Offset */
#define ADC14TCMAP                                         (0x00800000)          /* Controls temperature sensor ADC input channel selection */
/* ADC14CTL1[ADC14CH0MAP] Bits */
#define ADC14CH0MAP_OFS                                    (24)                  /* ADC14CH0MAP Offset */
#define ADC14CH0MAP                                        (0x01000000)          /* Controls internal channel 0 selection to ADC input channel MAX-2 */
/* ADC14CTL1[ADC14CH1MAP] Bits */
#define ADC14CH1MAP_OFS                                    (25)                  /* ADC14CH1MAP Offset */
#define ADC14CH1MAP                                        (0x02000000)          /* Controls internal channel 1 selection to ADC input channel MAX-3 */
/* ADC14CTL1[ADC14CH2MAP] Bits */
#define ADC14CH2MAP_OFS                                    (26)                  /* ADC14CH2MAP Offset */
#define ADC14CH2MAP                                        (0x04000000)          /* Controls internal channel 2 selection to ADC input channel MAX-4 */
/* ADC14CTL1[ADC14CH3MAP] Bits */
#define ADC14CH3MAP_OFS                                    (27)                  /* ADC14CH3MAP Offset */
#define ADC14CH3MAP                                        (0x08000000)          /* Controls internal channel 3 selection to ADC input channel MAX-5 */
/* ADC14LO0[ADC14LO0] Bits */
#define ADC14LO0_OFS                                       ( 0)                  /* ADC14LO0 Offset */
#define ADC14LO0_M                                         (0x0000ffff)          /* Low threshold 0 */
/* ADC14HI0[ADC14HI0] Bits */
#define ADC14HI0_OFS                                       ( 0)                  /* ADC14HI0 Offset */
#define ADC14HI0_M                                         (0x0000ffff)          /* High threshold 0 */
/* ADC14LO1[ADC14LO1] Bits */
#define ADC14LO1_OFS                                       ( 0)                  /* ADC14LO1 Offset */
#define ADC14LO1_M                                         (0x0000ffff)          /* Low threshold 1 */
/* ADC14HI1[ADC14HI1] Bits */
#define ADC14HI1_OFS                                       ( 0)                  /* ADC14HI1 Offset */
#define ADC14HI1_M                                         (0x0000ffff)          /* High threshold 1 */
/* ADC14MCTL[ADC14INCH] Bits */
#define ADC14INCH_OFS                                      ( 0)                  /* ADC14INCH Offset */
#define ADC14INCH_M                                        (0x0000001f)          /* Input channel select */
#define ADC14INCH0                                         (0x00000001)          /* Input channel select */
#define ADC14INCH1                                         (0x00000002)          /* Input channel select */
#define ADC14INCH2                                         (0x00000004)          /* Input channel select */
#define ADC14INCH3                                         (0x00000008)          /* Input channel select */
#define ADC14INCH4                                         (0x00000010)          /* Input channel select */
#define ADC14INCH_0                                        (0x00000000)          /* If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1 */
#define ADC14INCH_1                                        (0x00000001)          /* If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1 */
#define ADC14INCH_2                                        (0x00000002)          /* If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3 */
#define ADC14INCH_3                                        (0x00000003)          /* If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3 */
#define ADC14INCH_4                                        (0x00000004)          /* If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5 */
#define ADC14INCH_5                                        (0x00000005)          /* If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5 */
#define ADC14INCH_6                                        (0x00000006)          /* If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7 */
#define ADC14INCH_7                                        (0x00000007)          /* If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7 */
#define ADC14INCH_8                                        (0x00000008)          /* If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9 */
#define ADC14INCH_9                                        (0x00000009)          /* If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9 */
#define ADC14INCH_10                                       (0x0000000a)          /* If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11 */
#define ADC14INCH_11                                       (0x0000000b)          /* If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11 */
#define ADC14INCH_12                                       (0x0000000c)          /* If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13 */
#define ADC14INCH_13                                       (0x0000000d)          /* If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13 */
#define ADC14INCH_14                                       (0x0000000e)          /* If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15 */
#define ADC14INCH_15                                       (0x0000000f)          /* If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15 */
#define ADC14INCH_16                                       (0x00000010)          /* If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17 */
#define ADC14INCH_17                                       (0x00000011)          /* If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17 */
#define ADC14INCH_18                                       (0x00000012)          /* If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19 */
#define ADC14INCH_19                                       (0x00000013)          /* If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19 */
#define ADC14INCH_20                                       (0x00000014)          /* If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21 */
#define ADC14INCH_21                                       (0x00000015)          /* If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21 */
#define ADC14INCH_22                                       (0x00000016)          /* If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23 */
