helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
#define ADC14INCH_23                                       (0x00000017)          /* If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23 */
#define ADC14INCH_24                                       (0x00000018)          /* If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25 */
#define ADC14INCH_25                                       (0x00000019)          /* If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25 */
#define ADC14INCH_26                                       (0x0000001a)          /* If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27 */
#define ADC14INCH_27                                       (0x0000001b)          /* If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27 */
#define ADC14INCH_28                                       (0x0000001c)          /* If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29 */
#define ADC14INCH_29                                       (0x0000001d)          /* If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29 */
#define ADC14INCH_30                                       (0x0000001e)          /* If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31 */
#define ADC14INCH_31                                       (0x0000001f)          /* If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31 */
/* ADC14MCTL[ADC14EOS] Bits */
#define ADC14EOS_OFS                                       ( 7)                  /* ADC14EOS Offset */
#define ADC14EOS                                           (0x00000080)          /* End of sequence */
/* ADC14MCTL[ADC14VRSEL] Bits */
#define ADC14VRSEL_OFS                                     ( 8)                  /* ADC14VRSEL Offset */
#define ADC14VRSEL_M                                       (0x00000f00)          /* Selects combinations of V(R+) and V(R-) sources */
#define ADC14VRSEL0                                        (0x00000100)          /* Selects combinations of V(R+) and V(R-) sources */
#define ADC14VRSEL1                                        (0x00000200)          /* Selects combinations of V(R+) and V(R-) sources */
#define ADC14VRSEL2                                        (0x00000400)          /* Selects combinations of V(R+) and V(R-) sources */
#define ADC14VRSEL3                                        (0x00000800)          /* Selects combinations of V(R+) and V(R-) sources */
#define ADC14VRSEL_0                                       (0x00000000)          /* V(R+) = AVCC, V(R-) = AVSS */
#define ADC14VRSEL_1                                       (0x00000100)          /* V(R+) = VREF buffered, V(R-) = AVSS */
#define ADC14VRSEL_14                                      (0x00000e00)          /* V(R+) = VeREF+, V(R-) = VeREF- */
#define ADC14VRSEL_15                                      (0x00000f00)          /* V(R+) = VeREF+ buffered, V(R-) = VeREF */
/* ADC14MCTL[ADC14DIF] Bits */
#define ADC14DIF_OFS                                       (13)                  /* ADC14DIF Offset */
#define ADC14DIF                                           (0x00002000)          /* Differential mode */
/* ADC14MCTL[ADC14WINC] Bits */
#define ADC14WINC_OFS                                      (14)                  /* ADC14WINC Offset */
#define ADC14WINC                                          (0x00004000)          /* Comparator window enable */
/* ADC14MCTL[ADC14WINCTH] Bits */
#define ADC14WINCTH_OFS                                    (15)                  /* ADC14WINCTH Offset */
#define ADC14WINCTH                                        (0x00008000)          /* Window comparator threshold register selection */
/* ADC14MEM[CONVERSION_RESULTS] Bits */
#define CONVERSION_RESULTS_OFS                             ( 0)                  /* Conversion_Results Offset */
#define CONVERSION_RESULTS_M                               (0x0000ffff)          /* Conversion Result */
/* ADC14IER0[ADC14IE0] Bits */
#define ADC14IE0_OFS                                       ( 0)                  /* ADC14IE0 Offset */
#define ADC14IE0                                           (0x00000001)          /* Interrupt enable */
/* ADC14IER0[ADC14IE1] Bits */
#define ADC14IE1_OFS                                       ( 1)                  /* ADC14IE1 Offset */
#define ADC14IE1                                           (0x00000002)          /* Interrupt enable */
/* ADC14IER0[ADC14IE2] Bits */
#define ADC14IE2_OFS                                       ( 2)                  /* ADC14IE2 Offset */
#define ADC14IE2                                           (0x00000004)          /* Interrupt enable */
/* ADC14IER0[ADC14IE3] Bits */
#define ADC14IE3_OFS                                       ( 3)                  /* ADC14IE3 Offset */
#define ADC14IE3                                           (0x00000008)          /* Interrupt enable */
/* ADC14IER0[ADC14IE4] Bits */
#define ADC14IE4_OFS                                       ( 4)                  /* ADC14IE4 Offset */
#define ADC14IE4                                           (0x00000010)          /* Interrupt enable */
/* ADC14IER0[ADC14IE5] Bits */
#define ADC14IE5_OFS                                       ( 5)                  /* ADC14IE5 Offset */
#define ADC14IE5                                           (0x00000020)          /* Interrupt enable */
/* ADC14IER0[ADC14IE6] Bits */
#define ADC14IE6_OFS                                       ( 6)                  /* ADC14IE6 Offset */
#define ADC14IE6                                           (0x00000040)          /* Interrupt enable */
/* ADC14IER0[ADC14IE7] Bits */
#define ADC14IE7_OFS                                       ( 7)                  /* ADC14IE7 Offset */
#define ADC14IE7                                           (0x00000080)          /* Interrupt enable */
/* ADC14IER0[ADC14IE8] Bits */
#define ADC14IE8_OFS                                       ( 8)                  /* ADC14IE8 Offset */
#define ADC14IE8                                           (0x00000100)          /* Interrupt enable */
/* ADC14IER0[ADC14IE9] Bits */
#define ADC14IE9_OFS                                       ( 9)                  /* ADC14IE9 Offset */
#define ADC14IE9                                           (0x00000200)          /* Interrupt enable */
/* ADC14IER0[ADC14IE10] Bits */
#define ADC14IE10_OFS                                      (10)                  /* ADC14IE10 Offset */
#define ADC14IE10                                          (0x00000400)          /* Interrupt enable */
/* ADC14IER0[ADC14IE11] Bits */
#define ADC14IE11_OFS                                      (11)                  /* ADC14IE11 Offset */
#define ADC14IE11                                          (0x00000800)          /* Interrupt enable */
/* ADC14IER0[ADC14IE12] Bits */
#define ADC14IE12_OFS                                      (12)                  /* ADC14IE12 Offset */
#define ADC14IE12                                          (0x00001000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE13] Bits */
#define ADC14IE13_OFS                                      (13)                  /* ADC14IE13 Offset */
#define ADC14IE13                                          (0x00002000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE14] Bits */
#define ADC14IE14_OFS                                      (14)                  /* ADC14IE14 Offset */
#define ADC14IE14                                          (0x00004000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE15] Bits */
#define ADC14IE15_OFS                                      (15)                  /* ADC14IE15 Offset */
#define ADC14IE15                                          (0x00008000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE16] Bits */
#define ADC14IE16_OFS                                      (16)                  /* ADC14IE16 Offset */
#define ADC14IE16                                          (0x00010000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE17] Bits */
#define ADC14IE17_OFS                                      (17)                  /* ADC14IE17 Offset */
#define ADC14IE17                                          (0x00020000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE19] Bits */
#define ADC14IE19_OFS                                      (19)                  /* ADC14IE19 Offset */
#define ADC14IE19                                          (0x00080000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE18] Bits */
#define ADC14IE18_OFS                                      (18)                  /* ADC14IE18 Offset */
#define ADC14IE18                                          (0x00040000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE20] Bits */
#define ADC14IE20_OFS                                      (20)                  /* ADC14IE20 Offset */
#define ADC14IE20                                          (0x00100000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE21] Bits */
#define ADC14IE21_OFS                                      (21)                  /* ADC14IE21 Offset */
#define ADC14IE21                                          (0x00200000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE22] Bits */
#define ADC14IE22_OFS                                      (22)                  /* ADC14IE22 Offset */
#define ADC14IE22                                          (0x00400000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE23] Bits */
#define ADC14IE23_OFS                                      (23)                  /* ADC14IE23 Offset */
#define ADC14IE23                                          (0x00800000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE24] Bits */
#define ADC14IE24_OFS                                      (24)                  /* ADC14IE24 Offset */
#define ADC14IE24                                          (0x01000000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE25] Bits */
#define ADC14IE25_OFS                                      (25)                  /* ADC14IE25 Offset */
#define ADC14IE25                                          (0x02000000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE26] Bits */
#define ADC14IE26_OFS                                      (26)                  /* ADC14IE26 Offset */
#define ADC14IE26                                          (0x04000000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE27] Bits */
#define ADC14IE27_OFS                                      (27)                  /* ADC14IE27 Offset */
#define ADC14IE27                                          (0x08000000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE28] Bits */
#define ADC14IE28_OFS                                      (28)                  /* ADC14IE28 Offset */
#define ADC14IE28                                          (0x10000000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE29] Bits */
#define ADC14IE29_OFS                                      (29)                  /* ADC14IE29 Offset */
#define ADC14IE29                                          (0x20000000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE30] Bits */
#define ADC14IE30_OFS                                      (30)                  /* ADC14IE30 Offset */
#define ADC14IE30                                          (0x40000000)          /* Interrupt enable */
/* ADC14IER0[ADC14IE31] Bits */
#define ADC14IE31_OFS                                      (31)                  /* ADC14IE31 Offset */
#define ADC14IE31                                          (0x80000000)          /* Interrupt enable */
/* ADC14IER1[ADC14INIE] Bits */
#define ADC14INIE_OFS                                      ( 1)                  /* ADC14INIE Offset */
#define ADC14INIE                                          (0x00000002)          /* Interrupt enable for ADC14MEMx within comparator window */
/* ADC14IER1[ADC14LOIE] Bits */
#define ADC14LOIE_OFS                                      ( 2)                  /* ADC14LOIE Offset */
#define ADC14LOIE                                          (0x00000004)          /* Interrupt enable for ADC14MEMx below comparator window */
/* ADC14IER1[ADC14HIIE] Bits */
#define ADC14HIIE_OFS                                      ( 3)                  /* ADC14HIIE Offset */
#define ADC14HIIE                                          (0x00000008)          /* Interrupt enable for ADC14MEMx above comparator window */
/* ADC14IER1[ADC14OVIE] Bits */
#define ADC14OVIE_OFS                                      ( 4)                  /* ADC14OVIE Offset */
#define ADC14OVIE                                          (0x00000010)          /* ADC14MEMx overflow-interrupt enable */
/* ADC14IER1[ADC14TOVIE] Bits */
#define ADC14TOVIE_OFS                                     ( 5)                  /* ADC14TOVIE Offset */
#define ADC14TOVIE                                         (0x00000020)          /* ADC14 conversion-time-overflow interrupt enable */
/* ADC14IER1[ADC14RDYIE] Bits */
#define ADC14RDYIE_OFS                                     ( 6)                  /* ADC14RDYIE Offset */
#define ADC14RDYIE                                         (0x00000040)          /* ADC14 local buffered reference ready interrupt enable */
/* ADC14IFGR0[ADC14IFG0] Bits */
#define ADC14IFG0_OFS                                      ( 0)                  /* ADC14IFG0 Offset */
#define ADC14IFG0                                          (0x00000001)          /* ADC14MEM0 interrupt flag */
/* ADC14IFGR0[ADC14IFG1] Bits */
#define ADC14IFG1_OFS                                      ( 1)                  /* ADC14IFG1 Offset */
#define ADC14IFG1                                          (0x00000002)          /* ADC14MEM1 interrupt flag */
/* ADC14IFGR0[ADC14IFG2] Bits */
#define ADC14IFG2_OFS                                      ( 2)                  /* ADC14IFG2 Offset */
#define ADC14IFG2                                          (0x00000004)          /* ADC14MEM2 interrupt flag */
/* ADC14IFGR0[ADC14IFG3] Bits */
#define ADC14IFG3_OFS                                      ( 3)                  /* ADC14IFG3 Offset */
#define ADC14IFG3                                          (0x00000008)          /* ADC14MEM3 interrupt flag */
/* ADC14IFGR0[ADC14IFG4] Bits */
#define ADC14IFG4_OFS                                      ( 4)                  /* ADC14IFG4 Offset */
#define ADC14IFG4                                          (0x00000010)          /* ADC14MEM4 interrupt flag */
/* ADC14IFGR0[ADC14IFG5] Bits */
#define ADC14IFG5_OFS                                      ( 5)                  /* ADC14IFG5 Offset */
#define ADC14IFG5                                          (0x00000020)          /* ADC14MEM5 interrupt flag */
/* ADC14IFGR0[ADC14IFG6] Bits */
#define ADC14IFG6_OFS                                      ( 6)                  /* ADC14IFG6 Offset */
#define ADC14IFG6                                          (0x00000040)          /* ADC14MEM6 interrupt flag */
/* ADC14IFGR0[ADC14IFG7] Bits */
#define ADC14IFG7_OFS                                      ( 7)                  /* ADC14IFG7 Offset */
#define ADC14IFG7                                          (0x00000080)          /* ADC14MEM7 interrupt flag */
/* ADC14IFGR0[ADC14IFG8] Bits */
#define ADC14IFG8_OFS                                      ( 8)                  /* ADC14IFG8 Offset */
#define ADC14IFG8                                          (0x00000100)          /* ADC14MEM8 interrupt flag */
/* ADC14IFGR0[ADC14IFG9] Bits */
#define ADC14IFG9_OFS                                      ( 9)                  /* ADC14IFG9 Offset */
#define ADC14IFG9                                          (0x00000200)          /* ADC14MEM9 interrupt flag */
/* ADC14IFGR0[ADC14IFG10] Bits */
#define ADC14IFG10_OFS                                     (10)                  /* ADC14IFG10 Offset */
#define ADC14IFG10                                         (0x00000400)          /* ADC14MEM10 interrupt flag */
/* ADC14IFGR0[ADC14IFG11] Bits */
#define ADC14IFG11_OFS                                     (11)                  /* ADC14IFG11 Offset */
#define ADC14IFG11                                         (0x00000800)          /* ADC14MEM11 interrupt flag */
/* ADC14IFGR0[ADC14IFG12] Bits */
#define ADC14IFG12_OFS                                     (12)                  /* ADC14IFG12 Offset */
#define ADC14IFG12                                         (0x00001000)          /* ADC14MEM12 interrupt flag */
/* ADC14IFGR0[ADC14IFG13] Bits */
#define ADC14IFG13_OFS                                     (13)                  /* ADC14IFG13 Offset */
#define ADC14IFG13                                         (0x00002000)          /* ADC14MEM13 interrupt flag */
/* ADC14IFGR0[ADC14IFG14] Bits */
#define ADC14IFG14_OFS                                     (14)                  /* ADC14IFG14 Offset */
#define ADC14IFG14                                         (0x00004000)          /* ADC14MEM14 interrupt flag */
/* ADC14IFGR0[ADC14IFG15] Bits */
#define ADC14IFG15_OFS                                     (15)                  /* ADC14IFG15 Offset */
#define ADC14IFG15                                         (0x00008000)          /* ADC14MEM15 interrupt flag */
/* ADC14IFGR0[ADC14IFG16] Bits */
#define ADC14IFG16_OFS                                     (16)                  /* ADC14IFG16 Offset */
#define ADC14IFG16                                         (0x00010000)          /* ADC14MEM16 interrupt flag */
/* ADC14IFGR0[ADC14IFG17] Bits */
#define ADC14IFG17_OFS                                     (17)                  /* ADC14IFG17 Offset */
#define ADC14IFG17                                         (0x00020000)          /* ADC14MEM17 interrupt flag */
/* ADC14IFGR0[ADC14IFG18] Bits */
#define ADC14IFG18_OFS                                     (18)                  /* ADC14IFG18 Offset */
#define ADC14IFG18                                         (0x00040000)          /* ADC14MEM18 interrupt flag */
/* ADC14IFGR0[ADC14IFG19] Bits */
#define ADC14IFG19_OFS                                     (19)                  /* ADC14IFG19 Offset */
#define ADC14IFG19                                         (0x00080000)          /* ADC14MEM19 interrupt flag */
/* ADC14IFGR0[ADC14IFG20] Bits */
#define ADC14IFG20_OFS                                     (20)                  /* ADC14IFG20 Offset */
#define ADC14IFG20                                         (0x00100000)          /* ADC14MEM20 interrupt flag */
/* ADC14IFGR0[ADC14IFG21] Bits */
#define ADC14IFG21_OFS                                     (21)                  /* ADC14IFG21 Offset */
#define ADC14IFG21                                         (0x00200000)          /* ADC14MEM21 interrupt flag */
/* ADC14IFGR0[ADC14IFG22] Bits */
#define ADC14IFG22_OFS                                     (22)                  /* ADC14IFG22 Offset */
#define ADC14IFG22                                         (0x00400000)          /* ADC14MEM22 interrupt flag */
/* ADC14IFGR0[ADC14IFG23] Bits */
#define ADC14IFG23_OFS                                     (23)                  /* ADC14IFG23 Offset */
#define ADC14IFG23                                         (0x00800000)          /* ADC14MEM23 interrupt flag */
/* ADC14IFGR0[ADC14IFG24] Bits */
#define ADC14IFG24_OFS                                     (24)                  /* ADC14IFG24 Offset */
#define ADC14IFG24                                         (0x01000000)          /* ADC14MEM24 interrupt flag */
/* ADC14IFGR0[ADC14IFG25] Bits */
#define ADC14IFG25_OFS                                     (25)                  /* ADC14IFG25 Offset */
#define ADC14IFG25                                         (0x02000000)          /* ADC14MEM25 interrupt flag */
/* ADC14IFGR0[ADC14IFG26] Bits */
#define ADC14IFG26_OFS                                     (26)                  /* ADC14IFG26 Offset */
#define ADC14IFG26                                         (0x04000000)          /* ADC14MEM26 interrupt flag */
/* ADC14IFGR0[ADC14IFG27] Bits */
#define ADC14IFG27_OFS                                     (27)                  /* ADC14IFG27 Offset */
#define ADC14IFG27                                         (0x08000000)          /* ADC14MEM27 interrupt flag */
/* ADC14IFGR0[ADC14IFG28] Bits */
#define ADC14IFG28_OFS                                     (28)                  /* ADC14IFG28 Offset */
#define ADC14IFG28                                         (0x10000000)          /* ADC14MEM28 interrupt flag */
/* ADC14IFGR0[ADC14IFG29] Bits */
#define ADC14IFG29_OFS                                     (29)                  /* ADC14IFG29 Offset */
#define ADC14IFG29                                         (0x20000000)          /* ADC14MEM29 interrupt flag */
/* ADC14IFGR0[ADC14IFG30] Bits */
#define ADC14IFG30_OFS                                     (30)                  /* ADC14IFG30 Offset */
#define ADC14IFG30                                         (0x40000000)          /* ADC14MEM30 interrupt flag */
/* ADC14IFGR0[ADC14IFG31] Bits */
#define ADC14IFG31_OFS                                     (31)                  /* ADC14IFG31 Offset */
#define ADC14IFG31                                         (0x80000000)          /* ADC14MEM31 interrupt flag */
/* ADC14IFGR1[ADC14INIFG] Bits */
#define ADC14INIFG_OFS                                     ( 1)                  /* ADC14INIFG Offset */
#define ADC14INIFG                                         (0x00000002)          /* Interrupt flag for ADC14MEMx within comparator window */
/* ADC14IFGR1[ADC14LOIFG] Bits */
#define ADC14LOIFG_OFS                                     ( 2)                  /* ADC14LOIFG Offset */
#define ADC14LOIFG                                         (0x00000004)          /* Interrupt flag for ADC14MEMx below comparator window */
/* ADC14IFGR1[ADC14HIIFG] Bits */
#define ADC14HIIFG_OFS                                     ( 3)                  /* ADC14HIIFG Offset */
#define ADC14HIIFG                                         (0x00000008)          /* Interrupt flag for ADC14MEMx above comparator window */
/* ADC14IFGR1[ADC14OVIFG] Bits */
#define ADC14OVIFG_OFS                                     ( 4)                  /* ADC14OVIFG Offset */
#define ADC14OVIFG                                         (0x00000010)          /* ADC14MEMx overflow interrupt flag */
/* ADC14IFGR1[ADC14TOVIFG] Bits */
#define ADC14TOVIFG_OFS                                    ( 5)                  /* ADC14TOVIFG Offset */
#define ADC14TOVIFG                                        (0x00000020)          /* ADC14 conversion time overflow interrupt flag */
/* ADC14IFGR1[ADC14RDYIFG] Bits */
#define ADC14RDYIFG_OFS                                    ( 6)                  /* ADC14RDYIFG Offset */
#define ADC14RDYIFG                                        (0x00000040)          /* ADC14 local buffered reference ready interrupt flag */
/* ADC14CLRIFGR0[CLRADC14IFG0] Bits */
#define CLRADC14IFG0_OFS                                   ( 0)                  /* CLRADC14IFG0 Offset */
#define CLRADC14IFG0                                       (0x00000001)          /* clear ADC14IFG0 */
/* ADC14CLRIFGR0[CLRADC14IFG1] Bits */
#define CLRADC14IFG1_OFS                                   ( 1)                  /* CLRADC14IFG1 Offset */
#define CLRADC14IFG1                                       (0x00000002)          /* clear ADC14IFG1 */
/* ADC14CLRIFGR0[CLRADC14IFG2] Bits */
#define CLRADC14IFG2_OFS                                   ( 2)                  /* CLRADC14IFG2 Offset */
#define CLRADC14IFG2                                       (0x00000004)          /* clear ADC14IFG2 */
/* ADC14CLRIFGR0[CLRADC14IFG3] Bits */
