helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
#define CLRADC14IFG3_OFS                                   ( 3)                  /* CLRADC14IFG3 Offset */
#define CLRADC14IFG3                                       (0x00000008)          /* clear ADC14IFG3 */
/* ADC14CLRIFGR0[CLRADC14IFG4] Bits */
#define CLRADC14IFG4_OFS                                   ( 4)                  /* CLRADC14IFG4 Offset */
#define CLRADC14IFG4                                       (0x00000010)          /* clear ADC14IFG4 */
/* ADC14CLRIFGR0[CLRADC14IFG5] Bits */
#define CLRADC14IFG5_OFS                                   ( 5)                  /* CLRADC14IFG5 Offset */
#define CLRADC14IFG5                                       (0x00000020)          /* clear ADC14IFG5 */
/* ADC14CLRIFGR0[CLRADC14IFG6] Bits */
#define CLRADC14IFG6_OFS                                   ( 6)                  /* CLRADC14IFG6 Offset */
#define CLRADC14IFG6                                       (0x00000040)          /* clear ADC14IFG6 */
/* ADC14CLRIFGR0[CLRADC14IFG7] Bits */
#define CLRADC14IFG7_OFS                                   ( 7)                  /* CLRADC14IFG7 Offset */
#define CLRADC14IFG7                                       (0x00000080)          /* clear ADC14IFG7 */
/* ADC14CLRIFGR0[CLRADC14IFG8] Bits */
#define CLRADC14IFG8_OFS                                   ( 8)                  /* CLRADC14IFG8 Offset */
#define CLRADC14IFG8                                       (0x00000100)          /* clear ADC14IFG8 */
/* ADC14CLRIFGR0[CLRADC14IFG9] Bits */
#define CLRADC14IFG9_OFS                                   ( 9)                  /* CLRADC14IFG9 Offset */
#define CLRADC14IFG9                                       (0x00000200)          /* clear ADC14IFG9 */
/* ADC14CLRIFGR0[CLRADC14IFG10] Bits */
#define CLRADC14IFG10_OFS                                  (10)                  /* CLRADC14IFG10 Offset */
#define CLRADC14IFG10                                      (0x00000400)          /* clear ADC14IFG10 */
/* ADC14CLRIFGR0[CLRADC14IFG11] Bits */
#define CLRADC14IFG11_OFS                                  (11)                  /* CLRADC14IFG11 Offset */
#define CLRADC14IFG11                                      (0x00000800)          /* clear ADC14IFG11 */
/* ADC14CLRIFGR0[CLRADC14IFG12] Bits */
#define CLRADC14IFG12_OFS                                  (12)                  /* CLRADC14IFG12 Offset */
#define CLRADC14IFG12                                      (0x00001000)          /* clear ADC14IFG12 */
/* ADC14CLRIFGR0[CLRADC14IFG13] Bits */
#define CLRADC14IFG13_OFS                                  (13)                  /* CLRADC14IFG13 Offset */
#define CLRADC14IFG13                                      (0x00002000)          /* clear ADC14IFG13 */
/* ADC14CLRIFGR0[CLRADC14IFG14] Bits */
#define CLRADC14IFG14_OFS                                  (14)                  /* CLRADC14IFG14 Offset */
#define CLRADC14IFG14                                      (0x00004000)          /* clear ADC14IFG14 */
/* ADC14CLRIFGR0[CLRADC14IFG15] Bits */
#define CLRADC14IFG15_OFS                                  (15)                  /* CLRADC14IFG15 Offset */
#define CLRADC14IFG15                                      (0x00008000)          /* clear ADC14IFG15 */
/* ADC14CLRIFGR0[CLRADC14IFG16] Bits */
#define CLRADC14IFG16_OFS                                  (16)                  /* CLRADC14IFG16 Offset */
#define CLRADC14IFG16                                      (0x00010000)          /* clear ADC14IFG16 */
/* ADC14CLRIFGR0[CLRADC14IFG17] Bits */
#define CLRADC14IFG17_OFS                                  (17)                  /* CLRADC14IFG17 Offset */
#define CLRADC14IFG17                                      (0x00020000)          /* clear ADC14IFG17 */
/* ADC14CLRIFGR0[CLRADC14IFG18] Bits */
#define CLRADC14IFG18_OFS                                  (18)                  /* CLRADC14IFG18 Offset */
#define CLRADC14IFG18                                      (0x00040000)          /* clear ADC14IFG18 */
/* ADC14CLRIFGR0[CLRADC14IFG19] Bits */
#define CLRADC14IFG19_OFS                                  (19)                  /* CLRADC14IFG19 Offset */
#define CLRADC14IFG19                                      (0x00080000)          /* clear ADC14IFG19 */
/* ADC14CLRIFGR0[CLRADC14IFG20] Bits */
#define CLRADC14IFG20_OFS                                  (20)                  /* CLRADC14IFG20 Offset */
#define CLRADC14IFG20                                      (0x00100000)          /* clear ADC14IFG20 */
/* ADC14CLRIFGR0[CLRADC14IFG21] Bits */
#define CLRADC14IFG21_OFS                                  (21)                  /* CLRADC14IFG21 Offset */
#define CLRADC14IFG21                                      (0x00200000)          /* clear ADC14IFG21 */
/* ADC14CLRIFGR0[CLRADC14IFG22] Bits */
#define CLRADC14IFG22_OFS                                  (22)                  /* CLRADC14IFG22 Offset */
#define CLRADC14IFG22                                      (0x00400000)          /* clear ADC14IFG22 */
/* ADC14CLRIFGR0[CLRADC14IFG23] Bits */
#define CLRADC14IFG23_OFS                                  (23)                  /* CLRADC14IFG23 Offset */
#define CLRADC14IFG23                                      (0x00800000)          /* clear ADC14IFG23 */
/* ADC14CLRIFGR0[CLRADC14IFG24] Bits */
#define CLRADC14IFG24_OFS                                  (24)                  /* CLRADC14IFG24 Offset */
#define CLRADC14IFG24                                      (0x01000000)          /* clear ADC14IFG24 */
/* ADC14CLRIFGR0[CLRADC14IFG25] Bits */
#define CLRADC14IFG25_OFS                                  (25)                  /* CLRADC14IFG25 Offset */
#define CLRADC14IFG25                                      (0x02000000)          /* clear ADC14IFG25 */
/* ADC14CLRIFGR0[CLRADC14IFG26] Bits */
#define CLRADC14IFG26_OFS                                  (26)                  /* CLRADC14IFG26 Offset */
#define CLRADC14IFG26                                      (0x04000000)          /* clear ADC14IFG26 */
/* ADC14CLRIFGR0[CLRADC14IFG27] Bits */
#define CLRADC14IFG27_OFS                                  (27)                  /* CLRADC14IFG27 Offset */
#define CLRADC14IFG27                                      (0x08000000)          /* clear ADC14IFG27 */
/* ADC14CLRIFGR0[CLRADC14IFG28] Bits */
#define CLRADC14IFG28_OFS                                  (28)                  /* CLRADC14IFG28 Offset */
#define CLRADC14IFG28                                      (0x10000000)          /* clear ADC14IFG28 */
/* ADC14CLRIFGR0[CLRADC14IFG29] Bits */
#define CLRADC14IFG29_OFS                                  (29)                  /* CLRADC14IFG29 Offset */
#define CLRADC14IFG29                                      (0x20000000)          /* clear ADC14IFG29 */
/* ADC14CLRIFGR0[CLRADC14IFG30] Bits */
#define CLRADC14IFG30_OFS                                  (30)                  /* CLRADC14IFG30 Offset */
#define CLRADC14IFG30                                      (0x40000000)          /* clear ADC14IFG30 */
/* ADC14CLRIFGR0[CLRADC14IFG31] Bits */
#define CLRADC14IFG31_OFS                                  (31)                  /* CLRADC14IFG31 Offset */
#define CLRADC14IFG31                                      (0x80000000)          /* clear ADC14IFG31 */
/* ADC14CLRIFGR1[CLRADC14INIFG] Bits */
#define CLRADC14INIFG_OFS                                  ( 1)                  /* CLRADC14INIFG Offset */
#define CLRADC14INIFG                                      (0x00000002)          /* clear ADC14INIFG */
/* ADC14CLRIFGR1[CLRADC14LOIFG] Bits */
#define CLRADC14LOIFG_OFS                                  ( 2)                  /* CLRADC14LOIFG Offset */
#define CLRADC14LOIFG                                      (0x00000004)          /* clear ADC14LOIFG */
/* ADC14CLRIFGR1[CLRADC14HIIFG] Bits */
#define CLRADC14HIIFG_OFS                                  ( 3)                  /* CLRADC14HIIFG Offset */
#define CLRADC14HIIFG                                      (0x00000008)          /* clear ADC14HIIFG */
/* ADC14CLRIFGR1[CLRADC14OVIFG] Bits */
#define CLRADC14OVIFG_OFS                                  ( 4)                  /* CLRADC14OVIFG Offset */
#define CLRADC14OVIFG                                      (0x00000010)          /* clear ADC14OVIFG */
/* ADC14CLRIFGR1[CLRADC14TOVIFG] Bits */
#define CLRADC14TOVIFG_OFS                                 ( 5)                  /* CLRADC14TOVIFG Offset */
#define CLRADC14TOVIFG                                     (0x00000020)          /* clear ADC14TOVIFG */
/* ADC14CLRIFGR1[CLRADC14RDYIFG] Bits */
#define CLRADC14RDYIFG_OFS                                 ( 6)                  /* CLRADC14RDYIFG Offset */
#define CLRADC14RDYIFG                                     (0x00000040)          /* clear ADC14RDYIFG */


