helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// COREDEBUG Bits
/***************************************************************************
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_C_DEBUGEN] Bits */
#define COREDEBUG_DHCSR_C_DEBUGEN_OFS                      ( 0)                  /* C_DEBUGEN Offset */
#define COREDEBUG_DHCSR_C_DEBUGEN                          (0x00000001)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_C_HALT] Bits */
#define COREDEBUG_DHCSR_C_HALT_OFS                         ( 1)                  /* C_HALT Offset */
#define COREDEBUG_DHCSR_C_HALT                             (0x00000002)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_C_STEP] Bits */
#define COREDEBUG_DHCSR_C_STEP_OFS                         ( 2)                  /* C_STEP Offset */
#define COREDEBUG_DHCSR_C_STEP                             (0x00000004)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_C_MASKINTS] Bits */
#define COREDEBUG_DHCSR_C_MASKINTS_OFS                     ( 3)                  /* C_MASKINTS Offset */
#define COREDEBUG_DHCSR_C_MASKINTS                         (0x00000008)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_C_SNAPSTALL] Bits */
#define COREDEBUG_DHCSR_C_SNAPSTALL_OFS                    ( 5)                  /* C_SNAPSTALL Offset */
#define COREDEBUG_DHCSR_C_SNAPSTALL                        (0x00000020)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_S_REGRDY] Bits */
#define COREDEBUG_DHCSR_S_REGRDY_OFS                       (16)                  /* S_REGRDY Offset */
#define COREDEBUG_DHCSR_S_REGRDY                           (0x00010000)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_S_HALT] Bits */
#define COREDEBUG_DHCSR_S_HALT_OFS                         (17)                  /* S_HALT Offset */
#define COREDEBUG_DHCSR_S_HALT                             (0x00020000)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_S_SLEEP] Bits */
#define COREDEBUG_DHCSR_S_SLEEP_OFS                        (18)                  /* S_SLEEP Offset */
#define COREDEBUG_DHCSR_S_SLEEP                            (0x00040000)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_S_LOCKUP] Bits */
#define COREDEBUG_DHCSR_S_LOCKUP_OFS                       (19)                  /* S_LOCKUP Offset */
#define COREDEBUG_DHCSR_S_LOCKUP                           (0x00080000)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_S_RETIRE_ST] Bits */
#define COREDEBUG_DHCSR_S_RETIRE_ST_OFS                    (24)                  /* S_RETIRE_ST Offset */
#define COREDEBUG_DHCSR_S_RETIRE_ST                        (0x01000000)          /*  */
/* COREDEBUG_DHCSR[COREDEBUG_DHCSR_S_RESET_ST] Bits */
#define COREDEBUG_DHCSR_S_RESET_ST_OFS                     (25)                  /* S_RESET_ST Offset */
#define COREDEBUG_DHCSR_S_RESET_ST                         (0x02000000)          /*  */
/* COREDEBUG_DCRSR[COREDEBUG_DCRSR_REGSEL] Bits */
#define COREDEBUG_DCRSR_REGSEL_OFS                         ( 0)                  /* REGSEL Offset */
#define COREDEBUG_DCRSR_REGSEL_M                           (0x0000001f)          /*  */
#define COREDEBUG_DCRSR_REGSEL0                            (0x00000001)          /*  */
#define COREDEBUG_DCRSR_REGSEL1                            (0x00000002)          /*  */
#define COREDEBUG_DCRSR_REGSEL2                            (0x00000004)          /*  */
#define COREDEBUG_DCRSR_REGSEL3                            (0x00000008)          /*  */
#define COREDEBUG_DCRSR_REGSEL4                            (0x00000010)          /*  */
#define COREDEBUG_DCRSR_REGSEL_0                           (0x00000000)          /* R11 */
//#define COREDEBUG_DCRSR_REGSEL_0                           (0x00000000)          /* R0 */
#define COREDEBUG_DCRSR_REGSEL_1                           (0x00000001)          /* R1 */
#define COREDEBUG_DCRSR_REGSEL_2                           (0x00000002)          /* R2 */
#define COREDEBUG_DCRSR_REGSEL_3                           (0x00000003)          /* R3 */
#define COREDEBUG_DCRSR_REGSEL_4                           (0x00000004)          /* R4 */
#define COREDEBUG_DCRSR_REGSEL_5                           (0x00000005)          /* R5 */
#define COREDEBUG_DCRSR_REGSEL_6                           (0x00000006)          /* R6 */
#define COREDEBUG_DCRSR_REGSEL_7                           (0x00000007)          /* R7 */
#define COREDEBUG_DCRSR_REGSEL_8                           (0x00000008)          /* R8 */
#define COREDEBUG_DCRSR_REGSEL_9                           (0x00000009)          /* R9 */
#define COREDEBUG_DCRSR_REGSEL_10                          (0x0000000a)          /* R10 */
#define COREDEBUG_DCRSR_REGSEL_12                          (0x0000000c)          /* R12 */
#define COREDEBUG_DCRSR_REGSEL_13                          (0x0000000d)          /* Current SP */
#define COREDEBUG_DCRSR_REGSEL_14                          (0x0000000e)          /* LR */
#define COREDEBUG_DCRSR_REGSEL_15                          (0x0000000f)          /* DebugReturnAddress */
#define COREDEBUG_DCRSR_REGSEL_16                          (0x00000010)          /* xPSR/flags, execution state information, and exception number */
#define COREDEBUG_DCRSR_REGSEL_17                          (0x00000011)          /* MSP (Main SP) */
#define COREDEBUG_DCRSR_REGSEL_18                          (0x00000012)          /* PSP (Process SP) */
#define COREDEBUG_DCRSR_REGSEL_20                          (0x00000014)          /* CONTROL bits [31:24], FAULTMASK bits [23:16], BASEPRI bits [15:8], PRIMASK bits [7:0] */
/* COREDEBUG_DCRSR[COREDEBUG_DCRSR_REGWNR] Bits */
#define COREDEBUG_DCRSR_REGWNR_OFS                         (16)                  /* REGWNR Offset */
#define COREDEBUG_DCRSR_REGWNR                             (0x00010000)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_CORERESET] Bits */
#define COREDEBUG_DEMCR_VC_CORERESET_OFS                   ( 0)                  /* VC_CORERESET Offset */
#define COREDEBUG_DEMCR_VC_CORERESET                       (0x00000001)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_MMERR] Bits */
#define COREDEBUG_DEMCR_VC_MMERR_OFS                       ( 4)                  /* VC_MMERR Offset */
#define COREDEBUG_DEMCR_VC_MMERR                           (0x00000010)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_NOCPERR] Bits */
#define COREDEBUG_DEMCR_VC_NOCPERR_OFS                     ( 5)                  /* VC_NOCPERR Offset */
#define COREDEBUG_DEMCR_VC_NOCPERR                         (0x00000020)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_CHKERR] Bits */
#define COREDEBUG_DEMCR_VC_CHKERR_OFS                      ( 6)                  /* VC_CHKERR Offset */
#define COREDEBUG_DEMCR_VC_CHKERR                          (0x00000040)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_STATERR] Bits */
#define COREDEBUG_DEMCR_VC_STATERR_OFS                     ( 7)                  /* VC_STATERR Offset */
#define COREDEBUG_DEMCR_VC_STATERR                         (0x00000080)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_BUSERR] Bits */
#define COREDEBUG_DEMCR_VC_BUSERR_OFS                      ( 8)                  /* VC_BUSERR Offset */
#define COREDEBUG_DEMCR_VC_BUSERR                          (0x00000100)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_INTERR] Bits */
#define COREDEBUG_DEMCR_VC_INTERR_OFS                      ( 9)                  /* VC_INTERR Offset */
#define COREDEBUG_DEMCR_VC_INTERR                          (0x00000200)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_VC_HARDERR] Bits */
#define COREDEBUG_DEMCR_VC_HARDERR_OFS                     (10)                  /* VC_HARDERR Offset */
#define COREDEBUG_DEMCR_VC_HARDERR                         (0x00000400)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_MON_EN] Bits */
#define COREDEBUG_DEMCR_MON_EN_OFS                         (16)                  /* MON_EN Offset */
#define COREDEBUG_DEMCR_MON_EN                             (0x00010000)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_MON_PEND] Bits */
#define COREDEBUG_DEMCR_MON_PEND_OFS                       (17)                  /* MON_PEND Offset */
#define COREDEBUG_DEMCR_MON_PEND                           (0x00020000)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_MON_STEP] Bits */
#define COREDEBUG_DEMCR_MON_STEP_OFS                       (18)                  /* MON_STEP Offset */
#define COREDEBUG_DEMCR_MON_STEP                           (0x00040000)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_MON_REQ] Bits */
#define COREDEBUG_DEMCR_MON_REQ_OFS                        (19)                  /* MON_REQ Offset */
#define COREDEBUG_DEMCR_MON_REQ                            (0x00080000)          /*  */
/* COREDEBUG_DEMCR[COREDEBUG_DEMCR_TRCENA] Bits */
#define COREDEBUG_DEMCR_TRCENA_OFS                         (24)                  /* TRCENA Offset */
#define COREDEBUG_DEMCR_TRCENA                             (0x01000000)          /*  */


/***************************************************************************
// CRC32 Bits
/***************************************************************************


