helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// CS Bits
/***************************************************************************
/* CSKEY[CSKEY] Bits */
#define CSKEY_OFS                                          ( 0)                  /* CSKEY Offset */
#define CSKEY_M                                            (0x0000ffff)          /* Write xxxx_695Ah to unlock */
/* CSCTL0[DCOTUNE] Bits */
#define DCOTUNE_OFS                                        ( 0)                  /* DCOTUNE Offset */
#define DCOTUNE_M                                          (0x00001fff)          /* DCO frequency tuning select */
/* CSCTL0[DCORSEL] Bits */
#define DCORSEL_OFS                                        (16)                  /* DCORSEL Offset */
#define DCORSEL_M                                          (0x00070000)          /* DCO frequency range select */
#define DCORSEL0                                           (0x00010000)          /* DCO frequency range select */
#define DCORSEL1                                           (0x00020000)          /* DCO frequency range select */
#define DCORSEL2                                           (0x00040000)          /* DCO frequency range select */
#define DCORSEL_0                                          (0x00000000)          /* Nominal DCO Frequency Range (MHz): 1 to 2 */
#define DCORSEL_1                                          (0x00010000)          /* Nominal DCO Frequency Range (MHz): 2 to 4 */
#define DCORSEL_2                                          (0x00020000)          /* Nominal DCO Frequency Range (MHz): 4 to 8 */
#define DCORSEL_3                                          (0x00030000)          /* Nominal DCO Frequency Range (MHz): 8 to 16 */
#define DCORSEL_4                                          (0x00040000)          /* Nominal DCO Frequency Range (MHz): 16 to 32 */
#define DCORSEL_5                                          (0x00050000)          /* Nominal DCO Frequency Range (MHz): 32 to 64 */
/* CSCTL0[DCORES] Bits */
#define DCORES_OFS                                         (22)                  /* DCORES Offset */
#define DCORES                                             (0x00400000)          /* Enables the DCO external resistor mode */
/* CSCTL0[DCOEN] Bits */
#define DCOEN_OFS                                          (23)                  /* DCOEN Offset */
#define DCOEN                                              (0x00800000)          /* Enables the DCO oscillator */
/* CSCTL0[DIS_DCO_DELAY_CNT] Bits */
#define DIS_DCO_DELAY_CNT_OFS                              (24)                  /* DIS_DCO_DELAY_CNT Offset */
#define DIS_DCO_DELAY_CNT                                  (0x01000000)          /*  */
/* CSCTL1[SELM] Bits */
#define SELM_OFS                                           ( 0)                  /* SELM Offset */
#define SELM_M                                             (0x00000007)          /* Selects the MCLK source */
#define SELM0                                              (0x00000001)          /* Selects the MCLK source */
#define SELM1                                              (0x00000002)          /* Selects the MCLK source */
#define SELM2                                              (0x00000004)          /* Selects the MCLK source */
#define SELM_0                                             (0x00000000)          /* when LFXT available, otherwise REFOCLK */
#define SELM_1                                             (0x00000001)          /*  */
#define SELM_2                                             (0x00000002)          /*  */
#define SELM_3                                             (0x00000003)          /*  */
#define SELM_4                                             (0x00000004)          /*  */
#define SELM_5                                             (0x00000005)          /* when HFXT available, otherwise DCOCLK */
#define SELM_6                                             (0x00000006)          /* when HFXT2 available, otherwise DCOCLK */
#define SELM__LFXTCLK                                      (0x00000000)          /* when LFXT available, otherwise REFOCLK */
#define SELM__VLOCLK                                       (0x00000001)          /*  */
#define SELM__REFOCLK                                      (0x00000002)          /*  */
#define SELM__DCOCLK                                       (0x00000003)          /*  */
#define SELM__MODOSC                                       (0x00000004)          /*  */
#define SELM__HFXTCLK                                      (0x00000005)          /* when HFXT available, otherwise DCOCLK */
#define SELM__HFXT2CLK                                     (0x00000006)          /* when HFXT2 available, otherwise DCOCLK */
#define SELM_7                                             (0x00000007)          /* for future use. Defaults to DCOCLK. Not recommended for use  to ensure future compatibilities. */
/* CSCTL1[SELS] Bits */
#define SELS_OFS                                           ( 4)                  /* SELS Offset */
#define SELS_M                                             (0x00000070)          /* Selects the SMCLK and HSMCLK source */
#define SELS0                                              (0x00000010)          /* Selects the SMCLK and HSMCLK source */
#define SELS1                                              (0x00000020)          /* Selects the SMCLK and HSMCLK source */
#define SELS2                                              (0x00000040)          /* Selects the SMCLK and HSMCLK source */
#define SELS_0                                             (0x00000000)          /* when LFXT available, otherwise REFOCLK */
#define SELS_1                                             (0x00000010)          /*  */
#define SELS_2                                             (0x00000020)          /*  */
#define SELS_3                                             (0x00000030)          /*  */
#define SELS_4                                             (0x00000040)          /*  */
#define SELS_5                                             (0x00000050)          /* when HFXT available, otherwise DCOCLK */
#define SELS_6                                             (0x00000060)          /* when HFXT2 available, otherwise DCOCLK */
#define SELS__LFXTCLK                                      (0x00000000)          /* when LFXT available, otherwise REFOCLK */
#define SELS__VLOCLK                                       (0x00000010)          /*  */
#define SELS__REFOCLK                                      (0x00000020)          /*  */
#define SELS__DCOCLK                                       (0x00000030)          /*  */
#define SELS__MODOSC                                       (0x00000040)          /*  */
#define SELS__HFXTCLK                                      (0x00000050)          /* when HFXT available, otherwise DCOCLK */
#define SELS__HFXT2CLK                                     (0x00000060)          /* when HFXT2 available, otherwise DCOCLK */
#define SELS_7                                             (0x00000070)          /* for furture use. Defaults to DCOCLK. Do not use to ensure future compatibilities. */
/* CSCTL1[SELA] Bits */
#define SELA_OFS                                           ( 8)                  /* SELA Offset */
#define SELA_M                                             (0x00000700)          /* Selects the ACLK source */
#define SELA0                                              (0x00000100)          /* Selects the ACLK source */
#define SELA1                                              (0x00000200)          /* Selects the ACLK source */
#define SELA2                                              (0x00000400)          /* Selects the ACLK source */
#define SELA_0                                             (0x00000000)          /* when LFXT available, otherwise REFOCLK */
#define SELA_1                                             (0x00000100)          /*  */
#define SELA_2                                             (0x00000200)          /*  */
#define SELA__LFXTCLK                                      (0x00000000)          /* when LFXT available, otherwise REFOCLK */
#define SELA__VLOCLK                                       (0x00000100)          /*  */
#define SELA__REFOCLK                                      (0x00000200)          /*  */
#define SELA_3                                             (0x00000300)          /* for future use. Defaults to REFOCLK. Not recommended  for use to ensure future compatibilities. */
#define SELA_4                                             (0x00000400)          /* for future use. Defaults to REFOCLK. Not recommended  for use to ensure future compatibilities. */
#define SELA_5                                             (0x00000500)          /* for future use. Defaults to REFOCLK. Not recommended  for use to ensure future compatibilities. */
#define SELA_6                                             (0x00000600)          /* for future use. Defaults to REFOCLK. Not recommended  for use to ensure future compatibilities. */
#define SELA_7                                             (0x00000700)          /* for future use. Defaults to REFOCLK. Not recommended  for use to ensure future compatibilities. */
/* CSCTL1[SELB] Bits */
#define SELB_OFS                                           (12)                  /* SELB Offset */
#define SELB                                               (0x00001000)          /* Selects the BCLK source */
/* CSCTL1[DIVM] Bits */
#define DIVM_OFS                                           (16)                  /* DIVM Offset */
#define DIVM_M                                             (0x00070000)          /* MCLK source divider */
#define DIVM0                                              (0x00010000)          /* MCLK source divider */
#define DIVM1                                              (0x00020000)          /* MCLK source divider */
#define DIVM2                                              (0x00040000)          /* MCLK source divider */
#define DIVM_0                                             (0x00000000)          /* f(MCLK)/1 */
#define DIVM_1                                             (0x00010000)          /* f(MCLK)/2 */
#define DIVM_2                                             (0x00020000)          /* f(MCLK)/4 */
#define DIVM_3                                             (0x00030000)          /* f(MCLK)/8 */
#define DIVM_4                                             (0x00040000)          /* f(MCLK)/16 */
#define DIVM_5                                             (0x00050000)          /* f(MCLK)/32 */
#define DIVM_6                                             (0x00060000)          /* f(MCLK)/64 */
#define DIVM_7                                             (0x00070000)          /* f(MCLK)/128 */
#define DIVM__1                                            (0x00000000)          /* f(MCLK)/1 */
#define DIVM__2                                            (0x00010000)          /* f(MCLK)/2 */
#define DIVM__4                                            (0x00020000)          /* f(MCLK)/4 */
#define DIVM__8                                            (0x00030000)          /* f(MCLK)/8 */
#define DIVM__16                                           (0x00040000)          /* f(MCLK)/16 */
#define DIVM__32                                           (0x00050000)          /* f(MCLK)/32 */
#define DIVM__64                                           (0x00060000)          /* f(MCLK)/64 */
#define DIVM__128                                          (0x00070000)          /* f(MCLK)/128 */
/* CSCTL1[DIVHS] Bits */
#define DIVHS_OFS                                          (20)                  /* DIVHS Offset */
#define DIVHS_M                                            (0x00700000)          /* HSMCLK source divider */
#define DIVHS0                                             (0x00100000)          /* HSMCLK source divider */
#define DIVHS1                                             (0x00200000)          /* HSMCLK source divider */
#define DIVHS2                                             (0x00400000)          /* HSMCLK source divider */
#define DIVHS_0                                            (0x00000000)          /* f(HSMCLK)/1 */
#define DIVHS_1                                            (0x00100000)          /* f(HSMCLK)/2 */
#define DIVHS_2                                            (0x00200000)          /* f(HSMCLK)/4 */
#define DIVHS_3                                            (0x00300000)          /* f(HSMCLK)/8 */
#define DIVHS_4                                            (0x00400000)          /* f(HSMCLK)/16 */
#define DIVHS_5                                            (0x00500000)          /* f(HSMCLK)/32 */
#define DIVHS_6                                            (0x00600000)          /* f(HSMCLK)/64 */
#define DIVHS_7                                            (0x00700000)          /* f(HSMCLK)/128 */
#define DIVHS__1                                           (0x00000000)          /* f(HSMCLK)/1 */
#define DIVHS__2                                           (0x00100000)          /* f(HSMCLK)/2 */
#define DIVHS__4                                           (0x00200000)          /* f(HSMCLK)/4 */
#define DIVHS__8                                           (0x00300000)          /* f(HSMCLK)/8 */
#define DIVHS__16                                          (0x00400000)          /* f(HSMCLK)/16 */
#define DIVHS__32                                          (0x00500000)          /* f(HSMCLK)/32 */
#define DIVHS__64                                          (0x00600000)          /* f(HSMCLK)/64 */
#define DIVHS__128                                         (0x00700000)          /* f(HSMCLK)/128 */
/* CSCTL1[DIVA] Bits */
#define DIVA_OFS                                           (24)                  /* DIVA Offset */
#define DIVA_M                                             (0x07000000)          /* ACLK source divider */
#define DIVA0                                              (0x01000000)          /* ACLK source divider */
#define DIVA1                                              (0x02000000)          /* ACLK source divider */
#define DIVA2                                              (0x04000000)          /* ACLK source divider */
#define DIVA_0                                             (0x00000000)          /* f(ACLK)/1 */
#define DIVA_1                                             (0x01000000)          /* f(ACLK)/2 */
#define DIVA_2                                             (0x02000000)          /* f(ACLK)/4 */
#define DIVA_3                                             (0x03000000)          /* f(ACLK)/8 */
#define DIVA_4                                             (0x04000000)          /* f(ACLK)/16 */
#define DIVA_5                                             (0x05000000)          /* f(ACLK)/32 */
#define DIVA_6                                             (0x06000000)          /* f(ACLK)/64 */
#define DIVA_7                                             (0x07000000)          /* f(ACLK)/128 */
#define DIVA__1                                            (0x00000000)          /* f(ACLK)/1 */
#define DIVA__2                                            (0x01000000)          /* f(ACLK)/2 */
#define DIVA__4                                            (0x02000000)          /* f(ACLK)/4 */
#define DIVA__8                                            (0x03000000)          /* f(ACLK)/8 */
#define DIVA__16                                           (0x04000000)          /* f(ACLK)/16 */
#define DIVA__32                                           (0x05000000)          /* f(ACLK)/32 */
#define DIVA__64                                           (0x06000000)          /* f(ACLK)/64 */
#define DIVA__128                                          (0x07000000)          /* f(ACLK)/128 */
/* CSCTL1[DIVS] Bits */
#define DIVS_OFS                                           (28)                  /* DIVS Offset */
#define DIVS_M                                             (0x70000000)          /* SMCLK source divider */
#define DIVS0                                              (0x10000000)          /* SMCLK source divider */
#define DIVS1                                              (0x20000000)          /* SMCLK source divider */
#define DIVS2                                              (0x40000000)          /* SMCLK source divider */
#define DIVS_0                                             (0x00000000)          /* f(SMCLK)/1 */
#define DIVS_1                                             (0x10000000)          /* f(SMCLK)/2 */
#define DIVS_2                                             (0x20000000)          /* f(SMCLK)/4 */
#define DIVS_3                                             (0x30000000)          /* f(SMCLK)/8 */
#define DIVS_4                                             (0x40000000)          /* f(SMCLK)/16 */
#define DIVS_5                                             (0x50000000)          /* f(SMCLK)/32 */
#define DIVS_6                                             (0x60000000)          /* f(SMCLK)/64 */
#define DIVS_7                                             (0x70000000)          /* f(SMCLK)/128 */
#define DIVS__1                                            (0x00000000)          /* f(SMCLK)/1 */
#define DIVS__2                                            (0x10000000)          /* f(SMCLK)/2 */
#define DIVS__4                                            (0x20000000)          /* f(SMCLK)/4 */
#define DIVS__8                                            (0x30000000)          /* f(SMCLK)/8 */
#define DIVS__16                                           (0x40000000)          /* f(SMCLK)/16 */
#define DIVS__32                                           (0x50000000)          /* f(SMCLK)/32 */
#define DIVS__64                                           (0x60000000)          /* f(SMCLK)/64 */
#define DIVS__128                                          (0x70000000)          /* f(SMCLK)/128 */
/* CSCTL2[LFXTDRIVE] Bits */
#define LFXTDRIVE_OFS                                      ( 0)                  /* LFXTDRIVE Offset */
#define LFXTDRIVE_M                                        (0x00000007)          /* LFXT oscillator current can be adjusted to its drive needs */
#define LFXTDRIVE0                                         (0x00000001)          /* LFXT oscillator current can be adjusted to its drive needs */
#define LFXTDRIVE1                                         (0x00000002)          /* LFXT oscillator current can be adjusted to its drive needs */
#define LFXTDRIVE2                                         (0x00000004)          /* LFXT oscillator current can be adjusted to its drive needs */
#define LFXTDRIVE_0                                        (0x00000000)          /* Lowest current consumption. */
#define LFXTDRIVE_1                                        (0x00000001)          /* Increased drive strength LFXT oscillator. */
#define LFXTDRIVE_2                                        (0x00000002)          /* Increased drive strength LFXT oscillator. */
#define LFXTDRIVE_3                                        (0x00000003)          /* Increased drive strength LFXT oscillator. */
#define LFXTDRIVE_4                                        (0x00000004)          /* Increased drive strength LFXT oscillator. */
#define LFXTDRIVE_5                                        (0x00000005)          /* Increased drive strength LFXT oscillator. */
#define LFXTDRIVE_6                                        (0x00000006)          /* Increased drive strength LFXT oscillator. */
#define LFXTDRIVE_7                                        (0x00000007)          /* Maximum drive strength LFXT oscillator. */
/* CSCTL2[LFXTAGCOFF] Bits */
#define LFXTAGCOFF_OFS                                     ( 7)                  /* LFXTAGCOFF Offset */
#define LFXTAGCOFF                                         (0x00000080)          /* Disables the automatic gain control of the LFXT crystal */
/* CSCTL2[LFXT_EN] Bits */
#define LFXT_EN_OFS                                        ( 8)                  /* LFXT_EN Offset */
#define LFXT_EN                                            (0x00000100)          /* Turns on the LFXT oscillator regardless if used as a clock resource */
/* CSCTL2[LFXTBYPASS] Bits */
#define LFXTBYPASS_OFS                                     ( 9)                  /* LFXTBYPASS Offset */
#define LFXTBYPASS                                         (0x00000200)          /* LFXT bypass select */
/* CSCTL2[HFXTDRIVE] Bits */
#define HFXTDRIVE_OFS                                      (16)                  /* HFXTDRIVE Offset */
#define HFXTDRIVE                                          (0x00010000)          /* HFXT oscillator drive selection */
/* CSCTL2[HFXTFREQ] Bits */
#define HFXTFREQ_OFS                                       (20)                  /* HFXTFREQ Offset */
#define HFXTFREQ_M                                         (0x00700000)          /* HFXT frequency selection */
#define HFXTFREQ0                                          (0x00100000)          /* HFXT frequency selection */
#define HFXTFREQ1                                          (0x00200000)          /* HFXT frequency selection */
#define HFXTFREQ2                                          (0x00400000)          /* HFXT frequency selection */
#define HFXTFREQ_0                                         (0x00000000)          /* 1 MHz to 4 MHz */
#define HFXTFREQ_1                                         (0x00100000)          /* >4 MHz to 8 MHz */
#define HFXTFREQ_2                                         (0x00200000)          /* >8 MHz to 16 MHz */
#define HFXTFREQ_3                                         (0x00300000)          /* >16 MHz to 24 MHz */
#define HFXTFREQ_4                                         (0x00400000)          /* >24 MHz to 32 MHz */
#define HFXTFREQ_5                                         (0x00500000)          /* >32 MHz to 40 MHz */
#define HFXTFREQ_6                                         (0x00600000)          /* >40 MHz to 48 MHz */
/* CSCTL2[HFXT_EN] Bits */
#define HFXT_EN_OFS                                        (24)                  /* HFXT_EN Offset */
#define HFXT_EN                                            (0x01000000)          /* Turns on the HFXT oscillator regardless if used as a clock resource */
/* CSCTL2[HFXTBYPASS] Bits */
#define HFXTBYPASS_OFS                                     (25)                  /* HFXTBYPASS Offset */
#define HFXTBYPASS                                         (0x02000000)          /* HFXT bypass select */
/* CSCTL3[FCNTLF] Bits */
#define FCNTLF_OFS                                         ( 0)                  /* FCNTLF Offset */
#define FCNTLF_M                                           (0x00000003)          /* Start flag counter for LFXT */
#define FCNTLF0                                            (0x00000001)          /* Start flag counter for LFXT */
#define FCNTLF1                                            (0x00000002)          /* Start flag counter for LFXT */
#define FCNTLF_0                                           (0x00000000)          /* 4096 cycles */
#define FCNTLF_1                                           (0x00000001)          /* 8192 cycles */
#define FCNTLF_2                                           (0x00000002)          /* 16384 cycles */
#define FCNTLF_3                                           (0x00000003)          /* 32768 cycles */
#define FCNTLF__4096                                       (0x00000000)          /* 4096 cycles */
#define FCNTLF__8192                                       (0x00000001)          /* 8192 cycles */
