helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
#define FCNTLF__16384                                      (0x00000002)          /* 16384 cycles */
#define FCNTLF__32768                                      (0x00000003)          /* 32768 cycles */
/* CSCTL3[RFCNTLF] Bits */
#define RFCNTLF_OFS                                        ( 2)                  /* RFCNTLF Offset */
#define RFCNTLF                                            (0x00000004)          /* Reset start fault counter for LFXT */
/* CSCTL3[FCNTLF_EN] Bits */
#define FCNTLF_EN_OFS                                      ( 3)                  /* FCNTLF_EN Offset */
#define FCNTLF_EN                                          (0x00000008)          /* Enable start fault counter for LFXT */
/* CSCTL3[FCNTHF] Bits */
#define FCNTHF_OFS                                         ( 4)                  /* FCNTHF Offset */
#define FCNTHF_M                                           (0x00000030)          /* Start flag counter for HFXT */
#define FCNTHF0                                            (0x00000010)          /* Start flag counter for HFXT */
#define FCNTHF1                                            (0x00000020)          /* Start flag counter for HFXT */
#define FCNTHF_0                                           (0x00000000)          /* 2048 cycles */
#define FCNTHF_1                                           (0x00000010)          /* 4096 cycles */
#define FCNTHF_2                                           (0x00000020)          /* 8192 cycles */
#define FCNTHF_3                                           (0x00000030)          /* 16384 cycles */
#define FCNTHF__2048                                       (0x00000000)          /* 2048 cycles */
#define FCNTHF__4096                                       (0x00000010)          /* 4096 cycles */
#define FCNTHF__8192                                       (0x00000020)          /* 8192 cycles */
#define FCNTHF__16384                                      (0x00000030)          /* 16384 cycles */
/* CSCTL3[RFCNTHF] Bits */
#define RFCNTHF_OFS                                        ( 6)                  /* RFCNTHF Offset */
#define RFCNTHF                                            (0x00000040)          /* Reset start fault counter for HFXT */
/* CSCTL3[FCNTHF_EN] Bits */
#define FCNTHF_EN_OFS                                      ( 7)                  /* FCNTHF_EN Offset */
#define FCNTHF_EN                                          (0x00000080)          /* Enable start fault counter for HFXT */
/* CSCTL3[FCNTHF2] Bits */
#define FCNTHF2_OFS                                        ( 8)                  /* FCNTHF2 Offset */
#define FCNTHF2_M                                          (0x00000300)          /* Start flag counter for HFXT2 */
#define FCNTHF20                                           (0x00000100)          /* Start flag counter for HFXT2 */
#define FCNTHF21                                           (0x00000200)          /* Start flag counter for HFXT2 */
#define FCNTHF2_0                                          (0x00000000)          /* 2048 cycles */
#define FCNTHF2_1                                          (0x00000100)          /* 4096 cycles */
#define FCNTHF2_2                                          (0x00000200)          /* 8192 cycles */
#define FCNTHF2_3                                          (0x00000300)          /* 16384 cycles */
#define FCNTHF2__2048                                      (0x00000000)          /* 2048 cycles */
#define FCNTHF2__4096                                      (0x00000100)          /* 4096 cycles */
#define FCNTHF2__8192                                      (0x00000200)          /* 8192 cycles */
#define FCNTHF2__16384                                     (0x00000300)          /* 16384 cycles */
/* CSCTL3[RFCNTHF2] Bits */
#define RFCNTHF2_OFS                                       (10)                  /* RFCNTHF2 Offset */
#define RFCNTHF2                                           (0x00000400)          /* Reset start fault counter for HFXT2 */
/* CSCTL3[FCNTHF2_EN] Bits */
#define FCNTHF2_EN_OFS                                     (11)                  /* FCNTHF2_EN Offset */
#define FCNTHF2_EN                                         (0x00000800)          /* Enable start fault counter for HFXT2 */
/* CSCTL4[HFXT2DRIVE] Bits */
#define HFXT2DRIVE_OFS                                     ( 0)                  /* HFXT2DRIVE Offset */
#define HFXT2DRIVE_M                                       (0x00000007)          /* HFXT2 oscillator current can be adjusted to its drive needs */
#define HFXT2DRIVE0                                        (0x00000001)          /* HFXT2 oscillator current can be adjusted to its drive needs */
#define HFXT2DRIVE1                                        (0x00000002)          /* HFXT2 oscillator current can be adjusted to its drive needs */
#define HFXT2DRIVE2                                        (0x00000004)          /* HFXT2 oscillator current can be adjusted to its drive needs */
#define HFXT2DRIVE_0                                       (0x00000000)          /* Lowest current consumption */
#define HFXT2DRIVE_1                                       (0x00000001)          /* Increased drive strength HFXT2 oscillator */
#define HFXT2DRIVE_2                                       (0x00000002)          /* Increased drive strength HFXT2 oscillator */
#define HFXT2DRIVE_3                                       (0x00000003)          /* Increased drive strength HFXT2 oscillator */
#define HFXT2DRIVE_4                                       (0x00000004)          /* Increased drive strength HFXT2 oscillator */
#define HFXT2DRIVE_5                                       (0x00000005)          /* Increased drive strength HFXT2 oscillator */
#define HFXT2DRIVE_6                                       (0x00000006)          /* Increased drive strength HFXT2 oscillator */
#define HFXT2DRIVE_7                                       (0x00000007)          /* Maximum drive strength HFXT2 oscillator */
/* CSCTL4[HFXT2FREQ] Bits */
#define HFXT2FREQ_OFS                                      ( 4)                  /* HFXT2FREQ Offset */
#define HFXT2FREQ_M                                        (0x00000070)          /* HFXT2 frequency selection */
/* CSCTL4[HFXT2_EN] Bits */
#define HFXT2_EN_OFS                                       ( 8)                  /* HFXT2_EN Offset */
#define HFXT2_EN                                           (0x00000100)          /* Turns on the HFXT2 oscillator */
/* CSCTL4[HFXT2BYPASS] Bits */
#define HFXT2BYPASS_OFS                                    ( 9)                  /* HFXT2BYPASS Offset */
#define HFXT2BYPASS                                        (0x00000200)          /* HFXT2 bypass select */
/* CSCTL5[REFCNTSEL] Bits */
#define REFCNTSEL_OFS                                      ( 0)                  /* REFCNTSEL Offset */
#define REFCNTSEL_M                                        (0x00000007)          /* Reference counter source select */
/* CSCTL5[REFCNTPS] Bits */
#define REFCNTPS_OFS                                       ( 3)                  /* REFCNTPS Offset */
#define REFCNTPS_M                                         (0x00000038)          /* Reference clock prescaler */
/* CSCTL5[CALSTART] Bits */
#define CALSTART_OFS                                       ( 7)                  /* CALSTART Offset */
#define CALSTART                                           (0x00000080)          /* Start clock calibration counters */
/* CSCTL5[PERCNTSEL] Bits */
#define PERCNTSEL_OFS                                      ( 8)                  /* PERCNTSEL Offset */
#define PERCNTSEL_M                                        (0x00000700)          /* Period counter source select */
/* CSCTL6[PERCNT] Bits */
#define PERCNT_OFS                                         ( 0)                  /* PERCNT Offset */
#define PERCNT_M                                           (0x0000ffff)          /* Calibration period counter */
/* CSCTL7[REFCNT] Bits */
#define REFCNT_OFS                                         ( 0)                  /* REFCNT Offset */
#define REFCNT_M                                           (0x0000ffff)          /* Calibration reference period counter */
/* CSCLKEN[ACLK_EN] Bits */
#define ACLK_EN_OFS                                        ( 0)                  /* ACLK_EN Offset */
#define ACLK_EN                                            (0x00000001)          /* ACLK system clock conditional request enable */
/* CSCLKEN[MCLK_EN] Bits */
#define MCLK_EN_OFS                                        ( 1)                  /* MCLK_EN Offset */
#define MCLK_EN                                            (0x00000002)          /* MCLK system clock conditional request enable */
/* CSCLKEN[HSMCLK_EN] Bits */
#define HSMCLK_EN_OFS                                      ( 2)                  /* HSMCLK_EN Offset */
#define HSMCLK_EN                                          (0x00000004)          /* HSMCLK system clock conditional request enable */
/* CSCLKEN[SMCLK_EN] Bits */
#define SMCLK_EN_OFS                                       ( 3)                  /* SMCLK_EN Offset */
#define SMCLK_EN                                           (0x00000008)          /* SMCLK system clock conditional request enable */
/* CSCLKEN[VLO_EN] Bits */
#define VLO_EN_OFS                                         ( 8)                  /* VLO_EN Offset */
#define VLO_EN                                             (0x00000100)          /* Turns on the VLO oscillator */
/* CSCLKEN[REFO_EN] Bits */
#define REFO_EN_OFS                                        ( 9)                  /* REFO_EN Offset */
#define REFO_EN                                            (0x00000200)          /* Turns on the REFO oscillator */
/* CSCLKEN[MODOSC_EN] Bits */
#define MODOSC_EN_OFS                                      (10)                  /* MODOSC_EN Offset */
#define MODOSC_EN                                          (0x00000400)          /* Turns on the MODOSC oscillator */
/* CSCLKEN[REFOFSEL] Bits */
#define REFOFSEL_OFS                                       (15)                  /* REFOFSEL Offset */
#define REFOFSEL                                           (0x00008000)          /* Selects REFO nominal frequency */
/* CSSTAT[DCO_ON] Bits */
#define DCO_ON_OFS                                         ( 0)                  /* DCO_ON Offset */
#define DCO_ON                                             (0x00000001)          /* DCO status */
/* CSSTAT[DCOBIAS_ON] Bits */
#define DCOBIAS_ON_OFS                                     ( 1)                  /* DCOBIAS_ON Offset */
#define DCOBIAS_ON                                         (0x00000002)          /* DCO bias status */
/* CSSTAT[HFXT_ON] Bits */
#define HFXT_ON_OFS                                        ( 2)                  /* HFXT_ON Offset */
#define HFXT_ON                                            (0x00000004)          /* HFXT status */
/* CSSTAT[HFXT2_ON] Bits */
#define HFXT2_ON_OFS                                       ( 3)                  /* HFXT2_ON Offset */
#define HFXT2_ON                                           (0x00000008)          /* HFXT2 status */
/* CSSTAT[MODOSC_ON] Bits */
#define MODOSC_ON_OFS                                      ( 4)                  /* MODOSC_ON Offset */
#define MODOSC_ON                                          (0x00000010)          /* MODOSC status */
/* CSSTAT[VLO_ON] Bits */
#define VLO_ON_OFS                                         ( 5)                  /* VLO_ON Offset */
#define VLO_ON                                             (0x00000020)          /* VLO status */
/* CSSTAT[LFXT_ON] Bits */
#define LFXT_ON_OFS                                        ( 6)                  /* LFXT_ON Offset */
#define LFXT_ON                                            (0x00000040)          /* LFXT status */
/* CSSTAT[REFO_ON] Bits */
#define REFO_ON_OFS                                        ( 7)                  /* REFO_ON Offset */
#define REFO_ON                                            (0x00000080)          /* REFO status */
/* CSSTAT[ACLK_ON] Bits */
#define ACLK_ON_OFS                                        (16)                  /* ACLK_ON Offset */
#define ACLK_ON                                            (0x00010000)          /* ACLK system clock status */
/* CSSTAT[MCLK_ON] Bits */
#define MCLK_ON_OFS                                        (17)                  /* MCLK_ON Offset */
#define MCLK_ON                                            (0x00020000)          /* MCLK system clock status */
/* CSSTAT[HSMCLK_ON] Bits */
#define HSMCLK_ON_OFS                                      (18)                  /* HSMCLK_ON Offset */
#define HSMCLK_ON                                          (0x00040000)          /* HSMCLK system clock status */
/* CSSTAT[SMCLK_ON] Bits */
#define SMCLK_ON_OFS                                       (19)                  /* SMCLK_ON Offset */
#define SMCLK_ON                                           (0x00080000)          /* SMCLK system clock status */
/* CSSTAT[MODCLK_ON] Bits */
#define MODCLK_ON_OFS                                      (20)                  /* MODCLK_ON Offset */
#define MODCLK_ON                                          (0x00100000)          /* MODCLK system clock status */
/* CSSTAT[VLOCLK_ON] Bits */
#define VLOCLK_ON_OFS                                      (21)                  /* VLOCLK_ON Offset */
#define VLOCLK_ON                                          (0x00200000)          /* VLOCLK system clock status */
/* CSSTAT[LFXTCLK_ON] Bits */
#define LFXTCLK_ON_OFS                                     (22)                  /* LFXTCLK_ON Offset */
#define LFXTCLK_ON                                         (0x00400000)          /* LFXTCLK system clock status */
/* CSSTAT[REFOCLK_ON] Bits */
#define REFOCLK_ON_OFS                                     (23)                  /* REFOCLK_ON Offset */
#define REFOCLK_ON                                         (0x00800000)          /* REFOCLK system clock status */
/* CSSTAT[ACLK_READY] Bits */
#define ACLK_READY_OFS                                     (24)                  /* ACLK_READY Offset */
#define ACLK_READY                                         (0x01000000)          /* ACLK Ready status */
/* CSSTAT[MCLK_READY] Bits */
#define MCLK_READY_OFS                                     (25)                  /* MCLK_READY Offset */
#define MCLK_READY                                         (0x02000000)          /* MCLK Ready status */
/* CSSTAT[HSMCLK_READY] Bits */
#define HSMCLK_READY_OFS                                   (26)                  /* HSMCLK_READY Offset */
#define HSMCLK_READY                                       (0x04000000)          /* HSMCLK Ready status */
/* CSSTAT[SMCLK_READY] Bits */
#define SMCLK_READY_OFS                                    (27)                  /* SMCLK_READY Offset */
#define SMCLK_READY                                        (0x08000000)          /* SMCLK Ready status */
/* CSSTAT[BCLK_READY] Bits */
#define BCLK_READY_OFS                                     (28)                  /* BCLK_READY Offset */
#define BCLK_READY                                         (0x10000000)          /* BCLK Ready status */
/* CSIE[LFXTIE] Bits */
#define LFXTIE_OFS                                         ( 0)                  /* LFXTIE Offset */
#define LFXTIE                                             (0x00000001)          /* LFXT oscillator fault flag interrupt enable */
/* CSIE[HFXTIE] Bits */
#define HFXTIE_OFS                                         ( 1)                  /* HFXTIE Offset */
#define HFXTIE                                             (0x00000002)          /* HFXT oscillator fault flag interrupt enable */
/* CSIE[HFXT2IE] Bits */
#define HFXT2IE_OFS                                        ( 2)                  /* HFXT2IE Offset */
#define HFXT2IE                                            (0x00000004)          /* HFXT2 oscillator fault flag interrupt enable */
/* CSIE[DCOMINIE] Bits */
#define DCOMINIE_OFS                                       ( 4)                  /* DCOMINIE Offset */
#define DCOMINIE                                           (0x00000010)          /* DCO minimum fault flag interrupt enable */
/* CSIE[DCOMAXIE] Bits */
#define DCOMAXIE_OFS                                       ( 5)                  /* DCOMAXIE Offset */
#define DCOMAXIE                                           (0x00000020)          /* DCO maximum fault flag interrupt enable */
/* CSIE[DCORIE] Bits */
#define DCORIE_OFS                                         ( 6)                  /* DCORIE Offset */
#define DCORIE                                             (0x00000040)          /* DCO external resistor fault flag interrupt enable */
/* CSIE[FCNTLFIE] Bits */
#define FCNTLFIE_OFS                                       ( 8)                  /* FCNTLFIE Offset */
#define FCNTLFIE                                           (0x00000100)          /* Start fault counter interrupt enable LFXT */
/* CSIE[FCNTHFIE] Bits */
#define FCNTHFIE_OFS                                       ( 9)                  /* FCNTHFIE Offset */
#define FCNTHFIE                                           (0x00000200)          /* Start fault counter interrupt enable HFXT */
/* CSIE[FCNTHF2IE] Bits */
#define FCNTHF2IE_OFS                                      (10)                  /* FCNTHF2IE Offset */
#define FCNTHF2IE                                          (0x00000400)          /* Start fault counter interrupt enable HFXT2 */
/* CSIE[PLLOOLIE] Bits */
#define PLLOOLIE_OFS                                       (12)                  /* PLLOOLIE Offset */
#define PLLOOLIE                                           (0x00001000)          /* PLL out-of-lock interrupt enable */
/* CSIE[PLLLOSIE] Bits */
#define PLLLOSIE_OFS                                       (13)                  /* PLLLOSIE Offset */
#define PLLLOSIE                                           (0x00002000)          /* PLL loss-of-signal interrupt enable */
/* CSIE[PLLOORIE] Bits */
#define PLLOORIE_OFS                                       (14)                  /* PLLOORIE Offset */
#define PLLOORIE                                           (0x00004000)          /* PLL out-of-range interrupt enable */
/* CSIE[CALIE] Bits */
#define CALIE_OFS                                          (15)                  /* CALIE Offset */
#define CALIE                                              (0x00008000)          /* REFCNT period counter interrupt enable */
/* CSIFG[LFXTIFG] Bits */
#define LFXTIFG_OFS                                        ( 0)                  /* LFXTIFG Offset */
#define LFXTIFG                                            (0x00000001)          /* LFXT oscillator fault flag */
/* CSIFG[HFXTIFG] Bits */
#define HFXTIFG_OFS                                        ( 1)                  /* HFXTIFG Offset */
#define HFXTIFG                                            (0x00000002)          /* HFXT oscillator fault flag */
/* CSIFG[HFXT2IFG] Bits */
#define HFXT2IFG_OFS                                       ( 2)                  /* HFXT2IFG Offset */
#define HFXT2IFG                                           (0x00000004)          /* HFXT2 oscillator fault flag */
/* CSIFG[DCOMINIFG] Bits */
#define DCOMINIFG_OFS                                      ( 4)                  /* DCOMINIFG Offset */
#define DCOMINIFG                                          (0x00000010)          /* DCO minimum fault flag */
/* CSIFG[DCOMAXIFG] Bits */
#define DCOMAXIFG_OFS                                      ( 5)                  /* DCOMAXIFG Offset */
#define DCOMAXIFG                                          (0x00000020)          /* DCO maximum fault flag */
/* CSIFG[DCORIFG] Bits */
#define DCORIFG_OFS                                        ( 6)                  /* DCORIFG Offset */
#define DCORIFG                                            (0x00000040)          /* DCO external resistor fault flag */
/* CSIFG[FCNTLFIFG] Bits */
#define FCNTLFIFG_OFS                                      ( 8)                  /* FCNTLFIFG Offset */
#define FCNTLFIFG                                          (0x00000100)          /* Start fault counter interrupt flag LFXT */
/* CSIFG[FCNTHFIFG] Bits */
#define FCNTHFIFG_OFS                                      ( 9)                  /* FCNTHFIFG Offset */
#define FCNTHFIFG                                          (0x00000200)          /* Start fault counter interrupt flag HFXT */
/* CSIFG[FCNTHF2IFG] Bits */
#define FCNTHF2IFG_OFS                                     (11)                  /* FCNTHF2IFG Offset */
#define FCNTHF2IFG                                         (0x00000800)          /* Start fault counter interrupt flag HFXT2 */
/* CSIFG[PLLOOLIFG] Bits */
#define PLLOOLIFG_OFS                                      (12)                  /* PLLOOLIFG Offset */
#define PLLOOLIFG                                          (0x00001000)          /* PLL out-of-lock interrupt flag */
/* CSIFG[PLLLOSIFG] Bits */
#define PLLLOSIFG_OFS                                      (13)                  /* PLLLOSIFG Offset */
#define PLLLOSIFG                                          (0x00002000)          /* PLL loss-of-signal interrupt flag */
/* CSIFG[PLLOORIFG] Bits */
#define PLLOORIFG_OFS                                      (14)                  /* PLLOORIFG Offset */
#define PLLOORIFG                                          (0x00004000)          /* PLL out-of-range interrupt flag */
/* CSIFG[CALIFG] Bits */
#define CALIFG_OFS                                         (15)                  /* CALIFG Offset */
#define CALIFG                                             (0x00008000)          /* REFCNT period counter expired */
/* CSCLRIFG[CLR_LFXTIFG] Bits */
#define CLR_LFXTIFG_OFS                                    ( 0)                  /* CLR_LFXTIFG Offset */
#define CLR_LFXTIFG                                        (0x00000001)          /* Clear LFXT oscillator fault interrupt flag */
/* CSCLRIFG[CLR_HFXTIFG] Bits */
#define CLR_HFXTIFG_OFS                                    ( 1)                  /* CLR_HFXTIFG Offset */
#define CLR_HFXTIFG                                        (0x00000002)          /* Clear HFXT oscillator fault interrupt flag */
/* CSCLRIFG[CLR_HFXT2IFG] Bits */
#define CLR_HFXT2IFG_OFS                                   ( 2)                  /* CLR_HFXT2IFG Offset */
#define CLR_HFXT2IFG                                       (0x00000004)          /* Clear HFXT2 oscillator fault interrupt flag */
/* CSCLRIFG[CLR_DCOMAXIFG] Bits */
#define CLR_DCOMAXIFG_OFS                                  ( 5)                  /* CLR_DCOMAXIFG Offset */
#define CLR_DCOMAXIFG                                      (0x00000020)          /* Clear DCO maximum fault interrupt flag */
/* CSCLRIFG[CLR_DCORIFG] Bits */
#define CLR_DCORIFG_OFS                                    ( 6)                  /* CLR_DCORIFG Offset */
#define CLR_DCORIFG                                        (0x00000040)          /* Clear DCO external resistor fault interrupt flag */
/* CSCLRIFG[CLR_CALIFG] Bits */
#define CLR_CALIFG_OFS                                     ( 7)                  /* CLR_CALIFG Offset */
#define CLR_CALIFG                                         (0x00000080)          /* REFCNT period counter clear interrupt flag */
/* CSCLRIFG[CLR_DCOMINIFG] Bits */
#define CLR_DCOMINIFG_OFS                                  ( 4)                  /* CLR_DCOMINIFG Offset */
