helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/* UDMA_ALTBASE Control Bits */
#define UDMA_ALTBASE_ADDR_M                                0xFFFFFFFF            /* Alternate Channel Address Pointer */
#define UDMA_ALTBASE_ADDR_S                                0

/* UDMA_WAITSTAT Control Bits */
#define UDMA_WAITSTAT_WAITREQ_M                            0xFFFFFFFF            /* Channel [n] Wait Status */

/* UDMA_SWREQ Control Bits */
#define UDMA_SWREQ_M                                       0xFFFFFFFF            /* Channel [n] Software Request */

/* UDMA_USEBURSTSET Control Bits */
#define UDMA_USEBURSTSET_SET_M                             0xFFFFFFFF            /* Channel [n] Useburst Set */

/* UDMA_USEBURSTCLR Control Bits */
#define UDMA_USEBURSTCLR_CLR_M                             0xFFFFFFFF            /* Channel [n] Useburst Clear */

/* UDMA_REQMASKSET Control Bits */
#define UDMA_REQMASKSET_SET_M                              0xFFFFFFFF            /* Channel [n] Request Mask Set */

/* UDMA_REQMASKCLR Control Bits */
#define UDMA_REQMASKCLR_CLR_M                              0xFFFFFFFF            /* Channel [n] Request Mask Clear */

/* UDMA_ENASET Control Bits */
#define UDMA_ENASET_SET_M                                  0xFFFFFFFF            /* Channel [n] Enable Set */

/* UDMA_ENACLR Control Bits */
#define UDMA_ENACLR_CLR_M                                  0xFFFFFFFF            /* Clear Channel [n] Enable Clear */

/* UDMA_ALTSET Control Bits */
#define UDMA_ALTSET_SET_M                                  0xFFFFFFFF            /* Channel [n] Alternate Set */

/* UDMA_ALTCLR Control Bits */
#define UDMA_ALTCLR_CLR_M                                  0xFFFFFFFF            /* Channel [n] Alternate Clear */

/* UDMA_PRIOSET Control Bits */
#define UDMA_PRIOSET_SET_M                                 0xFFFFFFFF            /* Channel [n] Priority Set */

/* UDMA_PRIOCLR Control Bits */
#define UDMA_PRIOCLR_CLR_M                                 0xFFFFFFFF            /* Channel [n] Priority Clear */

/* UDMA_ERRCLR Control Bits */
#define UDMA_ERRCLR_ERRCLR                                 0x00000001            /* uDMA Bus Error Status */

/* UDMA_CHASGN Control Bits */
#define UDMA_CHASGN_M                                      0xFFFFFFFF            /* Channel [n] Assignment Select */
#define UDMA_CHASGN_PRIMARY                                0x00000000            /* Use the primary channel */
                                                                                 /* assignment */
#define UDMA_CHASGN_SECONDARY                              0x00000001            /* Use the secondary channel */
                                                                                 /* assignment */

/* Micro Direct Memory Access (uDMA) offsets */
#define UDMA_O_SRCENDP                                     0x00000000            /* DMA Channel Source Address End */
                                                                                 /* Pointer */
#define UDMA_O_DSTENDP                                     0x00000004            /* DMA Channel Destination Address */
                                                                                 /* End Pointer */
#define UDMA_O_CHCTL                                       0x00000008            /* DMA Channel Control Word */

/* UDMA_O_SRCENDP Control Bits */
#define UDMA_SRCENDP_ADDR_M                                0xFFFFFFFF            /* Source Address End Pointer */
#define UDMA_SRCENDP_ADDR_S                                0

/* UDMA_O_DSTENDP Control Bits */
#define UDMA_DSTENDP_ADDR_M                                0xFFFFFFFF            /* Destination Address End Pointer */
#define UDMA_DSTENDP_ADDR_S                                0

/* UDMA_O_CHCTL Control Bits */
#define UDMA_CHCTL_DSTINC_M                                0xC0000000            /* Destination Address Increment */
#define UDMA_CHCTL_DSTINC_8                                0x00000000            /* Byte */
#define UDMA_CHCTL_DSTINC_16                               0x40000000            /* Half-word */
#define UDMA_CHCTL_DSTINC_32                               0x80000000            /* Word */
#define UDMA_CHCTL_DSTINC_NONE                             0xC0000000            /* No increment */
#define UDMA_CHCTL_DSTSIZE_M                               0x30000000            /* Destination Data Size */
#define UDMA_CHCTL_DSTSIZE_8                               0x00000000            /* Byte */
#define UDMA_CHCTL_DSTSIZE_16                              0x10000000            /* Half-word */
#define UDMA_CHCTL_DSTSIZE_32                              0x20000000            /* Word */
#define UDMA_CHCTL_SRCINC_M                                0x0C000000            /* Source Address Increment */
#define UDMA_CHCTL_SRCINC_8                                0x00000000            /* Byte */
#define UDMA_CHCTL_SRCINC_16                               0x04000000            /* Half-word */
#define UDMA_CHCTL_SRCINC_32                               0x08000000            /* Word */
#define UDMA_CHCTL_SRCINC_NONE                             0x0C000000            /* No increment */
#define UDMA_CHCTL_SRCSIZE_M                               0x03000000            /* Source Data Size */
#define UDMA_CHCTL_SRCSIZE_8                               0x00000000            /* Byte */
#define UDMA_CHCTL_SRCSIZE_16                              0x01000000            /* Half-word */
#define UDMA_CHCTL_SRCSIZE_32                              0x02000000            /* Word */
#define UDMA_CHCTL_ARBSIZE_M                               0x0003C000            /* Arbitration Size */
#define UDMA_CHCTL_ARBSIZE_1                               0x00000000            /* 1 Transfer */
#define UDMA_CHCTL_ARBSIZE_2                               0x00004000            /* 2 Transfers */
#define UDMA_CHCTL_ARBSIZE_4                               0x00008000            /* 4 Transfers */
#define UDMA_CHCTL_ARBSIZE_8                               0x0000C000            /* 8 Transfers */
#define UDMA_CHCTL_ARBSIZE_16                              0x00010000            /* 16 Transfers */
#define UDMA_CHCTL_ARBSIZE_32                              0x00014000            /* 32 Transfers */
#define UDMA_CHCTL_ARBSIZE_64                              0x00018000            /* 64 Transfers */
#define UDMA_CHCTL_ARBSIZE_128                             0x0001C000            /* 128 Transfers */
#define UDMA_CHCTL_ARBSIZE_256                             0x00020000            /* 256 Transfers */
#define UDMA_CHCTL_ARBSIZE_512                             0x00024000            /* 512 Transfers */
#define UDMA_CHCTL_ARBSIZE_1024                            0x00028000            /* 1024 Transfers */
#define UDMA_CHCTL_XFERSIZE_M                              0x00003FF0            /* Transfer Size (minus 1) */
#define UDMA_CHCTL_NXTUSEBURST                             0x00000008            /* Next Useburst */
#define UDMA_CHCTL_XFERMODE_M                              0x00000007            /* uDMA Transfer Mode */
#define UDMA_CHCTL_XFERMODE_STOP                           0x00000000            /* Stop */
#define UDMA_CHCTL_XFERMODE_BASIC                          0x00000001            /* Basic */
#define UDMA_CHCTL_XFERMODE_AUTO                           0x00000002            /* Auto-Request */
#define UDMA_CHCTL_XFERMODE_PINGPONG                       0x00000003            /* Ping-Pong */
#define UDMA_CHCTL_XFERMODE_MEM_SG                         0x00000004            /* Memory Scatter-Gather */
#define UDMA_CHCTL_XFERMODE_MEM_SGA                        0x00000005            /* Alternate Memory Scatter-Gather */
#define UDMA_CHCTL_XFERMODE_PER_SG                         0x00000006            /* Peripheral Scatter-Gather */
#define UDMA_CHCTL_XFERMODE_PER_SGA                        0x00000007            /* Alternate Peripheral */
                                                                                 /* Scatter-Gather */
#define UDMA_CHCTL_XFERSIZE_S                              4


