helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// DWT Bits
/***************************************************************************
/* DWT_CTRL[DWT_CTRL_CYCCNTENA] Bits */
#define DWT_CTRL_CYCCNTENA_OFS                             ( 0)                  /* CYCCNTENA Offset */
#define DWT_CTRL_CYCCNTENA                                 (0x00000001)          /*  */
/* DWT_CTRL[DWT_CTRL_POSTPRESET] Bits */
#define DWT_CTRL_POSTPRESET_OFS                            ( 1)                  /* POSTPRESET Offset */
#define DWT_CTRL_POSTPRESET_M                              (0x0000001e)          /*  */
/* DWT_CTRL[DWT_CTRL_POSTCNT] Bits */
#define DWT_CTRL_POSTCNT_OFS                               ( 5)                  /* POSTCNT Offset */
#define DWT_CTRL_POSTCNT_M                                 (0x000001e0)          /*  */
/* DWT_CTRL[DWT_CTRL_CYCTAP] Bits */
#define DWT_CTRL_CYCTAP_OFS                                ( 9)                  /* CYCTAP Offset */
#define DWT_CTRL_CYCTAP                                    (0x00000200)          /*  */
/* DWT_CTRL[DWT_CTRL_SYNCTAP] Bits */
#define DWT_CTRL_SYNCTAP_OFS                               (10)                  /* SYNCTAP Offset */
#define DWT_CTRL_SYNCTAP_M                                 (0x00000c00)          /*  */
#define DWT_CTRL_SYNCTAP0                                  (0x00000400)          /*  */
#define DWT_CTRL_SYNCTAP1                                  (0x00000800)          /*  */
#define DWT_CTRL_SYNCTAP_0                                 (0x00000000)          /* Disabled. No synch counting. */
#define DWT_CTRL_SYNCTAP_1                                 (0x00000400)          /* Tap at CYCCNT bit 24. */
#define DWT_CTRL_SYNCTAP_2                                 (0x00000800)          /* Tap at CYCCNT bit 26. */
#define DWT_CTRL_SYNCTAP_3                                 (0x00000c00)          /* Tap at CYCCNT bit 28. */
/* DWT_CTRL[DWT_CTRL_PCSAMPLEENA] Bits */
#define DWT_CTRL_PCSAMPLEENA_OFS                           (12)                  /* PCSAMPLEENA Offset */
#define DWT_CTRL_PCSAMPLEENA                               (0x00001000)          /*  */
/* DWT_CTRL[DWT_CTRL_EXCTRCENA] Bits */
#define DWT_CTRL_EXCTRCENA_OFS                             (16)                  /* EXCTRCENA Offset */
#define DWT_CTRL_EXCTRCENA                                 (0x00010000)          /*  */
/* DWT_CTRL[DWT_CTRL_CPIEVTENA] Bits */
#define DWT_CTRL_CPIEVTENA_OFS                             (17)                  /* CPIEVTENA Offset */
#define DWT_CTRL_CPIEVTENA                                 (0x00020000)          /*  */
/* DWT_CTRL[DWT_CTRL_EXCEVTENA] Bits */
#define DWT_CTRL_EXCEVTENA_OFS                             (18)                  /* EXCEVTENA Offset */
#define DWT_CTRL_EXCEVTENA                                 (0x00040000)          /*  */
/* DWT_CTRL[DWT_CTRL_SLEEPEVTENA] Bits */
#define DWT_CTRL_SLEEPEVTENA_OFS                           (19)                  /* SLEEPEVTENA Offset */
#define DWT_CTRL_SLEEPEVTENA                               (0x00080000)          /*  */
/* DWT_CTRL[DWT_CTRL_LSUEVTENA] Bits */
#define DWT_CTRL_LSUEVTENA_OFS                             (20)                  /* LSUEVTENA Offset */
#define DWT_CTRL_LSUEVTENA                                 (0x00100000)          /*  */
/* DWT_CTRL[DWT_CTRL_FOLDEVTENA] Bits */
#define DWT_CTRL_FOLDEVTENA_OFS                            (21)                  /* FOLDEVTENA Offset */
#define DWT_CTRL_FOLDEVTENA                                (0x00200000)          /*  */
/* DWT_CTRL[DWT_CTRL_CYCEVTENA] Bits */
#define DWT_CTRL_CYCEVTENA_OFS                             (22)                  /* CYCEVTENA Offset */
#define DWT_CTRL_CYCEVTENA                                 (0x00400000)          /*  */
/* DWT_CTRL[DWT_CTRL_NOPRFCNT] Bits */
#define DWT_CTRL_NOPRFCNT_OFS                              (24)                  /* NOPRFCNT Offset */
#define DWT_CTRL_NOPRFCNT                                  (0x01000000)          /*  */
/* DWT_CTRL[DWT_CTRL_NOCYCCNT] Bits */
#define DWT_CTRL_NOCYCCNT_OFS                              (25)                  /* NOCYCCNT Offset */
#define DWT_CTRL_NOCYCCNT                                  (0x02000000)          /*  */
/* DWT_CPICNT[DWT_CPICNT_CPICNT] Bits */
#define DWT_CPICNT_CPICNT_OFS                              ( 0)                  /* CPICNT Offset */
#define DWT_CPICNT_CPICNT_M                                (0x000000ff)          /*  */
/* DWT_EXCCNT[DWT_EXCCNT_EXCCNT] Bits */
#define DWT_EXCCNT_EXCCNT_OFS                              ( 0)                  /* EXCCNT Offset */
#define DWT_EXCCNT_EXCCNT_M                                (0x000000ff)          /*  */
/* DWT_SLEEPCNT[DWT_SLEEPCNT_SLEEPCNT] Bits */
#define DWT_SLEEPCNT_SLEEPCNT_OFS                          ( 0)                  /* SLEEPCNT Offset */
#define DWT_SLEEPCNT_SLEEPCNT_M                            (0x000000ff)          /*  */
/* DWT_LSUCNT[DWT_LSUCNT_LSUCNT] Bits */
#define DWT_LSUCNT_LSUCNT_OFS                              ( 0)                  /* LSUCNT Offset */
#define DWT_LSUCNT_LSUCNT_M                                (0x000000ff)          /*  */
/* DWT_FOLDCNT[DWT_FOLDCNT_FOLDCNT] Bits */
#define DWT_FOLDCNT_FOLDCNT_OFS                            ( 0)                  /* FOLDCNT Offset */
#define DWT_FOLDCNT_FOLDCNT_M                              (0x000000ff)          /*  */
/* DWT_MASK0[DWT_MASK0_MASK] Bits */
#define DWT_MASK0_MASK_OFS                                 ( 0)                  /* MASK Offset */
#define DWT_MASK0_MASK_M                                   (0x0000000f)          /*  */
/* DWT_FUNCTION0[DWT_FUNCTION0_FUNCTION] Bits */
#define DWT_FUNCTION0_FUNCTION_OFS                         ( 0)                  /* FUNCTION Offset */
#define DWT_FUNCTION0_FUNCTION_M                           (0x0000000f)          /*  */
#define DWT_FUNCTION0_FUNCTION0                            (0x00000001)          /*  */
#define DWT_FUNCTION0_FUNCTION1                            (0x00000002)          /*  */
#define DWT_FUNCTION0_FUNCTION2                            (0x00000004)          /*  */
#define DWT_FUNCTION0_FUNCTION3                            (0x00000008)          /*  */
#define DWT_FUNCTION0_FUNCTION_0                           (0x00000000)          /* Disabled */
#define DWT_FUNCTION0_FUNCTION_1                           (0x00000001)          /* EMITRANGE = 0, sample and emit PC through ITM. EMITRANGE = 1, emit address offset through ITM */
#define DWT_FUNCTION0_FUNCTION_2                           (0x00000002)          /* EMITRANGE = 0, emit data through ITM on read and write. EMITRANGE = 1, emit data and address offset through ITM on read or write. */
#define DWT_FUNCTION0_FUNCTION_3                           (0x00000003)          /* EMITRANGE = 0, sample PC and data value through ITM on read or write. EMITRANGE = 1, emit address offset and data value through ITM on read or write. */
#define DWT_FUNCTION0_FUNCTION_4                           (0x00000004)          /* Watchpoint on PC match. */
#define DWT_FUNCTION0_FUNCTION_5                           (0x00000005)          /* Watchpoint on read. */
#define DWT_FUNCTION0_FUNCTION_6                           (0x00000006)          /* Watchpoint on write. */
#define DWT_FUNCTION0_FUNCTION_7                           (0x00000007)          /* Watchpoint on read or write. */
#define DWT_FUNCTION0_FUNCTION_8                           (0x00000008)          /* ETM trigger on PC match */
#define DWT_FUNCTION0_FUNCTION_9                           (0x00000009)          /* ETM trigger on read */
#define DWT_FUNCTION0_FUNCTION_10                          (0x0000000a)          /* ETM trigger on write */
#define DWT_FUNCTION0_FUNCTION_11                          (0x0000000b)          /* ETM trigger on read or write */
#define DWT_FUNCTION0_FUNCTION_12                          (0x0000000c)          /* EMITRANGE = 0, sample data for read transfers. EMITRANGE = 1, sample Daddr [15:0] for read transfers */
#define DWT_FUNCTION0_FUNCTION_13                          (0x0000000d)          /* EMITRANGE = 0, sample data for write transfers. EMITRANGE = 1, sample Daddr [15:0] for write transfers */
#define DWT_FUNCTION0_FUNCTION_14                          (0x0000000e)          /* EMITRANGE = 0, sample PC + data for read transfers. EMITRANGE = 1, sample Daddr [15:0] + data for read transfers */
#define DWT_FUNCTION0_FUNCTION_15                          (0x0000000f)          /* EMITRANGE = 0, sample PC + data for write transfers. EMITRANGE = 1, sample Daddr [15:0] + data for write transfers */
/* DWT_FUNCTION0[DWT_FUNCTION0_EMITRANGE] Bits */
#define DWT_FUNCTION0_EMITRANGE_OFS                        ( 5)                  /* EMITRANGE Offset */
#define DWT_FUNCTION0_EMITRANGE                            (0x00000020)          /*  */
/* DWT_FUNCTION0[DWT_FUNCTION0_DATAVMATCH] Bits */
#define DWT_FUNCTION0_DATAVMATCH_OFS                       ( 8)                  /* DATAVMATCH Offset */
#define DWT_FUNCTION0_DATAVMATCH                           (0x00000100)          /*  */
/* DWT_FUNCTION0[DWT_FUNCTION0_LNK1ENA] Bits */
#define DWT_FUNCTION0_LNK1ENA_OFS                          ( 9)                  /* LNK1ENA Offset */
#define DWT_FUNCTION0_LNK1ENA                              (0x00000200)          /*  */
/* DWT_FUNCTION0[DWT_FUNCTION0_DATAVSIZE] Bits */
#define DWT_FUNCTION0_DATAVSIZE_OFS                        (10)                  /* DATAVSIZE Offset */
#define DWT_FUNCTION0_DATAVSIZE_M                          (0x00000c00)          /*  */
#define DWT_FUNCTION0_DATAVSIZE0                           (0x00000400)          /*  */
#define DWT_FUNCTION0_DATAVSIZE1                           (0x00000800)          /*  */
#define DWT_FUNCTION0_DATAVSIZE_0                          (0x00000000)          /* byte */
#define DWT_FUNCTION0_DATAVSIZE_1                          (0x00000400)          /* halfword */
#define DWT_FUNCTION0_DATAVSIZE_2                          (0x00000800)          /* word */
#define DWT_FUNCTION0_DATAVSIZE_3                          (0x00000c00)          /* Unpredictable. */
/* DWT_FUNCTION0[DWT_FUNCTION0_DATAVADDR0] Bits */
#define DWT_FUNCTION0_DATAVADDR0_OFS                       (12)                  /* DATAVADDR0 Offset */
#define DWT_FUNCTION0_DATAVADDR0_M                         (0x0000f000)          /*  */
/* DWT_FUNCTION0[DWT_FUNCTION0_DATAVADDR1] Bits */
#define DWT_FUNCTION0_DATAVADDR1_OFS                       (16)                  /* DATAVADDR1 Offset */
#define DWT_FUNCTION0_DATAVADDR1_M                         (0x000f0000)          /*  */
/* DWT_FUNCTION0[DWT_FUNCTION0_MATCHED] Bits */
#define DWT_FUNCTION0_MATCHED_OFS                          (24)                  /* MATCHED Offset */
#define DWT_FUNCTION0_MATCHED                              (0x01000000)          /*  */
/* DWT_MASK1[DWT_MASK1_MASK] Bits */
#define DWT_MASK1_MASK_OFS                                 ( 0)                  /* MASK Offset */
#define DWT_MASK1_MASK_M                                   (0x0000000f)          /*  */
/* DWT_FUNCTION1[DWT_FUNCTION1_FUNCTION] Bits */
#define DWT_FUNCTION1_FUNCTION_OFS                         ( 0)                  /* FUNCTION Offset */
#define DWT_FUNCTION1_FUNCTION_M                           (0x0000000f)          /*  */
#define DWT_FUNCTION1_FUNCTION0                            (0x00000001)          /*  */
#define DWT_FUNCTION1_FUNCTION1                            (0x00000002)          /*  */
#define DWT_FUNCTION1_FUNCTION2                            (0x00000004)          /*  */
#define DWT_FUNCTION1_FUNCTION3                            (0x00000008)          /*  */
#define DWT_FUNCTION1_FUNCTION_0                           (0x00000000)          /* Disabled */
#define DWT_FUNCTION1_FUNCTION_1                           (0x00000001)          /* EMITRANGE = 0, sample and emit PC through ITM. EMITRANGE = 1, emit address offset through ITM */
#define DWT_FUNCTION1_FUNCTION_2                           (0x00000002)          /* EMITRANGE = 0, emit data through ITM on read and write. EMITRANGE = 1, emit data and address offset through ITM on read or write. */
#define DWT_FUNCTION1_FUNCTION_3                           (0x00000003)          /* EMITRANGE = 0, sample PC and data value through ITM on read or write. EMITRANGE = 1, emit address offset and data value through ITM on read or write. */
#define DWT_FUNCTION1_FUNCTION_4                           (0x00000004)          /* Watchpoint on PC match. */
#define DWT_FUNCTION1_FUNCTION_5                           (0x00000005)          /* Watchpoint on read. */
#define DWT_FUNCTION1_FUNCTION_6                           (0x00000006)          /* Watchpoint on write. */
#define DWT_FUNCTION1_FUNCTION_7                           (0x00000007)          /* Watchpoint on read or write. */
#define DWT_FUNCTION1_FUNCTION_8                           (0x00000008)          /* ETM trigger on PC match */
#define DWT_FUNCTION1_FUNCTION_9                           (0x00000009)          /* ETM trigger on read */
#define DWT_FUNCTION1_FUNCTION_10                          (0x0000000a)          /* ETM trigger on write */
#define DWT_FUNCTION1_FUNCTION_11                          (0x0000000b)          /* ETM trigger on read or write */
#define DWT_FUNCTION1_FUNCTION_12                          (0x0000000c)          /* EMITRANGE = 0, sample data for read transfers. EMITRANGE = 1, sample Daddr [15:0] for read transfers */
#define DWT_FUNCTION1_FUNCTION_13                          (0x0000000d)          /* EMITRANGE = 0, sample data for write transfers. EMITRANGE = 1, sample Daddr [15:0] for write transfers */
#define DWT_FUNCTION1_FUNCTION_14                          (0x0000000e)          /* EMITRANGE = 0, sample PC + data for read transfers. EMITRANGE = 1, sample Daddr [15:0] + data for read transfers */
#define DWT_FUNCTION1_FUNCTION_15                          (0x0000000f)          /* EMITRANGE = 0, sample PC + data for write transfers. EMITRANGE = 1, sample Daddr [15:0] + data for write transfers */
/* DWT_FUNCTION1[DWT_FUNCTION1_EMITRANGE] Bits */
#define DWT_FUNCTION1_EMITRANGE_OFS                        ( 5)                  /* EMITRANGE Offset */
#define DWT_FUNCTION1_EMITRANGE                            (0x00000020)          /*  */
/* DWT_FUNCTION1[DWT_FUNCTION1_CYCMATCH] Bits */
#define DWT_FUNCTION1_CYCMATCH_OFS                         ( 7)                  /* CYCMATCH Offset */
#define DWT_FUNCTION1_CYCMATCH                             (0x00000080)          /*  */
/* DWT_FUNCTION1[DWT_FUNCTION1_DATAVMATCH] Bits */
#define DWT_FUNCTION1_DATAVMATCH_OFS                       ( 8)                  /* DATAVMATCH Offset */
#define DWT_FUNCTION1_DATAVMATCH                           (0x00000100)          /*  */
/* DWT_FUNCTION1[DWT_FUNCTION1_LNK1ENA] Bits */
#define DWT_FUNCTION1_LNK1ENA_OFS                          ( 9)                  /* LNK1ENA Offset */
#define DWT_FUNCTION1_LNK1ENA                              (0x00000200)          /*  */
/* DWT_FUNCTION1[DWT_FUNCTION1_DATAVSIZE] Bits */
#define DWT_FUNCTION1_DATAVSIZE_OFS                        (10)                  /* DATAVSIZE Offset */
#define DWT_FUNCTION1_DATAVSIZE_M                          (0x00000c00)          /*  */
#define DWT_FUNCTION1_DATAVSIZE0                           (0x00000400)          /*  */
#define DWT_FUNCTION1_DATAVSIZE1                           (0x00000800)          /*  */
#define DWT_FUNCTION1_DATAVSIZE_0                          (0x00000000)          /* byte */
#define DWT_FUNCTION1_DATAVSIZE_1                          (0x00000400)          /* halfword */
#define DWT_FUNCTION1_DATAVSIZE_2                          (0x00000800)          /* word */
#define DWT_FUNCTION1_DATAVSIZE_3                          (0x00000c00)          /* Unpredictable. */
/* DWT_FUNCTION1[DWT_FUNCTION1_DATAVADDR0] Bits */
#define DWT_FUNCTION1_DATAVADDR0_OFS                       (12)                  /* DATAVADDR0 Offset */
#define DWT_FUNCTION1_DATAVADDR0_M                         (0x0000f000)          /*  */
/* DWT_FUNCTION1[DWT_FUNCTION1_DATAVADDR1] Bits */
#define DWT_FUNCTION1_DATAVADDR1_OFS                       (16)                  /* DATAVADDR1 Offset */
#define DWT_FUNCTION1_DATAVADDR1_M                         (0x000f0000)          /*  */
/* DWT_FUNCTION1[DWT_FUNCTION1_MATCHED] Bits */
#define DWT_FUNCTION1_MATCHED_OFS                          (24)                  /* MATCHED Offset */
#define DWT_FUNCTION1_MATCHED                              (0x01000000)          /*  */
/* DWT_MASK2[DWT_MASK2_MASK] Bits */
#define DWT_MASK2_MASK_OFS                                 ( 0)                  /* MASK Offset */
#define DWT_MASK2_MASK_M                                   (0x0000000f)          /*  */
/* DWT_FUNCTION2[DWT_FUNCTION2_FUNCTION] Bits */
#define DWT_FUNCTION2_FUNCTION_OFS                         ( 0)                  /* FUNCTION Offset */
#define DWT_FUNCTION2_FUNCTION_M                           (0x0000000f)          /*  */
#define DWT_FUNCTION2_FUNCTION0                            (0x00000001)          /*  */
#define DWT_FUNCTION2_FUNCTION1                            (0x00000002)          /*  */
#define DWT_FUNCTION2_FUNCTION2                            (0x00000004)          /*  */
#define DWT_FUNCTION2_FUNCTION3                            (0x00000008)          /*  */
#define DWT_FUNCTION2_FUNCTION_0                           (0x00000000)          /* Disabled */
#define DWT_FUNCTION2_FUNCTION_1                           (0x00000001)          /* EMITRANGE = 0, sample and emit PC through ITM. EMITRANGE = 1, emit address offset through ITM */
#define DWT_FUNCTION2_FUNCTION_2                           (0x00000002)          /* EMITRANGE = 0, emit data through ITM on read and write. EMITRANGE = 1, emit data and address offset through ITM on read or write. */
#define DWT_FUNCTION2_FUNCTION_3                           (0x00000003)          /* EMITRANGE = 0, sample PC and data value through ITM on read or write. EMITRANGE = 1, emit address offset and data value through ITM on read or write. */
#define DWT_FUNCTION2_FUNCTION_4                           (0x00000004)          /* Watchpoint on PC match. */
#define DWT_FUNCTION2_FUNCTION_5                           (0x00000005)          /* Watchpoint on read. */
#define DWT_FUNCTION2_FUNCTION_6                           (0x00000006)          /* Watchpoint on write. */
#define DWT_FUNCTION2_FUNCTION_7                           (0x00000007)          /* Watchpoint on read or write. */
#define DWT_FUNCTION2_FUNCTION_8                           (0x00000008)          /* ETM trigger on PC match */
#define DWT_FUNCTION2_FUNCTION_9                           (0x00000009)          /* ETM trigger on read */
#define DWT_FUNCTION2_FUNCTION_10                          (0x0000000a)          /* ETM trigger on write */
#define DWT_FUNCTION2_FUNCTION_11                          (0x0000000b)          /* ETM trigger on read or write */
#define DWT_FUNCTION2_FUNCTION_12                          (0x0000000c)          /* EMITRANGE = 0, sample data for read transfers. EMITRANGE = 1, sample Daddr [15:0] for read transfers */
#define DWT_FUNCTION2_FUNCTION_13                          (0x0000000d)          /* EMITRANGE = 0, sample data for write transfers. EMITRANGE = 1, sample Daddr [15:0] for write transfers */
#define DWT_FUNCTION2_FUNCTION_14                          (0x0000000e)          /* EMITRANGE = 0, sample PC + data for read transfers. EMITRANGE = 1, sample Daddr [15:0] + data for read transfers */
#define DWT_FUNCTION2_FUNCTION_15                          (0x0000000f)          /* EMITRANGE = 0, sample PC + data for write transfers. EMITRANGE = 1, sample Daddr [15:0] + data for write transfers */
/* DWT_FUNCTION2[DWT_FUNCTION2_EMITRANGE] Bits */
#define DWT_FUNCTION2_EMITRANGE_OFS                        ( 5)                  /* EMITRANGE Offset */
#define DWT_FUNCTION2_EMITRANGE                            (0x00000020)          /*  */
/* DWT_FUNCTION2[DWT_FUNCTION2_DATAVMATCH] Bits */
#define DWT_FUNCTION2_DATAVMATCH_OFS                       ( 8)                  /* DATAVMATCH Offset */
#define DWT_FUNCTION2_DATAVMATCH                           (0x00000100)          /*  */
/* DWT_FUNCTION2[DWT_FUNCTION2_LNK1ENA] Bits */
#define DWT_FUNCTION2_LNK1ENA_OFS                          ( 9)                  /* LNK1ENA Offset */
#define DWT_FUNCTION2_LNK1ENA                              (0x00000200)          /*  */
/* DWT_FUNCTION2[DWT_FUNCTION2_DATAVSIZE] Bits */
#define DWT_FUNCTION2_DATAVSIZE_OFS                        (10)                  /* DATAVSIZE Offset */
#define DWT_FUNCTION2_DATAVSIZE_M                          (0x00000c00)          /*  */
#define DWT_FUNCTION2_DATAVSIZE0                           (0x00000400)          /*  */
#define DWT_FUNCTION2_DATAVSIZE1                           (0x00000800)          /*  */
#define DWT_FUNCTION2_DATAVSIZE_0                          (0x00000000)          /* byte */
#define DWT_FUNCTION2_DATAVSIZE_1                          (0x00000400)          /* halfword */
#define DWT_FUNCTION2_DATAVSIZE_2                          (0x00000800)          /* word */
#define DWT_FUNCTION2_DATAVSIZE_3                          (0x00000c00)          /* Unpredictable. */
/* DWT_FUNCTION2[DWT_FUNCTION2_DATAVADDR0] Bits */
#define DWT_FUNCTION2_DATAVADDR0_OFS                       (12)                  /* DATAVADDR0 Offset */
#define DWT_FUNCTION2_DATAVADDR0_M                         (0x0000f000)          /*  */
/* DWT_FUNCTION2[DWT_FUNCTION2_DATAVADDR1] Bits */
#define DWT_FUNCTION2_DATAVADDR1_OFS                       (16)                  /* DATAVADDR1 Offset */
#define DWT_FUNCTION2_DATAVADDR1_M                         (0x000f0000)          /*  */
/* DWT_FUNCTION2[DWT_FUNCTION2_MATCHED] Bits */
#define DWT_FUNCTION2_MATCHED_OFS                          (24)                  /* MATCHED Offset */
#define DWT_FUNCTION2_MATCHED                              (0x01000000)          /*  */
/* DWT_MASK3[DWT_MASK3_MASK] Bits */
#define DWT_MASK3_MASK_OFS                                 ( 0)                  /* MASK Offset */
#define DWT_MASK3_MASK_M                                   (0x0000000f)          /*  */
/* DWT_FUNCTION3[DWT_FUNCTION3_FUNCTION] Bits */
#define DWT_FUNCTION3_FUNCTION_OFS                         ( 0)                  /* FUNCTION Offset */
#define DWT_FUNCTION3_FUNCTION_M                           (0x0000000f)          /*  */
#define DWT_FUNCTION3_FUNCTION0                            (0x00000001)          /*  */
#define DWT_FUNCTION3_FUNCTION1                            (0x00000002)          /*  */
#define DWT_FUNCTION3_FUNCTION2                            (0x00000004)          /*  */
#define DWT_FUNCTION3_FUNCTION3                            (0x00000008)          /*  */
#define DWT_FUNCTION3_FUNCTION_0                           (0x00000000)          /* Disabled */
#define DWT_FUNCTION3_FUNCTION_1                           (0x00000001)          /* EMITRANGE = 0, sample and emit PC through ITM. EMITRANGE = 1, emit address offset through ITM */
#define DWT_FUNCTION3_FUNCTION_2                           (0x00000002)          /* EMITRANGE = 0, emit data through ITM on read and write. EMITRANGE = 1, emit data and address offset through ITM on read or write. */
#define DWT_FUNCTION3_FUNCTION_3                           (0x00000003)          /* EMITRANGE = 0, sample PC and data value through ITM on read or write. EMITRANGE = 1, emit address offset and data value through ITM on read or write. */
#define DWT_FUNCTION3_FUNCTION_4                           (0x00000004)          /* Watchpoint on PC match. */
