helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
#define DWT_FUNCTION3_FUNCTION_5                           (0x00000005)          /* Watchpoint on read. */
#define DWT_FUNCTION3_FUNCTION_6                           (0x00000006)          /* Watchpoint on write. */
#define DWT_FUNCTION3_FUNCTION_7                           (0x00000007)          /* Watchpoint on read or write. */
#define DWT_FUNCTION3_FUNCTION_8                           (0x00000008)          /* ETM trigger on PC match */
#define DWT_FUNCTION3_FUNCTION_9                           (0x00000009)          /* ETM trigger on read */
#define DWT_FUNCTION3_FUNCTION_10                          (0x0000000a)          /* ETM trigger on write */
#define DWT_FUNCTION3_FUNCTION_11                          (0x0000000b)          /* ETM trigger on read or write */
#define DWT_FUNCTION3_FUNCTION_12                          (0x0000000c)          /* EMITRANGE = 0, sample data for read transfers. EMITRANGE = 1, sample Daddr [15:0] for read transfers */
#define DWT_FUNCTION3_FUNCTION_13                          (0x0000000d)          /* EMITRANGE = 0, sample data for write transfers. EMITRANGE = 1, sample Daddr [15:0] for write transfers */
#define DWT_FUNCTION3_FUNCTION_14                          (0x0000000e)          /* EMITRANGE = 0, sample PC + data for read transfers. EMITRANGE = 1, sample Daddr [15:0] + data for read transfers */
#define DWT_FUNCTION3_FUNCTION_15                          (0x0000000f)          /* EMITRANGE = 0, sample PC + data for write transfers. EMITRANGE = 1, sample Daddr [15:0] + data for write transfers */
/* DWT_FUNCTION3[DWT_FUNCTION3_EMITRANGE] Bits */
#define DWT_FUNCTION3_EMITRANGE_OFS                        ( 5)                  /* EMITRANGE Offset */
#define DWT_FUNCTION3_EMITRANGE                            (0x00000020)          /*  */
/* DWT_FUNCTION3[DWT_FUNCTION3_DATAVMATCH] Bits */
#define DWT_FUNCTION3_DATAVMATCH_OFS                       ( 8)                  /* DATAVMATCH Offset */
#define DWT_FUNCTION3_DATAVMATCH                           (0x00000100)          /*  */
/* DWT_FUNCTION3[DWT_FUNCTION3_LNK1ENA] Bits */
#define DWT_FUNCTION3_LNK1ENA_OFS                          ( 9)                  /* LNK1ENA Offset */
#define DWT_FUNCTION3_LNK1ENA                              (0x00000200)          /*  */
/* DWT_FUNCTION3[DWT_FUNCTION3_DATAVSIZE] Bits */
#define DWT_FUNCTION3_DATAVSIZE_OFS                        (10)                  /* DATAVSIZE Offset */
#define DWT_FUNCTION3_DATAVSIZE_M                          (0x00000c00)          /*  */
#define DWT_FUNCTION3_DATAVSIZE0                           (0x00000400)          /*  */
#define DWT_FUNCTION3_DATAVSIZE1                           (0x00000800)          /*  */
#define DWT_FUNCTION3_DATAVSIZE_0                          (0x00000000)          /* byte */
#define DWT_FUNCTION3_DATAVSIZE_1                          (0x00000400)          /* halfword */
#define DWT_FUNCTION3_DATAVSIZE_2                          (0x00000800)          /* word */
#define DWT_FUNCTION3_DATAVSIZE_3                          (0x00000c00)          /* Unpredictable. */
/* DWT_FUNCTION3[DWT_FUNCTION3_DATAVADDR0] Bits */
#define DWT_FUNCTION3_DATAVADDR0_OFS                       (12)                  /* DATAVADDR0 Offset */
#define DWT_FUNCTION3_DATAVADDR0_M                         (0x0000f000)          /*  */
/* DWT_FUNCTION3[DWT_FUNCTION3_DATAVADDR1] Bits */
#define DWT_FUNCTION3_DATAVADDR1_OFS                       (16)                  /* DATAVADDR1 Offset */
#define DWT_FUNCTION3_DATAVADDR1_M                         (0x000f0000)          /*  */
/* DWT_FUNCTION3[DWT_FUNCTION3_MATCHED] Bits */
#define DWT_FUNCTION3_MATCHED_OFS                          (24)                  /* MATCHED Offset */
#define DWT_FUNCTION3_MATCHED                              (0x01000000)          /*  */


/***************************************************************************
// EUSCI_A0 Bits
/***************************************************************************
/* UCA0CTLW0[UCSWRST] Bits */
#define UCSWRST_OFS                                        ( 0)                  /* UCSWRST Offset */
#define UCSWRST                                            (0x0001)              /* Software reset enable */
/* UCA0CTLW0[UCTXBRK] Bits */
#define UCTXBRK_OFS                                        ( 1)                  /* UCTXBRK Offset */
#define UCTXBRK                                            (0x0002)              /* Transmit break */
/* UCA0CTLW0[UCTXADDR] Bits */
#define UCTXADDR_OFS                                       ( 2)                  /* UCTXADDR Offset */
#define UCTXADDR                                           (0x0004)              /* Transmit address */
/* UCA0CTLW0[UCDORM] Bits */
#define UCDORM_OFS                                         ( 3)                  /* UCDORM Offset */
#define UCDORM                                             (0x0008)              /* Dormant */
/* UCA0CTLW0[UCBRKIE] Bits */
#define UCBRKIE_OFS                                        ( 4)                  /* UCBRKIE Offset */
#define UCBRKIE                                            (0x0010)              /* Receive break character interrupt enable */
/* UCA0CTLW0[UCRXEIE] Bits */
#define UCRXEIE_OFS                                        ( 5)                  /* UCRXEIE Offset */
#define UCRXEIE                                            (0x0020)              /* Receive erroneous-character interrupt enable */
/* UCA0CTLW0[UCSSEL] Bits */
#define UCSSEL_OFS                                         ( 6)                  /* UCSSEL Offset */
#define UCSSEL_M                                           (0x00c0)              /* eUSCI_A clock source select */
#define UCSSEL0                                            (0x0040)              /* eUSCI_A clock source select */
#define UCSSEL1                                            (0x0080)              /* eUSCI_A clock source select */
#define UCSSEL_0                                           (0x0000)              /* UCLK */
#define UCSSEL_1                                           (0x0040)              /* ACLK */
#define UCSSEL_2                                           (0x0080)              /* SMCLK */
#define UCSSEL__UCLK                                       (0x0000)              /* UCLK */
#define UCSSEL__ACLK                                       (0x0040)              /* ACLK */
#define UCSSEL__SMCLK                                      (0x0080)              /* SMCLK */
/* UCA0CTLW0[UCSYNC] Bits */
#define UCSYNC_OFS                                         ( 8)                  /* UCSYNC Offset */
#define UCSYNC                                             (0x0100)              /* Synchronous mode enable */
/* UCA0CTLW0[UCMODE] Bits */
#define UCMODE_OFS                                         ( 9)                  /* UCMODE Offset */
#define UCMODE_M                                           (0x0600)              /* eUSCI_A mode */
#define UCMODE0                                            (0x0200)              /* eUSCI_A mode */
#define UCMODE1                                            (0x0400)              /* eUSCI_A mode */
#define UCMODE_0                                           (0x0000)              /* UART mode */
#define UCMODE_1                                           (0x0200)              /* Idle-line multiprocessor mode */
#define UCMODE_2                                           (0x0400)              /* Address-bit multiprocessor mode */
#define UCMODE_3                                           (0x0600)              /* UART mode with automatic baud-rate detection */
/* UCA0CTLW0[UCSPB] Bits */
#define UCSPB_OFS                                          (11)                  /* UCSPB Offset */
#define UCSPB                                              (0x0800)              /* Stop bit select */
/* UCA0CTLW0[UC7BIT] Bits */
#define UC7BIT_OFS                                         (12)                  /* UC7BIT Offset */
#define UC7BIT                                             (0x1000)              /* Character length */
/* UCA0CTLW0[UCMSB] Bits */
#define UCMSB_OFS                                          (13)                  /* UCMSB Offset */
#define UCMSB                                              (0x2000)              /* MSB first select */
/* UCA0CTLW0[UCPAR] Bits */
#define UCPAR_OFS                                          (14)                  /* UCPAR Offset */
#define UCPAR                                              (0x4000)              /* Parity select */
/* UCA0CTLW0[UCPEN] Bits */
#define UCPEN_OFS                                          (15)                  /* UCPEN Offset */
#define UCPEN                                              (0x8000)              /* Parity enable */
/* UCA0CTLW0_SPI[UCSWRST] Bits */
//#define UCSWRST_OFS                                        ( 0)                  /* UCSWRST Offset */
//#define UCSWRST                                            (0x0001)              /* Software reset enable */
/* UCA0CTLW0_SPI[UCSTEM] Bits */
#define UCSTEM_OFS                                         ( 1)                  /* UCSTEM Offset */
#define UCSTEM                                             (0x0002)              /* STE mode select in master mode. */
/* UCA0CTLW0_SPI[UCSSEL] Bits */
//#define UCSSEL_OFS                                         ( 6)                  /* UCSSEL Offset */
//#define UCSSEL_M                                           (0x00c0)              /* eUSCI_A clock source select */
//#define UCSSEL0                                            (0x0040)              /* eUSCI_A clock source select */
//#define UCSSEL1                                            (0x0080)              /* eUSCI_A clock source select */
//#define UCSSEL_1                                           (0x0040)              /* ACLK */
//#define UCSSEL_2                                           (0x0080)              /* SMCLK */
//#define UCSSEL_0                                           (0x0000)              /* Reserved */
//#define UCSSEL__ACLK                                       (0x0040)              /* ACLK */
//#define UCSSEL__SMCLK                                      (0x0080)              /* SMCLK */
/* UCA0CTLW0_SPI[UCSYNC] Bits */
//#define UCSYNC_OFS                                         ( 8)                  /* UCSYNC Offset */
//#define UCSYNC                                             (0x0100)              /* Synchronous mode enable */
/* UCA0CTLW0_SPI[UCMODE] Bits */
//#define UCMODE_OFS                                         ( 9)                  /* UCMODE Offset */
//#define UCMODE_M                                           (0x0600)              /* eUSCI mode */
//#define UCMODE0                                            (0x0200)              /* eUSCI mode */
//#define UCMODE1                                            (0x0400)              /* eUSCI mode */
//#define UCMODE_0                                           (0x0000)              /* 3-pin SPI */
//#define UCMODE_1                                           (0x0200)              /* 4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1 */
//#define UCMODE_2                                           (0x0400)              /* 4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0 */
/* UCA0CTLW0_SPI[UCMST] Bits */
#define UCMST_OFS                                          (11)                  /* UCMST Offset */
#define UCMST                                              (0x0800)              /* Master mode select */
/* UCA0CTLW0_SPI[UC7BIT] Bits */
//#define UC7BIT_OFS                                         (12)                  /* UC7BIT Offset */
//#define UC7BIT                                             (0x1000)              /* Character length */
/* UCA0CTLW0_SPI[UCMSB] Bits */
//#define UCMSB_OFS                                          (13)                  /* UCMSB Offset */
//#define UCMSB                                              (0x2000)              /* MSB first select */
/* UCA0CTLW0_SPI[UCCKPL] Bits */
#define UCCKPL_OFS                                         (14)                  /* UCCKPL Offset */
#define UCCKPL                                             (0x4000)              /* Clock polarity select */
/* UCA0CTLW0_SPI[UCCKPH] Bits */
#define UCCKPH_OFS                                         (15)                  /* UCCKPH Offset */
#define UCCKPH                                             (0x8000)              /* Clock phase select */
/* UCA0CTLW1[UCGLIT] Bits */
#define UCGLIT_OFS                                         ( 0)                  /* UCGLIT Offset */
#define UCGLIT_M                                           (0x0003)              /* Deglitch time */
#define UCGLIT0                                            (0x0001)              /* Deglitch time */
#define UCGLIT1                                            (0x0002)              /* Deglitch time */
#define UCGLIT_0                                           (0x0000)              /* Approximately 2 ns (equivalent of 1 delay element) */
#define UCGLIT_1                                           (0x0001)              /* Approximately 50 ns */
#define UCGLIT_2                                           (0x0002)              /* Approximately 100 ns */
#define UCGLIT_3                                           (0x0003)              /* Approximately 200 ns */
/* UCA0MCTLW[UCOS16] Bits */
#define UCOS16_OFS                                         ( 0)                  /* UCOS16 Offset */
#define UCOS16                                             (0x0001)              /* Oversampling mode enabled */
/* UCA0MCTLW[UCBRF] Bits */
#define UCBRF_OFS                                          ( 4)                  /* UCBRF Offset */
#define UCBRF_M                                            (0x00f0)              /* First modulation stage select */
/* UCA0MCTLW[UCBRS] Bits */
#define UCBRS_OFS                                          ( 8)                  /* UCBRS Offset */
#define UCBRS_M                                            (0xff00)              /* Second modulation stage select */
/* UCA0STATW[UCBUSY] Bits */
#define UCBUSY_OFS                                         ( 0)                  /* UCBUSY Offset */
#define UCBUSY                                             (0x0001)              /* eUSCI_A busy */
/* UCA0STATW[UCADDR_UCIDLE] Bits */
#define UCADDR_UCIDLE_OFS                                  ( 1)                  /* UCADDR_UCIDLE Offset */
#define UCADDR_UCIDLE                                      (0x0002)              /* Address received / Idle line detected */
/* UCA0STATW[UCRXERR] Bits */
#define UCRXERR_OFS                                        ( 2)                  /* UCRXERR Offset */
#define UCRXERR                                            (0x0004)              /* Receive error flag */
/* UCA0STATW[UCBRK] Bits */
#define UCBRK_OFS                                          ( 3)                  /* UCBRK Offset */
#define UCBRK                                              (0x0008)              /* Break detect flag */
/* UCA0STATW[UCPE] Bits */
#define UCPE_OFS                                           ( 4)                  /* UCPE Offset */
#define UCPE                                               (0x0010)              /*  */
/* UCA0STATW[UCOE] Bits */
#define UCOE_OFS                                           ( 5)                  /* UCOE Offset */
#define UCOE                                               (0x0020)              /* Overrun error flag */
/* UCA0STATW[UCFE] Bits */
#define UCFE_OFS                                           ( 6)                  /* UCFE Offset */
#define UCFE                                               (0x0040)              /* Framing error flag */
/* UCA0STATW[UCLISTEN] Bits */
#define UCLISTEN_OFS                                       ( 7)                  /* UCLISTEN Offset */
#define UCLISTEN                                           (0x0080)              /* Listen enable */
/* UCA0STATW_SPI[UCBUSY] Bits */
//#define UCBUSY_OFS                                         ( 0)                  /* UCBUSY Offset */
//#define UCBUSY                                             (0x0001)              /* eUSCI_A busy */
/* UCA0STATW_SPI[UCOE] Bits */
//#define UCOE_OFS                                           ( 5)                  /* UCOE Offset */
//#define UCOE                                               (0x0020)              /* Overrun error flag */
/* UCA0STATW_SPI[UCFE] Bits */
//#define UCFE_OFS                                           ( 6)                  /* UCFE Offset */
//#define UCFE                                               (0x0040)              /* Framing error flag */
/* UCA0STATW_SPI[UCLISTEN] Bits */
//#define UCLISTEN_OFS                                       ( 7)                  /* UCLISTEN Offset */
//#define UCLISTEN                                           (0x0080)              /* Listen enable */
/* UCA0RXBUF[UCRXBUF] Bits */
#define UCRXBUF_OFS                                        ( 0)                  /* UCRXBUF Offset */
#define UCRXBUF_M                                          (0x00ff)              /* Receive data buffer */
/* UCA0RXBUF_SPI[UCRXBUF] Bits */
//#define UCRXBUF_OFS                                        ( 0)                  /* UCRXBUF Offset */
//#define UCRXBUF_M                                          (0x00ff)              /* Receive data buffer */
/* UCA0TXBUF[UCTXBUF] Bits */
#define UCTXBUF_OFS                                        ( 0)                  /* UCTXBUF Offset */
#define UCTXBUF_M                                          (0x00ff)              /* Transmit data buffer */
/* UCA0TXBUF_SPI[UCTXBUF] Bits */
//#define UCTXBUF_OFS                                        ( 0)                  /* UCTXBUF Offset */
//#define UCTXBUF_M                                          (0x00ff)              /* Transmit data buffer */
/* UCA0ABCTL[UCABDEN] Bits */
#define UCABDEN_OFS                                        ( 0)                  /* UCABDEN Offset */
#define UCABDEN                                            (0x0001)              /* Automatic baud-rate detect enable */
/* UCA0ABCTL[UCBTOE] Bits */
#define UCBTOE_OFS                                         ( 2)                  /* UCBTOE Offset */
#define UCBTOE                                             (0x0004)              /* Break time out error */
/* UCA0ABCTL[UCSTOE] Bits */
#define UCSTOE_OFS                                         ( 3)                  /* UCSTOE Offset */
#define UCSTOE                                             (0x0008)              /* Synch field time out error */
/* UCA0ABCTL[UCDELIM] Bits */
#define UCDELIM_OFS                                        ( 4)                  /* UCDELIM Offset */
#define UCDELIM_M                                          (0x0030)              /* Break/synch delimiter length */
#define UCDELIM0                                           (0x0010)              /* Break/synch delimiter length */
#define UCDELIM1                                           (0x0020)              /* Break/synch delimiter length */
#define UCDELIM_0                                          (0x0000)              /* 1 bit time */
#define UCDELIM_1                                          (0x0010)              /* 2 bit times */
#define UCDELIM_2                                          (0x0020)              /* 3 bit times */
#define UCDELIM_3                                          (0x0030)              /* 4 bit times */
/* UCA0IRCTL[UCIREN] Bits */
#define UCIREN_OFS                                         ( 0)                  /* UCIREN Offset */
#define UCIREN                                             (0x0001)              /* IrDA encoder/decoder enable */
/* UCA0IRCTL[UCIRTXCLK] Bits */
#define UCIRTXCLK_OFS                                      ( 1)                  /* UCIRTXCLK Offset */
#define UCIRTXCLK                                          (0x0002)              /* IrDA transmit pulse clock select */
/* UCA0IRCTL[UCIRTXPL] Bits */
#define UCIRTXPL_OFS                                       ( 2)                  /* UCIRTXPL Offset */
#define UCIRTXPL_M                                         (0x00fc)              /* Transmit pulse length */
/* UCA0IRCTL[UCIRRXFE] Bits */
#define UCIRRXFE_OFS                                       ( 8)                  /* UCIRRXFE Offset */
#define UCIRRXFE                                           (0x0100)              /* IrDA receive filter enabled */
/* UCA0IRCTL[UCIRRXPL] Bits */
#define UCIRRXPL_OFS                                       ( 9)                  /* UCIRRXPL Offset */
#define UCIRRXPL                                           (0x0200)              /* IrDA receive input UCAxRXD polarity */
/* UCA0IRCTL[UCIRRXFL] Bits */
#define UCIRRXFL_OFS                                       (10)                  /* UCIRRXFL Offset */
#define UCIRRXFL_M                                         (0x3c00)              /* Receive filter length */
/* UCA0IE[UCRXIE] Bits */
#define UCRXIE_OFS                                         ( 0)                  /* UCRXIE Offset */
#define UCRXIE                                             (0x0001)              /* Receive interrupt enable */
/* UCA0IE[UCTXIE] Bits */
#define UCTXIE_OFS                                         ( 1)                  /* UCTXIE Offset */
#define UCTXIE                                             (0x0002)              /* Transmit interrupt enable */
/* UCA0IE[UCSTTIE] Bits */
#define UCSTTIE_OFS                                        ( 2)                  /* UCSTTIE Offset */
#define UCSTTIE                                            (0x0004)              /* Start bit interrupt enable */
/* UCA0IE[UCTXCPTIE] Bits */
#define UCTXCPTIE_OFS                                      ( 3)                  /* UCTXCPTIE Offset */
#define UCTXCPTIE                                          (0x0008)              /* Transmit complete interrupt enable */
/* UCA0IE_SPI[UCRXIE] Bits */
//#define UCRXIE_OFS                                         ( 0)                  /* UCRXIE Offset */
//#define UCRXIE                                             (0x0001)              /* Receive interrupt enable */
/* UCA0IE_SPI[UCTXIE] Bits */
//#define UCTXIE_OFS                                         ( 1)                  /* UCTXIE Offset */
//#define UCTXIE                                             (0x0002)              /* Transmit interrupt enable */
/* UCA0IFG[UCRXIFG] Bits */
#define UCRXIFG_OFS                                        ( 0)                  /* UCRXIFG Offset */
#define UCRXIFG                                            (0x0001)              /* Receive interrupt flag */
/* UCA0IFG[UCTXIFG] Bits */
#define UCTXIFG_OFS                                        ( 1)                  /* UCTXIFG Offset */
#define UCTXIFG                                            (0x0002)              /* Transmit interrupt flag */
/* UCA0IFG[UCSTTIFG] Bits */
#define UCSTTIFG_OFS                                       ( 2)                  /* UCSTTIFG Offset */
#define UCSTTIFG                                           (0x0004)              /* Start bit interrupt flag */
/* UCA0IFG[UCTXCPTIFG] Bits */
#define UCTXCPTIFG_OFS                                     ( 3)                  /* UCTXCPTIFG Offset */
#define UCTXCPTIFG                                         (0x0008)              /* Transmit ready interrupt enable */
/* UCA0IFG_SPI[UCRXIFG] Bits */
//#define UCRXIFG_OFS                                        ( 0)                  /* UCRXIFG Offset */
