helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
//#define UCNACKIE                                           (0x0020)              /* Not-acknowledge interrupt enable */
/* UCB3IE[UCBCNTIE] Bits */
//#define UCBCNTIE_OFS                                       ( 6)                  /* UCBCNTIE Offset */
//#define UCBCNTIE                                           (0x0040)              /* Byte counter interrupt enable */
/* UCB3IE[UCCLTOIE] Bits */
//#define UCCLTOIE_OFS                                       ( 7)                  /* UCCLTOIE Offset */
//#define UCCLTOIE                                           (0x0080)              /* Clock low timeout interrupt enable */
/* UCB3IE[UCRXIE1] Bits */
//#define UCRXIE1_OFS                                        ( 8)                  /* UCRXIE1 Offset */
//#define UCRXIE1                                            (0x0100)              /* Receive interrupt enable 1 */
/* UCB3IE[UCTXIE1] Bits */
//#define UCTXIE1_OFS                                        ( 9)                  /* UCTXIE1 Offset */
//#define UCTXIE1                                            (0x0200)              /* Transmit interrupt enable 1 */
/* UCB3IE[UCRXIE2] Bits */
//#define UCRXIE2_OFS                                        (10)                  /* UCRXIE2 Offset */
//#define UCRXIE2                                            (0x0400)              /* Receive interrupt enable 2 */
/* UCB3IE[UCTXIE2] Bits */
//#define UCTXIE2_OFS                                        (11)                  /* UCTXIE2 Offset */
//#define UCTXIE2                                            (0x0800)              /* Transmit interrupt enable 2 */
/* UCB3IE[UCRXIE3] Bits */
//#define UCRXIE3_OFS                                        (12)                  /* UCRXIE3 Offset */
//#define UCRXIE3                                            (0x1000)              /* Receive interrupt enable 3 */
/* UCB3IE[UCTXIE3] Bits */
//#define UCTXIE3_OFS                                        (13)                  /* UCTXIE3 Offset */
//#define UCTXIE3                                            (0x2000)              /* Transmit interrupt enable 3 */
/* UCB3IE[UCBIT9IE] Bits */
//#define UCBIT9IE_OFS                                       (14)                  /* UCBIT9IE Offset */
//#define UCBIT9IE                                           (0x4000)              /* Bit position 9 interrupt enable */
/* UCB3IE_SPI[UCRXIE] Bits */
//#define UCRXIE_OFS                                         ( 0)                  /* UCRXIE Offset */
//#define UCRXIE                                             (0x0001)              /* Receive interrupt enable */
/* UCB3IE_SPI[UCTXIE] Bits */
//#define UCTXIE_OFS                                         ( 1)                  /* UCTXIE Offset */
//#define UCTXIE                                             (0x0002)              /* Transmit interrupt enable */
/* UCB3IFG[UCRXIFG0] Bits */
//#define UCRXIFG0_OFS                                       ( 0)                  /* UCRXIFG0 Offset */
//#define UCRXIFG0                                           (0x0001)              /* eUSCI_B receive interrupt flag 0 */
/* UCB3IFG[UCTXIFG0] Bits */
//#define UCTXIFG0_OFS                                       ( 1)                  /* UCTXIFG0 Offset */
//#define UCTXIFG0                                           (0x0002)              /* eUSCI_B transmit interrupt flag 0 */
/* UCB3IFG[UCSTTIFG] Bits */
//#define UCSTTIFG_OFS                                       ( 2)                  /* UCSTTIFG Offset */
//#define UCSTTIFG                                           (0x0004)              /* START condition interrupt flag */
/* UCB3IFG[UCSTPIFG] Bits */
//#define UCSTPIFG_OFS                                       ( 3)                  /* UCSTPIFG Offset */
//#define UCSTPIFG                                           (0x0008)              /* STOP condition interrupt flag */
/* UCB3IFG[UCALIFG] Bits */
//#define UCALIFG_OFS                                        ( 4)                  /* UCALIFG Offset */
//#define UCALIFG                                            (0x0010)              /* Arbitration lost interrupt flag */
/* UCB3IFG[UCNACKIFG] Bits */
//#define UCNACKIFG_OFS                                      ( 5)                  /* UCNACKIFG Offset */
//#define UCNACKIFG                                          (0x0020)              /* Not-acknowledge received interrupt flag */
/* UCB3IFG[UCBCNTIFG] Bits */
//#define UCBCNTIFG_OFS                                      ( 6)                  /* UCBCNTIFG Offset */
//#define UCBCNTIFG                                          (0x0040)              /* Byte counter interrupt flag */
/* UCB3IFG[UCCLTOIFG] Bits */
//#define UCCLTOIFG_OFS                                      ( 7)                  /* UCCLTOIFG Offset */
//#define UCCLTOIFG                                          (0x0080)              /* Clock low timeout interrupt flag */
/* UCB3IFG[UCRXIFG1] Bits */
//#define UCRXIFG1_OFS                                       ( 8)                  /* UCRXIFG1 Offset */
//#define UCRXIFG1                                           (0x0100)              /* eUSCI_B receive interrupt flag 1 */
/* UCB3IFG[UCTXIFG1] Bits */
//#define UCTXIFG1_OFS                                       ( 9)                  /* UCTXIFG1 Offset */
//#define UCTXIFG1                                           (0x0200)              /* eUSCI_B transmit interrupt flag 1 */
/* UCB3IFG[UCRXIFG2] Bits */
//#define UCRXIFG2_OFS                                       (10)                  /* UCRXIFG2 Offset */
//#define UCRXIFG2                                           (0x0400)              /* eUSCI_B receive interrupt flag 2 */
/* UCB3IFG[UCTXIFG2] Bits */
//#define UCTXIFG2_OFS                                       (11)                  /* UCTXIFG2 Offset */
//#define UCTXIFG2                                           (0x0800)              /* eUSCI_B transmit interrupt flag 2 */
/* UCB3IFG[UCRXIFG3] Bits */
//#define UCRXIFG3_OFS                                       (12)                  /* UCRXIFG3 Offset */
//#define UCRXIFG3                                           (0x1000)              /* eUSCI_B receive interrupt flag 3 */
/* UCB3IFG[UCTXIFG3] Bits */
//#define UCTXIFG3_OFS                                       (13)                  /* UCTXIFG3 Offset */
//#define UCTXIFG3                                           (0x2000)              /* eUSCI_B transmit interrupt flag 3 */
/* UCB3IFG[UCBIT9IFG] Bits */
//#define UCBIT9IFG_OFS                                      (14)                  /* UCBIT9IFG Offset */
//#define UCBIT9IFG                                          (0x4000)              /* Bit position 9 interrupt flag */
/* UCB3IFG_SPI[UCRXIFG] Bits */
//#define UCRXIFG_OFS                                        ( 0)                  /* UCRXIFG Offset */
//#define UCRXIFG                                            (0x0001)              /* Receive interrupt flag */
/* UCB3IFG_SPI[UCTXIFG] Bits */
//#define UCTXIFG_OFS                                        ( 1)                  /* UCTXIFG Offset */
//#define UCTXIFG                                            (0x0002)              /* Transmit interrupt flag */


