helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// FLCTL Bits
/***************************************************************************
/* FLCTL_POWER_STAT[FLCTL_POWER_STAT_PSTAT] Bits */
#define FLCTL_POWER_STAT_PSTAT_OFS                         ( 0)                  /* PSTAT Offset */
#define FLCTL_POWER_STAT_PSTAT_M                           (0x00000007)          /*  */
#define FLCTL_POWER_STAT_PSTAT0                            (0x00000001)          /*  */
#define FLCTL_POWER_STAT_PSTAT1                            (0x00000002)          /*  */
#define FLCTL_POWER_STAT_PSTAT2                            (0x00000004)          /*  */
#define FLCTL_POWER_STAT_PSTAT_0                           (0x00000000)          /* Flash IP in power-down mode */
#define FLCTL_POWER_STAT_PSTAT_1                           (0x00000001)          /* Flash IP Vdd domain power-up in progress */
#define FLCTL_POWER_STAT_PSTAT_2                           (0x00000002)          /* PSS LDO_GOOD, IREF_OK and VREF_OK check in progress */
#define FLCTL_POWER_STAT_PSTAT_3                           (0x00000003)          /* Flash IP SAFE_LV check in progress */
#define FLCTL_POWER_STAT_PSTAT_4                           (0x00000004)          /* Flash IP Active */
#define FLCTL_POWER_STAT_PSTAT_5                           (0x00000005)          /* Flash IP Active in Low-Frequency Active and Low-Frequency LPM0 modes. */
#define FLCTL_POWER_STAT_PSTAT_6                           (0x00000006)          /* Flash IP in Standby mode */
#define FLCTL_POWER_STAT_PSTAT_7                           (0x00000007)          /* Flash IP in Current mirror boost state */
/* FLCTL_POWER_STAT[FLCTL_POWER_STAT_LDOSTAT] Bits */
#define FLCTL_POWER_STAT_LDOSTAT_OFS                       ( 3)                  /* LDOSTAT Offset */
#define FLCTL_POWER_STAT_LDOSTAT                           (0x00000008)          /* PSS FLDO GOOD status */
/* FLCTL_POWER_STAT[FLCTL_POWER_STAT_VREFSTAT] Bits */
#define FLCTL_POWER_STAT_VREFSTAT_OFS                      ( 4)                  /* VREFSTAT Offset */
#define FLCTL_POWER_STAT_VREFSTAT                          (0x00000010)          /* PSS VREF stable status */
/* FLCTL_POWER_STAT[FLCTL_POWER_STAT_IREFSTAT] Bits */
#define FLCTL_POWER_STAT_IREFSTAT_OFS                      ( 5)                  /* IREFSTAT Offset */
#define FLCTL_POWER_STAT_IREFSTAT                          (0x00000020)          /* PSS IREF stable status */
/* FLCTL_POWER_STAT[FLCTL_POWER_STAT_TRIMSTAT] Bits */
#define FLCTL_POWER_STAT_TRIMSTAT_OFS                      ( 6)                  /* TRIMSTAT Offset */
#define FLCTL_POWER_STAT_TRIMSTAT                          (0x00000040)          /* PSS trim done status */
/* FLCTL_POWER_STAT[FLCTL_POWER_STAT_RD_2T] Bits */
#define FLCTL_POWER_STAT_RD_2T_OFS                         ( 7)                  /* RD_2T Offset */
#define FLCTL_POWER_STAT_RD_2T                             (0x00000080)          /* Indicates if Flash is being accessed in 2T mode */
/* FLCTL_BANK0_RDCTL[FLCTL_BANK0_RDCTL_RD_MODE] Bits */
#define FLCTL_BANK0_RDCTL_RD_MODE_OFS                      ( 0)                  /* RD_MODE Offset */
#define FLCTL_BANK0_RDCTL_RD_MODE_M                        (0x0000000f)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK0_RDCTL_RD_MODE0                         (0x00000001)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK0_RDCTL_RD_MODE1                         (0x00000002)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK0_RDCTL_RD_MODE2                         (0x00000004)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK0_RDCTL_RD_MODE3                         (0x00000008)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK0_RDCTL_RD_MODE_0                        (0x00000000)          /* Normal read mode */
#define FLCTL_BANK0_RDCTL_RD_MODE_1                        (0x00000001)          /* Read Margin 0 */
#define FLCTL_BANK0_RDCTL_RD_MODE_2                        (0x00000002)          /* Read Margin 1 */
#define FLCTL_BANK0_RDCTL_RD_MODE_3                        (0x00000003)          /* Program Verify */
#define FLCTL_BANK0_RDCTL_RD_MODE_4                        (0x00000004)          /* Erase Verify */
#define FLCTL_BANK0_RDCTL_RD_MODE_5                        (0x00000005)          /* Leakage Verify */
#define FLCTL_BANK0_RDCTL_RD_MODE_9                        (0x00000009)          /* Read Margin 0B */
#define FLCTL_BANK0_RDCTL_RD_MODE_10                       (0x0000000a)          /* Read Margin 1B */
/* FLCTL_BANK0_RDCTL[FLCTL_BANK0_RDCTL_BUFI] Bits */
#define FLCTL_BANK0_RDCTL_BUFI_OFS                         ( 4)                  /* BUFI Offset */
#define FLCTL_BANK0_RDCTL_BUFI                             (0x00000010)          /* Enables read buffering feature for instruction fetches to this Bank */
/* FLCTL_BANK0_RDCTL[FLCTL_BANK0_RDCTL_BUFD] Bits */
#define FLCTL_BANK0_RDCTL_BUFD_OFS                         ( 5)                  /* BUFD Offset */
#define FLCTL_BANK0_RDCTL_BUFD                             (0x00000020)          /* Enables read buffering feature for data reads to this Bank */
/* FLCTL_BANK0_RDCTL[FLCTL_BANK0_RDCTL_WAIT] Bits */
#define FLCTL_BANK0_RDCTL_WAIT_OFS                         (12)                  /* WAIT Offset */
#define FLCTL_BANK0_RDCTL_WAIT_M                           (0x0000f000)          /* Number of wait states for read */
#define FLCTL_BANK0_RDCTL_WAIT0                            (0x00001000)          /* Number of wait states for read */
#define FLCTL_BANK0_RDCTL_WAIT1                            (0x00002000)          /* Number of wait states for read */
#define FLCTL_BANK0_RDCTL_WAIT2                            (0x00004000)          /* Number of wait states for read */
#define FLCTL_BANK0_RDCTL_WAIT3                            (0x00008000)          /* Number of wait states for read */
#define FLCTL_BANK0_RDCTL_WAIT_0                           (0x00000000)          /* 0 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_1                           (0x00001000)          /* 1 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_2                           (0x00002000)          /* 2 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_3                           (0x00003000)          /* 3 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_4                           (0x00004000)          /* 4 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_5                           (0x00005000)          /* 5 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_6                           (0x00006000)          /* 6 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_7                           (0x00007000)          /* 7 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_8                           (0x00008000)          /* 8 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_9                           (0x00009000)          /* 9 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_10                          (0x0000a000)          /* 10 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_11                          (0x0000b000)          /* 11 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_12                          (0x0000c000)          /* 12 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_13                          (0x0000d000)          /* 13 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_14                          (0x0000e000)          /* 14 wait states */
#define FLCTL_BANK0_RDCTL_WAIT_15                          (0x0000f000)          /* 15 wait states */
/* FLCTL_BANK0_RDCTL[FLCTL_BANK0_RDCTL_RD_MODE_STATUS] Bits */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_OFS               (16)                  /* RD_MODE_STATUS Offset */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_M                 (0x000f0000)          /* Read mode */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS0                  (0x00010000)          /* Read mode */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS1                  (0x00020000)          /* Read mode */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS2                  (0x00040000)          /* Read mode */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS3                  (0x00080000)          /* Read mode */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_0                 (0x00000000)          /* Normal read mode */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_1                 (0x00010000)          /* Read Margin 0 */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_2                 (0x00020000)          /* Read Margin 1 */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_3                 (0x00030000)          /* Program Verify */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_4                 (0x00040000)          /* Erase Verify */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_5                 (0x00050000)          /* Leakage Verify */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_9                 (0x00090000)          /* Read Margin 0B */
#define FLCTL_BANK0_RDCTL_RD_MODE_STATUS_10                (0x000a0000)          /* Read Margin 1B */
/* FLCTL_BANK1_RDCTL[FLCTL_BANK1_RDCTL_RD_MODE] Bits */
#define FLCTL_BANK1_RDCTL_RD_MODE_OFS                      ( 0)                  /* RD_MODE Offset */
#define FLCTL_BANK1_RDCTL_RD_MODE_M                        (0x0000000f)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK1_RDCTL_RD_MODE0                         (0x00000001)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK1_RDCTL_RD_MODE1                         (0x00000002)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK1_RDCTL_RD_MODE2                         (0x00000004)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK1_RDCTL_RD_MODE3                         (0x00000008)          /* Flash read mode control setting for Bank 0 */
#define FLCTL_BANK1_RDCTL_RD_MODE_0                        (0x00000000)          /* Normal read mode */
#define FLCTL_BANK1_RDCTL_RD_MODE_1                        (0x00000001)          /* Read Margin 0 */
#define FLCTL_BANK1_RDCTL_RD_MODE_2                        (0x00000002)          /* Read Margin 1 */
#define FLCTL_BANK1_RDCTL_RD_MODE_3                        (0x00000003)          /* Program Verify */
#define FLCTL_BANK1_RDCTL_RD_MODE_4                        (0x00000004)          /* Erase Verify */
#define FLCTL_BANK1_RDCTL_RD_MODE_5                        (0x00000005)          /* Leakage Verify */
#define FLCTL_BANK1_RDCTL_RD_MODE_9                        (0x00000009)          /* Read Margin 0B */
#define FLCTL_BANK1_RDCTL_RD_MODE_10                       (0x0000000a)          /* Read Margin 1B */
/* FLCTL_BANK1_RDCTL[FLCTL_BANK1_RDCTL_BUFI] Bits */
#define FLCTL_BANK1_RDCTL_BUFI_OFS                         ( 4)                  /* BUFI Offset */
#define FLCTL_BANK1_RDCTL_BUFI                             (0x00000010)          /* Enables read buffering feature for instruction fetches to this Bank */
/* FLCTL_BANK1_RDCTL[FLCTL_BANK1_RDCTL_BUFD] Bits */
#define FLCTL_BANK1_RDCTL_BUFD_OFS                         ( 5)                  /* BUFD Offset */
#define FLCTL_BANK1_RDCTL_BUFD                             (0x00000020)          /* Enables read buffering feature for data reads to this Bank */
/* FLCTL_BANK1_RDCTL[FLCTL_BANK1_RDCTL_RD_MODE_STATUS] Bits */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_OFS               (16)                  /* RD_MODE_STATUS Offset */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_M                 (0x000f0000)          /* Read mode */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS0                  (0x00010000)          /* Read mode */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS1                  (0x00020000)          /* Read mode */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS2                  (0x00040000)          /* Read mode */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS3                  (0x00080000)          /* Read mode */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_0                 (0x00000000)          /* Normal read mode */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_1                 (0x00010000)          /* Read Margin 0 */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_2                 (0x00020000)          /* Read Margin 1 */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_3                 (0x00030000)          /* Program Verify */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_4                 (0x00040000)          /* Erase Verify */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_5                 (0x00050000)          /* Leakage Verify */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_9                 (0x00090000)          /* Read Margin 0B */
#define FLCTL_BANK1_RDCTL_RD_MODE_STATUS_10                (0x000a0000)          /* Read Margin 1B */
/* FLCTL_BANK1_RDCTL[FLCTL_BANK1_RDCTL_WAIT] Bits */
#define FLCTL_BANK1_RDCTL_WAIT_OFS                         (12)                  /* WAIT Offset */
#define FLCTL_BANK1_RDCTL_WAIT_M                           (0x0000f000)          /* Number of wait states for read */
#define FLCTL_BANK1_RDCTL_WAIT0                            (0x00001000)          /* Number of wait states for read */
#define FLCTL_BANK1_RDCTL_WAIT1                            (0x00002000)          /* Number of wait states for read */
#define FLCTL_BANK1_RDCTL_WAIT2                            (0x00004000)          /* Number of wait states for read */
#define FLCTL_BANK1_RDCTL_WAIT3                            (0x00008000)          /* Number of wait states for read */
#define FLCTL_BANK1_RDCTL_WAIT_0                           (0x00000000)          /* 0 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_1                           (0x00001000)          /* 1 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_2                           (0x00002000)          /* 2 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_3                           (0x00003000)          /* 3 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_4                           (0x00004000)          /* 4 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_5                           (0x00005000)          /* 5 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_6                           (0x00006000)          /* 6 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_7                           (0x00007000)          /* 7 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_8                           (0x00008000)          /* 8 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_9                           (0x00009000)          /* 9 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_10                          (0x0000a000)          /* 10 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_11                          (0x0000b000)          /* 11 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_12                          (0x0000c000)          /* 12 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_13                          (0x0000d000)          /* 13 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_14                          (0x0000e000)          /* 14 wait states */
#define FLCTL_BANK1_RDCTL_WAIT_15                          (0x0000f000)          /* 15 wait states */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_START] Bits */
#define FLCTL_RDBRST_CTLSTAT_START_OFS                     ( 0)                  /* START Offset */
#define FLCTL_RDBRST_CTLSTAT_START                         (0x00000001)          /* Start of burst/compare operation */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_MEM_TYPE] Bits */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE_OFS                  ( 1)                  /* MEM_TYPE Offset */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE_M                    (0x00000006)          /* Type of memory that burst is carried out on */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE0                     (0x00000002)          /* Type of memory that burst is carried out on */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE1                     (0x00000004)          /* Type of memory that burst is carried out on */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE_0                    (0x00000000)          /* Main Memory */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE_1                    (0x00000002)          /* Information Memory */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE_2                    (0x00000004)          /* Reserved */
#define FLCTL_RDBRST_CTLSTAT_MEM_TYPE_3                    (0x00000006)          /* Engineering Memory */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_STOP_FAIL] Bits */
#define FLCTL_RDBRST_CTLSTAT_STOP_FAIL_OFS                 ( 3)                  /* STOP_FAIL Offset */
#define FLCTL_RDBRST_CTLSTAT_STOP_FAIL                     (0x00000008)          /* Terminate burst/compare operation */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_DATA_CMP] Bits */
#define FLCTL_RDBRST_CTLSTAT_DATA_CMP_OFS                  ( 4)                  /* DATA_CMP Offset */
#define FLCTL_RDBRST_CTLSTAT_DATA_CMP                      (0x00000010)          /* Data pattern used for comparison against memory read data */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_TEST_EN] Bits */
#define FLCTL_RDBRST_CTLSTAT_TEST_EN_OFS                   ( 6)                  /* TEST_EN Offset */
#define FLCTL_RDBRST_CTLSTAT_TEST_EN                       (0x00000040)          /* Enable comparison against test data compare registers */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_BRST_STAT] Bits */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT_OFS                 (16)                  /* BRST_STAT Offset */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT_M                   (0x00030000)          /* Status of Burst/Compare operation */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT0                    (0x00010000)          /* Status of Burst/Compare operation */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT1                    (0x00020000)          /* Status of Burst/Compare operation */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT_0                   (0x00000000)          /* Idle */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT_1                   (0x00010000)          /* Burst/Compare START bit written, but operation pending */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT_2                   (0x00020000)          /* Burst/Compare in progress */
#define FLCTL_RDBRST_CTLSTAT_BRST_STAT_3                   (0x00030000)          /* Burst complete (status of completed burst remains in this state unless explicitly cleared by SW) */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_CMP_ERR] Bits */
#define FLCTL_RDBRST_CTLSTAT_CMP_ERR_OFS                   (18)                  /* CMP_ERR Offset */
#define FLCTL_RDBRST_CTLSTAT_CMP_ERR                       (0x00040000)          /* Burst/Compare Operation encountered atleast one data */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_ADDR_ERR] Bits */
#define FLCTL_RDBRST_CTLSTAT_ADDR_ERR_OFS                  (19)                  /* ADDR_ERR Offset */
#define FLCTL_RDBRST_CTLSTAT_ADDR_ERR                      (0x00080000)          /* Burst/Compare Operation was terminated due to access to */
/* FLCTL_RDBRST_CTLSTAT[FLCTL_RDBRST_CTLSTAT_CLR_STAT] Bits */
#define FLCTL_RDBRST_CTLSTAT_CLR_STAT_OFS                  (23)                  /* CLR_STAT Offset */
#define FLCTL_RDBRST_CTLSTAT_CLR_STAT                      (0x00800000)          /* Clear status bits 19-16 of this register */
/* FLCTL_RDBRST_STARTADDR[FLCTL_RDBRST_STARTADDR_START_ADDRESS] Bits */
#define FLCTL_RDBRST_STARTADDR_START_ADDRESS_OFS           ( 0)                  /* START_ADDRESS Offset */
#define FLCTL_RDBRST_STARTADDR_START_ADDRESS_M             (0x001fffff)          /* Start Address of Burst Operation */
/* FLCTL_RDBRST_LEN[FLCTL_RDBRST_LEN_BURST_LENGTH] Bits */
#define FLCTL_RDBRST_LEN_BURST_LENGTH_OFS                  ( 0)                  /* BURST_LENGTH Offset */
#define FLCTL_RDBRST_LEN_BURST_LENGTH_M                    (0x001fffff)          /* Length of Burst Operation */
/* FLCTL_RDBRST_FAILADDR[FLCTL_RDBRST_FAILADDR_FAIL_ADDRESS] Bits */
#define FLCTL_RDBRST_FAILADDR_FAIL_ADDRESS_OFS             ( 0)                  /* FAIL_ADDRESS Offset */
#define FLCTL_RDBRST_FAILADDR_FAIL_ADDRESS_M               (0x001fffff)          /* Reflects address of last failed compare */
/* FLCTL_RDBRST_FAILCNT[FLCTL_RDBRST_FAILCNT_FAIL_COUNT] Bits */
#define FLCTL_RDBRST_FAILCNT_FAIL_COUNT_OFS                ( 0)                  /* FAIL_COUNT Offset */
#define FLCTL_RDBRST_FAILCNT_FAIL_COUNT_M                  (0x0001ffff)          /* Number of failures encountered in burst operation */
/* FLCTL_PRG_CTLSTAT[FLCTL_PRG_CTLSTAT_ENABLE] Bits */
#define FLCTL_PRG_CTLSTAT_ENABLE_OFS                       ( 0)                  /* ENABLE Offset */
#define FLCTL_PRG_CTLSTAT_ENABLE                           (0x00000001)          /* Master control for all word program operations */
/* FLCTL_PRG_CTLSTAT[FLCTL_PRG_CTLSTAT_MODE] Bits */
#define FLCTL_PRG_CTLSTAT_MODE_OFS                         ( 1)                  /* MODE Offset */
#define FLCTL_PRG_CTLSTAT_MODE                             (0x00000002)          /* Write mode */
/* FLCTL_PRG_CTLSTAT[FLCTL_PRG_CTLSTAT_VER_PRE] Bits */
#define FLCTL_PRG_CTLSTAT_VER_PRE_OFS                      ( 2)                  /* VER_PRE Offset */
#define FLCTL_PRG_CTLSTAT_VER_PRE                          (0x00000004)          /* Controls automatic pre program verify operations */
/* FLCTL_PRG_CTLSTAT[FLCTL_PRG_CTLSTAT_VER_PST] Bits */
#define FLCTL_PRG_CTLSTAT_VER_PST_OFS                      ( 3)                  /* VER_PST Offset */
#define FLCTL_PRG_CTLSTAT_VER_PST                          (0x00000008)          /* Controls automatic post program verify operations */
/* FLCTL_PRG_CTLSTAT[FLCTL_PRG_CTLSTAT_STATUS] Bits */
#define FLCTL_PRG_CTLSTAT_STATUS_OFS                       (16)                  /* STATUS Offset */
#define FLCTL_PRG_CTLSTAT_STATUS_M                         (0x00030000)          /* Status of program operations in the Flash memory */
#define FLCTL_PRG_CTLSTAT_STATUS0                          (0x00010000)          /* Status of program operations in the Flash memory */
#define FLCTL_PRG_CTLSTAT_STATUS1                          (0x00020000)          /* Status of program operations in the Flash memory */
#define FLCTL_PRG_CTLSTAT_STATUS_0                         (0x00000000)          /* Idle (no program operation currently active) */
#define FLCTL_PRG_CTLSTAT_STATUS_1                         (0x00010000)          /* Single word program operation triggered, but pending */
#define FLCTL_PRG_CTLSTAT_STATUS_2                         (0x00020000)          /* Single word program in progress */
#define FLCTL_PRG_CTLSTAT_STATUS_3                         (0x00030000)          /* Reserved (Idle) */
/* FLCTL_PRG_CTLSTAT[FLCTL_PRG_CTLSTAT_BNK_ACT] Bits */
#define FLCTL_PRG_CTLSTAT_BNK_ACT_OFS                      (18)                  /* BNK_ACT Offset */
#define FLCTL_PRG_CTLSTAT_BNK_ACT                          (0x00040000)          /* Bank active */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_START] Bits */
#define FLCTL_PRGBRST_CTLSTAT_START_OFS                    ( 0)                  /* START Offset */
#define FLCTL_PRGBRST_CTLSTAT_START                        (0x00000001)          /* Trigger start of burst program operation */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_TYPE] Bits */
#define FLCTL_PRGBRST_CTLSTAT_TYPE_OFS                     ( 1)                  /* TYPE Offset */
#define FLCTL_PRGBRST_CTLSTAT_TYPE_M                       (0x00000006)          /* Type of memory that burst program is carried out on */
#define FLCTL_PRGBRST_CTLSTAT_TYPE0                        (0x00000002)          /* Type of memory that burst program is carried out on */
