helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
#define FLCTL_PRGBRST_CTLSTAT_TYPE1                        (0x00000004)          /* Type of memory that burst program is carried out on */
#define FLCTL_PRGBRST_CTLSTAT_TYPE_0                       (0x00000000)          /* Main Memory */
#define FLCTL_PRGBRST_CTLSTAT_TYPE_1                       (0x00000002)          /* Information Memory */
#define FLCTL_PRGBRST_CTLSTAT_TYPE_2                       (0x00000004)          /* Reserved */
#define FLCTL_PRGBRST_CTLSTAT_TYPE_3                       (0x00000006)          /* Engineering Memory */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_LEN] Bits */
#define FLCTL_PRGBRST_CTLSTAT_LEN_OFS                      ( 3)                  /* LEN Offset */
#define FLCTL_PRGBRST_CTLSTAT_LEN_M                        (0x00000038)          /* Length of burst */
#define FLCTL_PRGBRST_CTLSTAT_LEN0                         (0x00000008)          /* Length of burst */
#define FLCTL_PRGBRST_CTLSTAT_LEN1                         (0x00000010)          /* Length of burst */
#define FLCTL_PRGBRST_CTLSTAT_LEN2                         (0x00000020)          /* Length of burst */
#define FLCTL_PRGBRST_CTLSTAT_LEN_0                        (0x00000000)          /* No burst operation */
#define FLCTL_PRGBRST_CTLSTAT_LEN_1                        (0x00000008)          /* 1 word burst of 128 bits, starting with address in the FLCTL_PRGBRST_STARTADDR Register */
#define FLCTL_PRGBRST_CTLSTAT_LEN_2                        (0x00000010)          /* 2*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register */
#define FLCTL_PRGBRST_CTLSTAT_LEN_3                        (0x00000018)          /* 3*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register */
#define FLCTL_PRGBRST_CTLSTAT_LEN_4                        (0x00000020)          /* 4*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_AUTO_PRE] Bits */
#define FLCTL_PRGBRST_CTLSTAT_AUTO_PRE_OFS                 ( 6)                  /* AUTO_PRE Offset */
#define FLCTL_PRGBRST_CTLSTAT_AUTO_PRE                     (0x00000040)          /* Auto-Verify operation before the Burst Program */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_AUTO_PST] Bits */
#define FLCTL_PRGBRST_CTLSTAT_AUTO_PST_OFS                 ( 7)                  /* AUTO_PST Offset */
#define FLCTL_PRGBRST_CTLSTAT_AUTO_PST                     (0x00000080)          /* Auto-Verify operation after the Burst Program */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_BURST_STATUS] Bits */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_OFS             (16)                  /* BURST_STATUS Offset */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_M               (0x00070000)          /* Status of a Burst Operation */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS0                (0x00010000)          /* Status of a Burst Operation */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS1                (0x00020000)          /* Status of a Burst Operation */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS2                (0x00040000)          /* Status of a Burst Operation */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_0               (0x00000000)          /* Idle (Burst not active) */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_1               (0x00010000)          /* Burst program started but pending */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_2               (0x00020000)          /* Burst active, with 1st 128 bit word being written into Flash */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_3               (0x00030000)          /* Burst active, with 2nd 128 bit word being written into Flash */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_4               (0x00040000)          /* Burst active, with 3rd 128 bit word being written into Flash */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_5               (0x00050000)          /* Burst active, with 4th 128 bit word being written into Flash */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_6               (0x00060000)          /* Reserved (Idle) */
#define FLCTL_PRGBRST_CTLSTAT_BURST_STATUS_7               (0x00070000)          /* Burst Complete (status of completed burst remains in this state unless explicitly cleared by SW) */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_PRE_ERR] Bits */
#define FLCTL_PRGBRST_CTLSTAT_PRE_ERR_OFS                  (19)                  /* PRE_ERR Offset */
#define FLCTL_PRGBRST_CTLSTAT_PRE_ERR                      (0x00080000)          /* Burst Operation encountered preprogram auto-verify errors */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_PST_ERR] Bits */
#define FLCTL_PRGBRST_CTLSTAT_PST_ERR_OFS                  (20)                  /* PST_ERR Offset */
#define FLCTL_PRGBRST_CTLSTAT_PST_ERR                      (0x00100000)          /* Burst Operation encountered postprogram auto-verify errors */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_ADDR_ERR] Bits */
#define FLCTL_PRGBRST_CTLSTAT_ADDR_ERR_OFS                 (21)                  /* ADDR_ERR Offset */
#define FLCTL_PRGBRST_CTLSTAT_ADDR_ERR                     (0x00200000)          /* Burst Operation was terminated due to attempted program of reserved memory */
/* FLCTL_PRGBRST_CTLSTAT[FLCTL_PRGBRST_CTLSTAT_CLR_STAT] Bits */
#define FLCTL_PRGBRST_CTLSTAT_CLR_STAT_OFS                 (23)                  /* CLR_STAT Offset */
#define FLCTL_PRGBRST_CTLSTAT_CLR_STAT                     (0x00800000)          /* Clear status bits 21-16 of this register */
/* FLCTL_PRGBRST_STARTADDR[FLCTL_PRGBRST_STARTADDR_START_ADDRESS] Bits */
#define FLCTL_PRGBRST_STARTADDR_START_ADDRESS_OFS          ( 0)                  /* START_ADDRESS Offset */
#define FLCTL_PRGBRST_STARTADDR_START_ADDRESS_M            (0x003fffff)          /* Start Address of Program Burst Operation */
/* FLCTL_ERASE_CTLSTAT[FLCTL_ERASE_CTLSTAT_START] Bits */
#define FLCTL_ERASE_CTLSTAT_START_OFS                      ( 0)                  /* START Offset */
#define FLCTL_ERASE_CTLSTAT_START                          (0x00000001)          /* Start of Erase operation */
/* FLCTL_ERASE_CTLSTAT[FLCTL_ERASE_CTLSTAT_MODE] Bits */
#define FLCTL_ERASE_CTLSTAT_MODE_OFS                       ( 1)                  /* MODE Offset */
#define FLCTL_ERASE_CTLSTAT_MODE                           (0x00000002)          /* Erase mode selected by application */
/* FLCTL_ERASE_CTLSTAT[FLCTL_ERASE_CTLSTAT_TYPE] Bits */
#define FLCTL_ERASE_CTLSTAT_TYPE_OFS                       ( 2)                  /* TYPE Offset */
#define FLCTL_ERASE_CTLSTAT_TYPE_M                         (0x0000000c)          /* Type of memory that erase operation is carried out on */
#define FLCTL_ERASE_CTLSTAT_TYPE0                          (0x00000004)          /* Type of memory that erase operation is carried out on */
#define FLCTL_ERASE_CTLSTAT_TYPE1                          (0x00000008)          /* Type of memory that erase operation is carried out on */
#define FLCTL_ERASE_CTLSTAT_TYPE_0                         (0x00000000)          /* Main Memory */
#define FLCTL_ERASE_CTLSTAT_TYPE_1                         (0x00000004)          /* Information Memory */
#define FLCTL_ERASE_CTLSTAT_TYPE_2                         (0x00000008)          /* Reserved */
#define FLCTL_ERASE_CTLSTAT_TYPE_3                         (0x0000000c)          /* Engineering Memory */
/* FLCTL_ERASE_CTLSTAT[FLCTL_ERASE_CTLSTAT_STATUS] Bits */
#define FLCTL_ERASE_CTLSTAT_STATUS_OFS                     (16)                  /* STATUS Offset */
#define FLCTL_ERASE_CTLSTAT_STATUS_M                       (0x00030000)          /* Status of erase operations in the Flash memory */
#define FLCTL_ERASE_CTLSTAT_STATUS0                        (0x00010000)          /* Status of erase operations in the Flash memory */
#define FLCTL_ERASE_CTLSTAT_STATUS1                        (0x00020000)          /* Status of erase operations in the Flash memory */
#define FLCTL_ERASE_CTLSTAT_STATUS_0                       (0x00000000)          /* Idle (no program operation currently active) */
#define FLCTL_ERASE_CTLSTAT_STATUS_1                       (0x00010000)          /* Erase operation triggered to START but pending */
#define FLCTL_ERASE_CTLSTAT_STATUS_2                       (0x00020000)          /* Erase operation in progress */
#define FLCTL_ERASE_CTLSTAT_STATUS_3                       (0x00030000)          /* Erase operation completed (status of completed erase remains in this state unless explicitly cleared by SW) */
/* FLCTL_ERASE_CTLSTAT[FLCTL_ERASE_CTLSTAT_ADDR_ERR] Bits */
#define FLCTL_ERASE_CTLSTAT_ADDR_ERR_OFS                   (18)                  /* ADDR_ERR Offset */
#define FLCTL_ERASE_CTLSTAT_ADDR_ERR                       (0x00040000)          /* Erase Operation was terminated due to attempted erase of reserved memory address */
/* FLCTL_ERASE_CTLSTAT[FLCTL_ERASE_CTLSTAT_CLR_STAT] Bits */
#define FLCTL_ERASE_CTLSTAT_CLR_STAT_OFS                   (19)                  /* CLR_STAT Offset */
#define FLCTL_ERASE_CTLSTAT_CLR_STAT                       (0x00080000)          /* Clear status bits 18-16 of this register */
/* FLCTL_ERASE_SECTADDR[FLCTL_ERASE_SECTADDR_SECT_ADDRESS] Bits */
#define FLCTL_ERASE_SECTADDR_SECT_ADDRESS_OFS              ( 0)                  /* SECT_ADDRESS Offset */
#define FLCTL_ERASE_SECTADDR_SECT_ADDRESS_M                (0x003fffff)          /* Address of Sector being Erased */
/* FLCTL_BANK0_INFO_WEPROT[FLCTL_BANK0_INFO_WEPROT_PROT0] Bits */
#define FLCTL_BANK0_INFO_WEPROT_PROT0_OFS                  ( 0)                  /* PROT0 Offset */
#define FLCTL_BANK0_INFO_WEPROT_PROT0                      (0x00000001)          /* Protects Sector 0 from program or erase */
/* FLCTL_BANK0_INFO_WEPROT[FLCTL_BANK0_INFO_WEPROT_PROT1] Bits */
#define FLCTL_BANK0_INFO_WEPROT_PROT1_OFS                  ( 1)                  /* PROT1 Offset */
#define FLCTL_BANK0_INFO_WEPROT_PROT1                      (0x00000002)          /* Protects Sector 1 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT0] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT0_OFS                  ( 0)                  /* PROT0 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT0                      (0x00000001)          /* Protects Sector 0 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT1] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT1_OFS                  ( 1)                  /* PROT1 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT1                      (0x00000002)          /* Protects Sector 1 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT2] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT2_OFS                  ( 2)                  /* PROT2 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT2                      (0x00000004)          /* Protects Sector 2 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT3] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT3_OFS                  ( 3)                  /* PROT3 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT3                      (0x00000008)          /* Protects Sector 3 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT4] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT4_OFS                  ( 4)                  /* PROT4 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT4                      (0x00000010)          /* Protects Sector 4 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT5] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT5_OFS                  ( 5)                  /* PROT5 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT5                      (0x00000020)          /* Protects Sector 5 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT6] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT6_OFS                  ( 6)                  /* PROT6 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT6                      (0x00000040)          /* Protects Sector 6 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT7] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT7_OFS                  ( 7)                  /* PROT7 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT7                      (0x00000080)          /* Protects Sector 7 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT8] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT8_OFS                  ( 8)                  /* PROT8 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT8                      (0x00000100)          /* Protects Sector 8 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT9] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT9_OFS                  ( 9)                  /* PROT9 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT9                      (0x00000200)          /* Protects Sector 9 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT10] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT10_OFS                 (10)                  /* PROT10 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT10                     (0x00000400)          /* Protects Sector 10 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT11] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT11_OFS                 (11)                  /* PROT11 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT11                     (0x00000800)          /* Protects Sector 11 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT12] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT12_OFS                 (12)                  /* PROT12 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT12                     (0x00001000)          /* Protects Sector 12 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT13] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT13_OFS                 (13)                  /* PROT13 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT13                     (0x00002000)          /* Protects Sector 13 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT14] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT14_OFS                 (14)                  /* PROT14 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT14                     (0x00004000)          /* Protects Sector 14 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT15] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT15_OFS                 (15)                  /* PROT15 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT15                     (0x00008000)          /* Protects Sector 15 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT16] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT16_OFS                 (16)                  /* PROT16 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT16                     (0x00010000)          /* Protects Sector 16 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT17] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT17_OFS                 (17)                  /* PROT17 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT17                     (0x00020000)          /* Protects Sector 17 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT18] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT18_OFS                 (18)                  /* PROT18 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT18                     (0x00040000)          /* Protects Sector 18 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT19] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT19_OFS                 (19)                  /* PROT19 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT19                     (0x00080000)          /* Protects Sector 19 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT20] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT20_OFS                 (20)                  /* PROT20 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT20                     (0x00100000)          /* Protects Sector 20 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT21] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT21_OFS                 (21)                  /* PROT21 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT21                     (0x00200000)          /* Protects Sector 21 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT22] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT22_OFS                 (22)                  /* PROT22 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT22                     (0x00400000)          /* Protects Sector 22 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT23] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT23_OFS                 (23)                  /* PROT23 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT23                     (0x00800000)          /* Protects Sector 23 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT24] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT24_OFS                 (24)                  /* PROT24 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT24                     (0x01000000)          /* Protects Sector 24 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT25] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT25_OFS                 (25)                  /* PROT25 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT25                     (0x02000000)          /* Protects Sector 25 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT26] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT26_OFS                 (26)                  /* PROT26 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT26                     (0x04000000)          /* Protects Sector 26 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT27] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT27_OFS                 (27)                  /* PROT27 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT27                     (0x08000000)          /* Protects Sector 27 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT28] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT28_OFS                 (28)                  /* PROT28 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT28                     (0x10000000)          /* Protects Sector 28 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT29] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT29_OFS                 (29)                  /* PROT29 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT29                     (0x20000000)          /* Protects Sector 29 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT30] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT30_OFS                 (30)                  /* PROT30 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT30                     (0x40000000)          /* Protects Sector 30 from program or erase */
/* FLCTL_BANK0_MAIN_WEPROT[FLCTL_BANK0_MAIN_WEPROT_PROT31] Bits */
#define FLCTL_BANK0_MAIN_WEPROT_PROT31_OFS                 (31)                  /* PROT31 Offset */
#define FLCTL_BANK0_MAIN_WEPROT_PROT31                     (0x80000000)          /* Protects Sector 31 from program or erase */
/* FLCTL_BANK1_INFO_WEPROT[FLCTL_BANK1_INFO_WEPROT_PROT0] Bits */
#define FLCTL_BANK1_INFO_WEPROT_PROT0_OFS                  ( 0)                  /* PROT0 Offset */
#define FLCTL_BANK1_INFO_WEPROT_PROT0                      (0x00000001)          /* Protects Sector 0 from program or erase operations */
/* FLCTL_BANK1_INFO_WEPROT[FLCTL_BANK1_INFO_WEPROT_PROT1] Bits */
#define FLCTL_BANK1_INFO_WEPROT_PROT1_OFS                  ( 1)                  /* PROT1 Offset */
#define FLCTL_BANK1_INFO_WEPROT_PROT1                      (0x00000002)          /* Protects Sector 1 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT0] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT0_OFS                  ( 0)                  /* PROT0 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT0                      (0x00000001)          /* Protects Sector 0 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT1] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT1_OFS                  ( 1)                  /* PROT1 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT1                      (0x00000002)          /* Protects Sector 1 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT2] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT2_OFS                  ( 2)                  /* PROT2 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT2                      (0x00000004)          /* Protects Sector 2 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT3] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT3_OFS                  ( 3)                  /* PROT3 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT3                      (0x00000008)          /* Protects Sector 3 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT4] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT4_OFS                  ( 4)                  /* PROT4 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT4                      (0x00000010)          /* Protects Sector 4 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT5] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT5_OFS                  ( 5)                  /* PROT5 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT5                      (0x00000020)          /* Protects Sector 5 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT6] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT6_OFS                  ( 6)                  /* PROT6 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT6                      (0x00000040)          /* Protects Sector 6 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT7] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT7_OFS                  ( 7)                  /* PROT7 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT7                      (0x00000080)          /* Protects Sector 7 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT8] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT8_OFS                  ( 8)                  /* PROT8 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT8                      (0x00000100)          /* Protects Sector 8 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT9] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT9_OFS                  ( 9)                  /* PROT9 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT9                      (0x00000200)          /* Protects Sector 9 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT10] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT10_OFS                 (10)                  /* PROT10 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT10                     (0x00000400)          /* Protects Sector 10 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT11] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT11_OFS                 (11)                  /* PROT11 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT11                     (0x00000800)          /* Protects Sector 11 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT12] Bits */
