helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
#define FLCTL_BANK1_MAIN_WEPROT_PROT12_OFS                 (12)                  /* PROT12 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT12                     (0x00001000)          /* Protects Sector 12 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT13] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT13_OFS                 (13)                  /* PROT13 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT13                     (0x00002000)          /* Protects Sector 13 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT14] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT14_OFS                 (14)                  /* PROT14 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT14                     (0x00004000)          /* Protects Sector 14 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT15] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT15_OFS                 (15)                  /* PROT15 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT15                     (0x00008000)          /* Protects Sector 15 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT16] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT16_OFS                 (16)                  /* PROT16 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT16                     (0x00010000)          /* Protects Sector 16 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT17] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT17_OFS                 (17)                  /* PROT17 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT17                     (0x00020000)          /* Protects Sector 17 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT18] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT18_OFS                 (18)                  /* PROT18 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT18                     (0x00040000)          /* Protects Sector 18 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT19] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT19_OFS                 (19)                  /* PROT19 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT19                     (0x00080000)          /* Protects Sector 19 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT20] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT20_OFS                 (20)                  /* PROT20 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT20                     (0x00100000)          /* Protects Sector 20 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT21] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT21_OFS                 (21)                  /* PROT21 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT21                     (0x00200000)          /* Protects Sector 21 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT22] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT22_OFS                 (22)                  /* PROT22 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT22                     (0x00400000)          /* Protects Sector 22 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT23] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT23_OFS                 (23)                  /* PROT23 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT23                     (0x00800000)          /* Protects Sector 23 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT24] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT24_OFS                 (24)                  /* PROT24 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT24                     (0x01000000)          /* Protects Sector 24 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT25] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT25_OFS                 (25)                  /* PROT25 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT25                     (0x02000000)          /* Protects Sector 25 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT26] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT26_OFS                 (26)                  /* PROT26 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT26                     (0x04000000)          /* Protects Sector 26 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT27] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT27_OFS                 (27)                  /* PROT27 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT27                     (0x08000000)          /* Protects Sector 27 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT28] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT28_OFS                 (28)                  /* PROT28 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT28                     (0x10000000)          /* Protects Sector 28 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT29] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT29_OFS                 (29)                  /* PROT29 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT29                     (0x20000000)          /* Protects Sector 29 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT30] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT30_OFS                 (30)                  /* PROT30 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT30                     (0x40000000)          /* Protects Sector 30 from program or erase operations */
/* FLCTL_BANK1_MAIN_WEPROT[FLCTL_BANK1_MAIN_WEPROT_PROT31] Bits */
#define FLCTL_BANK1_MAIN_WEPROT_PROT31_OFS                 (31)                  /* PROT31 Offset */
#define FLCTL_BANK1_MAIN_WEPROT_PROT31                     (0x80000000)          /* Protects Sector 31 from program or erase operations */
/* FLCTL_BMRK_CTLSTAT[FLCTL_BMRK_CTLSTAT_I_BMRK] Bits */
#define FLCTL_BMRK_CTLSTAT_I_BMRK_OFS                      ( 0)                  /* I_BMRK Offset */
#define FLCTL_BMRK_CTLSTAT_I_BMRK                          (0x00000001)          /*  */
/* FLCTL_BMRK_CTLSTAT[FLCTL_BMRK_CTLSTAT_D_BMRK] Bits */
#define FLCTL_BMRK_CTLSTAT_D_BMRK_OFS                      ( 1)                  /* D_BMRK Offset */
#define FLCTL_BMRK_CTLSTAT_D_BMRK                          (0x00000002)          /*  */
/* FLCTL_BMRK_CTLSTAT[FLCTL_BMRK_CTLSTAT_CMP_EN] Bits */
#define FLCTL_BMRK_CTLSTAT_CMP_EN_OFS                      ( 2)                  /* CMP_EN Offset */
#define FLCTL_BMRK_CTLSTAT_CMP_EN                          (0x00000004)          /*  */
/* FLCTL_BMRK_CTLSTAT[FLCTL_BMRK_CTLSTAT_CMP_SEL] Bits */
#define FLCTL_BMRK_CTLSTAT_CMP_SEL_OFS                     ( 3)                  /* CMP_SEL Offset */
#define FLCTL_BMRK_CTLSTAT_CMP_SEL                         (0x00000008)          /*  */
/* FLCTL_IFG[FLCTL_IFG_RDBRST] Bits */
#define FLCTL_IFG_RDBRST_OFS                               ( 0)                  /* RDBRST Offset */
#define FLCTL_IFG_RDBRST                                   (0x00000001)          /*  */
/* FLCTL_IFG[FLCTL_IFG_AVPRE] Bits */
#define FLCTL_IFG_AVPRE_OFS                                ( 1)                  /* AVPRE Offset */
#define FLCTL_IFG_AVPRE                                    (0x00000002)          /*  */
/* FLCTL_IFG[FLCTL_IFG_AVPST] Bits */
#define FLCTL_IFG_AVPST_OFS                                ( 2)                  /* AVPST Offset */
#define FLCTL_IFG_AVPST                                    (0x00000004)          /*  */
/* FLCTL_IFG[FLCTL_IFG_PRG] Bits */
#define FLCTL_IFG_PRG_OFS                                  ( 3)                  /* PRG Offset */
#define FLCTL_IFG_PRG                                      (0x00000008)          /*  */
/* FLCTL_IFG[FLCTL_IFG_PRGB] Bits */
#define FLCTL_IFG_PRGB_OFS                                 ( 4)                  /* PRGB Offset */
#define FLCTL_IFG_PRGB                                     (0x00000010)          /*  */
/* FLCTL_IFG[FLCTL_IFG_ERASE] Bits */
#define FLCTL_IFG_ERASE_OFS                                ( 5)                  /* ERASE Offset */
#define FLCTL_IFG_ERASE                                    (0x00000020)          /*  */
/* FLCTL_IFG[FLCTL_IFG_BMRK] Bits */
#define FLCTL_IFG_BMRK_OFS                                 ( 8)                  /* BMRK Offset */
#define FLCTL_IFG_BMRK                                     (0x00000100)          /*  */
/* FLCTL_IFG[FLCTL_IFG_PRG_ERR] Bits */
#define FLCTL_IFG_PRG_ERR_OFS                              ( 9)                  /* PRG_ERR Offset */
#define FLCTL_IFG_PRG_ERR                                  (0x00000200)          /*  */
/* FLCTL_IE[FLCTL_IE_RDBRST] Bits */
#define FLCTL_IE_RDBRST_OFS                                ( 0)                  /* RDBRST Offset */
#define FLCTL_IE_RDBRST                                    (0x00000001)          /*  */
/* FLCTL_IE[FLCTL_IE_AVPRE] Bits */
#define FLCTL_IE_AVPRE_OFS                                 ( 1)                  /* AVPRE Offset */
#define FLCTL_IE_AVPRE                                     (0x00000002)          /*  */
/* FLCTL_IE[FLCTL_IE_AVPST] Bits */
#define FLCTL_IE_AVPST_OFS                                 ( 2)                  /* AVPST Offset */
#define FLCTL_IE_AVPST                                     (0x00000004)          /*  */
/* FLCTL_IE[FLCTL_IE_PRG] Bits */
#define FLCTL_IE_PRG_OFS                                   ( 3)                  /* PRG Offset */
#define FLCTL_IE_PRG                                       (0x00000008)          /*  */
/* FLCTL_IE[FLCTL_IE_PRGB] Bits */
#define FLCTL_IE_PRGB_OFS                                  ( 4)                  /* PRGB Offset */
#define FLCTL_IE_PRGB                                      (0x00000010)          /*  */
/* FLCTL_IE[FLCTL_IE_ERASE] Bits */
#define FLCTL_IE_ERASE_OFS                                 ( 5)                  /* ERASE Offset */
#define FLCTL_IE_ERASE                                     (0x00000020)          /*  */
/* FLCTL_IE[FLCTL_IE_BMRK] Bits */
#define FLCTL_IE_BMRK_OFS                                  ( 8)                  /* BMRK Offset */
#define FLCTL_IE_BMRK                                      (0x00000100)          /*  */
/* FLCTL_IE[FLCTL_IE_PRG_ERR] Bits */
#define FLCTL_IE_PRG_ERR_OFS                               ( 9)                  /* PRG_ERR Offset */
#define FLCTL_IE_PRG_ERR                                   (0x00000200)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_RDBRST] Bits */
#define FLCTL_CLRIFG_RDBRST_OFS                            ( 0)                  /* RDBRST Offset */
#define FLCTL_CLRIFG_RDBRST                                (0x00000001)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_AVPRE] Bits */
#define FLCTL_CLRIFG_AVPRE_OFS                             ( 1)                  /* AVPRE Offset */
#define FLCTL_CLRIFG_AVPRE                                 (0x00000002)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_AVPST] Bits */
#define FLCTL_CLRIFG_AVPST_OFS                             ( 2)                  /* AVPST Offset */
#define FLCTL_CLRIFG_AVPST                                 (0x00000004)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_PRG] Bits */
#define FLCTL_CLRIFG_PRG_OFS                               ( 3)                  /* PRG Offset */
#define FLCTL_CLRIFG_PRG                                   (0x00000008)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_PRGB] Bits */
#define FLCTL_CLRIFG_PRGB_OFS                              ( 4)                  /* PRGB Offset */
#define FLCTL_CLRIFG_PRGB                                  (0x00000010)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_ERASE] Bits */
#define FLCTL_CLRIFG_ERASE_OFS                             ( 5)                  /* ERASE Offset */
#define FLCTL_CLRIFG_ERASE                                 (0x00000020)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_BMRK] Bits */
#define FLCTL_CLRIFG_BMRK_OFS                              ( 8)                  /* BMRK Offset */
#define FLCTL_CLRIFG_BMRK                                  (0x00000100)          /*  */
/* FLCTL_CLRIFG[FLCTL_CLRIFG_PRG_ERR] Bits */
#define FLCTL_CLRIFG_PRG_ERR_OFS                           ( 9)                  /* PRG_ERR Offset */
#define FLCTL_CLRIFG_PRG_ERR                               (0x00000200)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_RDBRST] Bits */
#define FLCTL_SETIFG_RDBRST_OFS                            ( 0)                  /* RDBRST Offset */
#define FLCTL_SETIFG_RDBRST                                (0x00000001)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_AVPRE] Bits */
#define FLCTL_SETIFG_AVPRE_OFS                             ( 1)                  /* AVPRE Offset */
#define FLCTL_SETIFG_AVPRE                                 (0x00000002)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_AVPST] Bits */
#define FLCTL_SETIFG_AVPST_OFS                             ( 2)                  /* AVPST Offset */
#define FLCTL_SETIFG_AVPST                                 (0x00000004)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_PRG] Bits */
#define FLCTL_SETIFG_PRG_OFS                               ( 3)                  /* PRG Offset */
#define FLCTL_SETIFG_PRG                                   (0x00000008)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_PRGB] Bits */
#define FLCTL_SETIFG_PRGB_OFS                              ( 4)                  /* PRGB Offset */
#define FLCTL_SETIFG_PRGB                                  (0x00000010)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_ERASE] Bits */
#define FLCTL_SETIFG_ERASE_OFS                             ( 5)                  /* ERASE Offset */
#define FLCTL_SETIFG_ERASE                                 (0x00000020)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_BMRK] Bits */
#define FLCTL_SETIFG_BMRK_OFS                              ( 8)                  /* BMRK Offset */
#define FLCTL_SETIFG_BMRK                                  (0x00000100)          /*  */
/* FLCTL_SETIFG[FLCTL_SETIFG_PRG_ERR] Bits */
#define FLCTL_SETIFG_PRG_ERR_OFS                           ( 9)                  /* PRG_ERR Offset */
#define FLCTL_SETIFG_PRG_ERR                               (0x00000200)          /*  */
/* FLCTL_READ_TIMCTL[FLCTL_READ_TIMCTL_SETUP] Bits */
#define FLCTL_READ_TIMCTL_SETUP_OFS                        ( 0)                  /* SETUP Offset */
#define FLCTL_READ_TIMCTL_SETUP_M                          (0x000000ff)          /*  */
/* FLCTL_READ_TIMCTL[FLCTL_READ_TIMCTL_HOLD] Bits */
#define FLCTL_READ_TIMCTL_HOLD_OFS                         ( 8)                  /* HOLD Offset */
#define FLCTL_READ_TIMCTL_HOLD_M                           (0x00000f00)          /*  */
/* FLCTL_READ_TIMCTL[FLCTL_READ_TIMCTL_IREF_BOOST1] Bits */
#define FLCTL_READ_TIMCTL_IREF_BOOST1_OFS                  (12)                  /* IREF_BOOST1 Offset */
#define FLCTL_READ_TIMCTL_IREF_BOOST1_M                    (0x0000f000)          /*  */
/* FLCTL_READ_TIMCTL[FLCTL_READ_TIMCTL_SETUP_LONG] Bits */
#define FLCTL_READ_TIMCTL_SETUP_LONG_OFS                   (16)                  /* SETUP_LONG Offset */
#define FLCTL_READ_TIMCTL_SETUP_LONG_M                     (0x00ff0000)          /*  */
/* FLCTL_READMARGIN_TIMCTL[FLCTL_READMARGIN_TIMCTL_SETUP] Bits */
#define FLCTL_READMARGIN_TIMCTL_SETUP_OFS                  ( 0)                  /* SETUP Offset */
#define FLCTL_READMARGIN_TIMCTL_SETUP_M                    (0x000000ff)          /*  */
/* FLCTL_READMARGIN_TIMCTL[FLCTL_READMARGIN_TIMCTL_HOLD] Bits */
#define FLCTL_READMARGIN_TIMCTL_HOLD_OFS                   ( 8)                  /* HOLD Offset */
#define FLCTL_READMARGIN_TIMCTL_HOLD_M                     (0x00000f00)          /*  */
/* FLCTL_PRGVER_TIMCTL[FLCTL_PRGVER_TIMCTL_SETUP] Bits */
#define FLCTL_PRGVER_TIMCTL_SETUP_OFS                      ( 0)                  /* SETUP Offset */
#define FLCTL_PRGVER_TIMCTL_SETUP_M                        (0x000000ff)          /*  */
/* FLCTL_PRGVER_TIMCTL[FLCTL_PRGVER_TIMCTL_ACTIVE] Bits */
#define FLCTL_PRGVER_TIMCTL_ACTIVE_OFS                     ( 8)                  /* ACTIVE Offset */
#define FLCTL_PRGVER_TIMCTL_ACTIVE_M                       (0x00000f00)          /*  */
/* FLCTL_PRGVER_TIMCTL[FLCTL_PRGVER_TIMCTL_HOLD] Bits */
#define FLCTL_PRGVER_TIMCTL_HOLD_OFS                       (12)                  /* HOLD Offset */
#define FLCTL_PRGVER_TIMCTL_HOLD_M                         (0x0000f000)          /*  */
/* FLCTL_ERSVER_TIMCTL[FLCTL_ERSVER_TIMCTL_SETUP] Bits */
#define FLCTL_ERSVER_TIMCTL_SETUP_OFS                      ( 0)                  /* SETUP Offset */
#define FLCTL_ERSVER_TIMCTL_SETUP_M                        (0x000000ff)          /*  */
/* FLCTL_ERSVER_TIMCTL[FLCTL_ERSVER_TIMCTL_HOLD] Bits */
#define FLCTL_ERSVER_TIMCTL_HOLD_OFS                       ( 8)                  /* HOLD Offset */
#define FLCTL_ERSVER_TIMCTL_HOLD_M                         (0x00000f00)          /*  */
/* FLCTL_LKGVER_TIMCTL[FLCTL_LKGVER_TIMCTL_SETUP] Bits */
#define FLCTL_LKGVER_TIMCTL_SETUP_OFS                      ( 0)                  /* SETUP Offset */
#define FLCTL_LKGVER_TIMCTL_SETUP_M                        (0x000000ff)          /*  */
/* FLCTL_LKGVER_TIMCTL[FLCTL_LKGVER_TIMCTL_HOLD] Bits */
#define FLCTL_LKGVER_TIMCTL_HOLD_OFS                       ( 8)                  /* HOLD Offset */
#define FLCTL_LKGVER_TIMCTL_HOLD_M                         (0x00000f00)          /*  */
/* FLCTL_PROGRAM_TIMCTL[FLCTL_PROGRAM_TIMCTL_SETUP] Bits */
#define FLCTL_PROGRAM_TIMCTL_SETUP_OFS                     ( 0)                  /* SETUP Offset */
#define FLCTL_PROGRAM_TIMCTL_SETUP_M                       (0x000000ff)          /*  */
/* FLCTL_PROGRAM_TIMCTL[FLCTL_PROGRAM_TIMCTL_ACTIVE] Bits */
#define FLCTL_PROGRAM_TIMCTL_ACTIVE_OFS                    ( 8)                  /* ACTIVE Offset */
#define FLCTL_PROGRAM_TIMCTL_ACTIVE_M                      (0x0fffff00)          /*  */
/* FLCTL_PROGRAM_TIMCTL[FLCTL_PROGRAM_TIMCTL_HOLD] Bits */
#define FLCTL_PROGRAM_TIMCTL_HOLD_OFS                      (28)                  /* HOLD Offset */
#define FLCTL_PROGRAM_TIMCTL_HOLD_M                        (0xf0000000)          /*  */
/* FLCTL_ERASE_TIMCTL[FLCTL_ERASE_TIMCTL_SETUP] Bits */
#define FLCTL_ERASE_TIMCTL_SETUP_OFS                       ( 0)                  /* SETUP Offset */
#define FLCTL_ERASE_TIMCTL_SETUP_M                         (0x000000ff)          /*  */
/* FLCTL_ERASE_TIMCTL[FLCTL_ERASE_TIMCTL_ACTIVE] Bits */
#define FLCTL_ERASE_TIMCTL_ACTIVE_OFS                      ( 8)                  /* ACTIVE Offset */
#define FLCTL_ERASE_TIMCTL_ACTIVE_M                        (0x0fffff00)          /*  */
/* FLCTL_ERASE_TIMCTL[FLCTL_ERASE_TIMCTL_HOLD] Bits */
#define FLCTL_ERASE_TIMCTL_HOLD_OFS                        (28)                  /* HOLD Offset */
#define FLCTL_ERASE_TIMCTL_HOLD_M                          (0xf0000000)          /*  */
/* FLCTL_MASSERASE_TIMCTL[FLCTL_MASSERASE_TIMCTL_BOOST_ACTIVE] Bits */
#define FLCTL_MASSERASE_TIMCTL_BOOST_ACTIVE_OFS            ( 0)                  /* BOOST_ACTIVE Offset */
#define FLCTL_MASSERASE_TIMCTL_BOOST_ACTIVE_M              (0x000000ff)          /*  */
/* FLCTL_MASSERASE_TIMCTL[FLCTL_MASSERASE_TIMCTL_BOOST_HOLD] Bits */
#define FLCTL_MASSERASE_TIMCTL_BOOST_HOLD_OFS              ( 8)                  /* BOOST_HOLD Offset */
#define FLCTL_MASSERASE_TIMCTL_BOOST_HOLD_M                (0x0000ff00)          /*  */
/* FLCTL_BURSTPRG_TIMCTL[FLCTL_BURSTPRG_TIMCTL_ACTIVE] Bits */
#define FLCTL_BURSTPRG_TIMCTL_ACTIVE_OFS                   ( 8)                  /* ACTIVE Offset */
#define FLCTL_BURSTPRG_TIMCTL_ACTIVE_M                     (0x0fffff00)          /*  */


