helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// ITM Bits
/***************************************************************************
/* ITM_TPR[ITM_TPR_PRIVMASK] Bits */
#define ITM_TPR_PRIVMASK_OFS                               ( 0)                  /* PRIVMASK Offset */
#define ITM_TPR_PRIVMASK_M                                 (0x0000000f)          /*  */
/* ITM_TCR[ITM_TCR_ITMENA] Bits */
#define ITM_TCR_ITMENA_OFS                                 ( 0)                  /* ITMENA Offset */
#define ITM_TCR_ITMENA                                     (0x00000001)          /*  */
/* ITM_TCR[ITM_TCR_TSENA] Bits */
#define ITM_TCR_TSENA_OFS                                  ( 1)                  /* TSENA Offset */
#define ITM_TCR_TSENA                                      (0x00000002)          /*  */
/* ITM_TCR[ITM_TCR_SYNCENA] Bits */
#define ITM_TCR_SYNCENA_OFS                                ( 2)                  /* SYNCENA Offset */
#define ITM_TCR_SYNCENA                                    (0x00000004)          /*  */
/* ITM_TCR[ITM_TCR_DWTENA] Bits */
#define ITM_TCR_DWTENA_OFS                                 ( 3)                  /* DWTENA Offset */
#define ITM_TCR_DWTENA                                     (0x00000008)          /*  */
/* ITM_TCR[ITM_TCR_SWOENA] Bits */
#define ITM_TCR_SWOENA_OFS                                 ( 4)                  /* SWOENA Offset */
#define ITM_TCR_SWOENA                                     (0x00000010)          /*  */
/* ITM_TCR[ITM_TCR_TSPRESCALE] Bits */
#define ITM_TCR_TSPRESCALE_OFS                             ( 8)                  /* TSPRESCALE Offset */
#define ITM_TCR_TSPRESCALE_M                               (0x00000300)          /*  */
#define ITM_TCR_TSPRESCALE0                                (0x00000100)          /*  */
#define ITM_TCR_TSPRESCALE1                                (0x00000200)          /*  */
#define ITM_TCR_TSPRESCALE_0                               (0x00000000)          /* no prescaling */
#define ITM_TCR_TSPRESCALE_1                               (0x00000100)          /* divide by 4 */
#define ITM_TCR_TSPRESCALE_2                               (0x00000200)          /* divide by 16 */
#define ITM_TCR_TSPRESCALE_3                               (0x00000300)          /* divide by 64 */
/* ITM_TCR[ITM_TCR_ATBID] Bits */
#define ITM_TCR_ATBID_OFS                                  (16)                  /* ATBID Offset */
#define ITM_TCR_ATBID_M                                    (0x007f0000)          /*  */
/* ITM_TCR[ITM_TCR_BUSY] Bits */
#define ITM_TCR_BUSY_OFS                                   (23)                  /* BUSY Offset */
#define ITM_TCR_BUSY                                       (0x00800000)          /*  */
/* ITM_IWR[ITM_IWR_ATVALIDM] Bits */
#define ITM_IWR_ATVALIDM_OFS                               ( 0)                  /* ATVALIDM Offset */
#define ITM_IWR_ATVALIDM                                   (0x00000001)          /*  */
/* ITM_IMCR[ITM_IMCR_INTEGRATION] Bits */
#define ITM_IMCR_INTEGRATION_OFS                           ( 0)                  /* INTEGRATION Offset */
#define ITM_IMCR_INTEGRATION                               (0x00000001)          /*  */
/* ITM_LSR[ITM_LSR_PRESENT] Bits */
#define ITM_LSR_PRESENT_OFS                                ( 0)                  /* PRESENT Offset */
#define ITM_LSR_PRESENT                                    (0x00000001)          /*  */
/* ITM_LSR[ITM_LSR_ACCESS] Bits */
#define ITM_LSR_ACCESS_OFS                                 ( 1)                  /* ACCESS Offset */
#define ITM_LSR_ACCESS                                     (0x00000002)          /*  */
/* ITM_LSR[ITM_LSR_BYTEACC] Bits */
#define ITM_LSR_BYTEACC_OFS                                ( 2)                  /* BYTEACC Offset */
#define ITM_LSR_BYTEACC                                    (0x00000004)          /*  */


/***************************************************************************
// MPU Bits
/***************************************************************************
/* MPU_TYPE[MPU_TYPE_SEPARATE] Bits */
#define MPU_TYPE_SEPARATE_OFS                              ( 0)                  /* SEPARATE Offset */
#define MPU_TYPE_SEPARATE                                  (0x00000001)          /*  */
/* MPU_TYPE[MPU_TYPE_DREGION] Bits */
#define MPU_TYPE_DREGION_OFS                               ( 8)                  /* DREGION Offset */
#define MPU_TYPE_DREGION_M                                 (0x0000ff00)          /*  */
/* MPU_TYPE[MPU_TYPE_IREGION] Bits */
#define MPU_TYPE_IREGION_OFS                               (16)                  /* IREGION Offset */
#define MPU_TYPE_IREGION_M                                 (0x00ff0000)          /*  */
/* MPU_CTRL[MPU_CTRL_ENABLE] Bits */
#define MPU_CTRL_ENABLE_OFS                                ( 0)                  /* ENABLE Offset */
#define MPU_CTRL_ENABLE                                    (0x00000001)          /*  */
/* MPU_CTRL[MPU_CTRL_HFNMIENA] Bits */
#define MPU_CTRL_HFNMIENA_OFS                              ( 1)                  /* HFNMIENA Offset */
#define MPU_CTRL_HFNMIENA                                  (0x00000002)          /*  */
/* MPU_CTRL[MPU_CTRL_PRIVDEFENA] Bits */
#define MPU_CTRL_PRIVDEFENA_OFS                            ( 2)                  /* PRIVDEFENA Offset */
#define MPU_CTRL_PRIVDEFENA                                (0x00000004)          /*  */
/* MPU_RNR[MPU_RNR_REGION] Bits */
#define MPU_RNR_REGION_OFS                                 ( 0)                  /* REGION Offset */
#define MPU_RNR_REGION_M                                   (0x000000ff)          /*  */
/* MPU_RBAR[MPU_RBAR_REGION] Bits */
#define MPU_RBAR_REGION_OFS                                ( 0)                  /* REGION Offset */
#define MPU_RBAR_REGION_M                                  (0x0000000f)          /*  */
/* MPU_RBAR[MPU_RBAR_VALID] Bits */
#define MPU_RBAR_VALID_OFS                                 ( 4)                  /* VALID Offset */
#define MPU_RBAR_VALID                                     (0x00000010)          /*  */
/* MPU_RBAR[MPU_RBAR_ADDR] Bits */
#define MPU_RBAR_ADDR_OFS                                  ( 5)                  /* ADDR Offset */
#define MPU_RBAR_ADDR_M                                    (0xffffffe0)          /*  */
/* MPU_RASR[MPU_RASR_ENABLE] Bits */
#define MPU_RASR_ENABLE_OFS                                ( 0)                  /* ENABLE Offset */
#define MPU_RASR_ENABLE                                    (0x00000001)          /*  */
/* MPU_RASR[MPU_RASR_SIZE] Bits */
#define MPU_RASR_SIZE_OFS                                  ( 1)                  /* SIZE Offset */
#define MPU_RASR_SIZE_M                                    (0x0000003e)          /*  */
#define MPU_RASR_SIZE0                                     (0x00000002)          /*  */
#define MPU_RASR_SIZE1                                     (0x00000004)          /*  */
#define MPU_RASR_SIZE2                                     (0x00000008)          /*  */
#define MPU_RASR_SIZE3                                     (0x00000010)          /*  */
#define MPU_RASR_SIZE4                                     (0x00000020)          /*  */
#define MPU_RASR_SIZE_0                                    (0x00000000)          /* 4KB */
#define MPU_RASR_SIZE_1                                    (0x00000002)          /* 256MB */
#define MPU_RASR_SIZE_4                                    (0x00000008)          /* 32B */
#define MPU_RASR_SIZE_5                                    (0x0000000a)          /* 64B */
#define MPU_RASR_SIZE_6                                    (0x0000000c)          /* 128B */
#define MPU_RASR_SIZE_7                                    (0x0000000e)          /* 256B */
#define MPU_RASR_SIZE_8                                    (0x00000010)          /* 512B */
#define MPU_RASR_SIZE_9                                    (0x00000012)          /* 1KB */
#define MPU_RASR_SIZE_10                                   (0x00000014)          /* 2KB */
#define MPU_RASR_SIZE_12                                   (0x00000018)          /* 8KB */
#define MPU_RASR_SIZE_13                                   (0x0000001a)          /* 16KB */
#define MPU_RASR_SIZE_14                                   (0x0000001c)          /* 32KB */
#define MPU_RASR_SIZE_15                                   (0x0000001e)          /* 64KB */
#define MPU_RASR_SIZE_16                                   (0x00000020)          /* 128KB */
#define MPU_RASR_SIZE_17                                   (0x00000022)          /* 256KB */
#define MPU_RASR_SIZE_18                                   (0x00000024)          /* 512KB */
#define MPU_RASR_SIZE_19                                   (0x00000026)          /* 1MB */
#define MPU_RASR_SIZE_20                                   (0x00000028)          /* 2MB */
#define MPU_RASR_SIZE_21                                   (0x0000002a)          /* 4MB */
#define MPU_RASR_SIZE_22                                   (0x0000002c)          /* 8MB */
#define MPU_RASR_SIZE_23                                   (0x0000002e)          /* 16MB */
#define MPU_RASR_SIZE_24                                   (0x00000030)          /* 32MB */
#define MPU_RASR_SIZE_25                                   (0x00000032)          /* 64MB */
#define MPU_RASR_SIZE_26                                   (0x00000034)          /* 128MB */
#define MPU_RASR_SIZE_28                                   (0x00000038)          /* 512MB */
#define MPU_RASR_SIZE_29                                   (0x0000003a)          /* 1GB */
#define MPU_RASR_SIZE_30                                   (0x0000003c)          /* 2GB */
#define MPU_RASR_SIZE_31                                   (0x0000003e)          /* 4GB */
/* MPU_RASR[MPU_RASR_SRD] Bits */
#define MPU_RASR_SRD_OFS                                   ( 8)                  /* SRD Offset */
#define MPU_RASR_SRD_M                                     (0x0000ff00)          /*  */
/* MPU_RASR[MPU_RASR_B] Bits */
#define MPU_RASR_B_OFS                                     (16)                  /* B Offset */
#define MPU_RASR_B                                         (0x00010000)          /*  */
/* MPU_RASR[MPU_RASR_C] Bits */
#define MPU_RASR_C_OFS                                     (17)                  /* C Offset */
#define MPU_RASR_C                                         (0x00020000)          /*  */
/* MPU_RASR[MPU_RASR_S] Bits */
#define MPU_RASR_S_OFS                                     (18)                  /* S Offset */
#define MPU_RASR_S                                         (0x00040000)          /*  */
/* MPU_RASR[MPU_RASR_TEX] Bits */
#define MPU_RASR_TEX_OFS                                   (19)                  /* TEX Offset */
#define MPU_RASR_TEX_M                                     (0x00380000)          /*  */
/* MPU_RASR[MPU_RASR_AP] Bits */
#define MPU_RASR_AP_OFS                                    (24)                  /* AP Offset */
#define MPU_RASR_AP_M                                      (0x07000000)          /*  */
#define MPU_RASR_AP0                                       (0x01000000)          /*  */
#define MPU_RASR_AP1                                       (0x02000000)          /*  */
#define MPU_RASR_AP2                                       (0x04000000)          /*  */
#define MPU_RASR_AP_0                                      (0x00000000)          /* Priviliged permissions: No access. User permissions: No access. */
#define MPU_RASR_AP_1                                      (0x01000000)          /* Priviliged permissions: Read-write. User permissions: No access. */
#define MPU_RASR_AP_2                                      (0x02000000)          /* Priviliged permissions: Read-write. User permissions: Read-only. */
#define MPU_RASR_AP_3                                      (0x03000000)          /* Priviliged permissions: Read-write. User permissions: Read-write. */
#define MPU_RASR_AP_5                                      (0x05000000)          /* Priviliged permissions: Read-only. User permissions: No access. */
#define MPU_RASR_AP_6                                      (0x06000000)          /* Priviliged permissions: Read-only. User permissions: Read-only. */
#define MPU_RASR_AP_7                                      (0x07000000)          /* Priviliged permissions: Read-only. User permissions: Read-only. */
/* MPU_RASR[MPU_RASR_XN] Bits */
#define MPU_RASR_XN_OFS                                    (28)                  /* XN Offset */
#define MPU_RASR_XN                                        (0x10000000)          /*  */

/* Pre-defined bitfield values */

/*  MPU_RASR_SIZE Bitfield Bits */
#define MPU_RASR_SIZE__4                                   (0x00000008)          /* 64B */
#define MPU_RASR_SIZE__32B                                 (0x00000008)          /* 32B */
#define MPU_RASR_SIZE__64B                                 (0x0000000c)          /* 128B */
#define MPU_RASR_SIZE__256B                                (0x0000000e)          /* 256B */
#define MPU_RASR_SIZE__512B                                (0x00000010)          /* 512B */
#define MPU_RASR_SIZE__1K                                  (0x00000012)          /* 1KB */
#define MPU_RASR_SIZE__2K                                  (0x00000014)          /* 2KB */
#define MPU_RASR_SIZE__4K                                  (0x00000016)          /* 4KB */
#define MPU_RASR_SIZE__8K                                  (0x00000018)          /* 8KB */
#define MPU_RASR_SIZE__16K                                 (0x0000001a)          /* 16KB */
#define MPU_RASR_SIZE__32K                                 (0x0000001c)          /* 32KB */
#define MPU_RASR_SIZE__64K                                 (0x0000001e)          /* 64KB */
#define MPU_RASR_SIZE__128K                                (0x00000020)          /* 128KB */
#define MPU_RASR_SIZE__256K                                (0x00000022)          /* 256KB */
#define MPU_RASR_SIZE__512K                                (0x00000024)          /* 512KB */
#define MPU_RASR_SIZE__1M                                  (0x00000026)          /* 1MB */
#define MPU_RASR_SIZE__2M                                  (0x00000028)          /* 2MB */
#define MPU_RASR_SIZE__4M                                  (0x0000002a)          /* 4MB */
#define MPU_RASR_SIZE__8M                                  (0x0000002c)          /* 8MB */
#define MPU_RASR_SIZE__16M                                 (0x0000002e)          /* 16MB */
#define MPU_RASR_SIZE__32M                                 (0x00000030)          /* 32MB */
#define MPU_RASR_SIZE__64M                                 (0x00000032)          /* 64MB */
#define MPU_RASR_SIZE__128M                                (0x00000034)          /* 128MB */
#define MPU_RASR_SIZE__256M                                (0x00000036)          /* 256MB */
#define MPU_RASR_SIZE__512M                                (0x00000038)          /* 512MB */
#define MPU_RASR_SIZE__1G                                  (0x0000003a)          /* 1GB */
#define MPU_RASR_SIZE__2G                                  (0x0000003c)          /* 2GB */
#define MPU_RASR_SIZE__4G                                  (0x0000003e)          /* 4GB */

/*  MPU_RASR_AP Bitfield Bits */
#define MPU_RASR_AP_PRV_NO_USR_NO                          (0x00000000)          /* Priviliged permissions: No access. User permissions: No access. */
#define MPU_RASR_AP_PRV_RW_USR_NO                          (0x01000000)          /* Priviliged permissions: Read-write. User permissions: No access. */
#define MPU_RASR_AP_PRV_RW_USR_RO                          (0x02000000)          /* Priviliged permissions: Read-write. User permissions: Read-only. */ 
#define MPU_RASR_AP_PRV_RW_USR_RW                          (0x03000000)          /* Priviliged permissions: Read-write. User permissions: Read-write. */
#define MPU_RASR_AP_PRV_RO_USR_NO                          (0x05000000)          /* Priviliged permissions: Read-only. User permissions: No access. */
#define MPU_RASR_AP_PRV_RO_USR_RO                          (0x06000000)          /* Priviliged permissions: Read-only. User permissions: Read-only. */

/* MPU_RASR_XN Bitfield Bits */
#define MPU_RASR_AP_EXEC                                   (0x00000000)          /* Instruction access enabled */     
#define MPU_RASR_AP_NOEXEC                                 (0x10000000)          /* Instruction access disabled */


