helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// NVIC Bits
/***************************************************************************
/* NVIC_IPR0[NVIC_IPR0_PRI_0] Bits */
#define NVIC_IPR0_PRI_0_OFS                                ( 0)                  /* PRI_0 Offset */
#define NVIC_IPR0_PRI_0_M                                  (0x000000ff)          /*  */
/* NVIC_IPR0[NVIC_IPR0_PRI_1] Bits */
#define NVIC_IPR0_PRI_1_OFS                                ( 8)                  /* PRI_1 Offset */
#define NVIC_IPR0_PRI_1_M                                  (0x0000ff00)          /*  */
/* NVIC_IPR0[NVIC_IPR0_PRI_2] Bits */
#define NVIC_IPR0_PRI_2_OFS                                (16)                  /* PRI_2 Offset */
#define NVIC_IPR0_PRI_2_M                                  (0x00ff0000)          /*  */
/* NVIC_IPR0[NVIC_IPR0_PRI_3] Bits */
#define NVIC_IPR0_PRI_3_OFS                                (24)                  /* PRI_3 Offset */
#define NVIC_IPR0_PRI_3_M                                  (0xff000000)          /*  */
/* NVIC_IPR1[NVIC_IPR1_PRI_4] Bits */
#define NVIC_IPR1_PRI_4_OFS                                ( 0)                  /* PRI_4 Offset */
#define NVIC_IPR1_PRI_4_M                                  (0x000000ff)          /*  */
/* NVIC_IPR1[NVIC_IPR1_PRI_5] Bits */
#define NVIC_IPR1_PRI_5_OFS                                ( 8)                  /* PRI_5 Offset */
#define NVIC_IPR1_PRI_5_M                                  (0x0000ff00)          /*  */
/* NVIC_IPR1[NVIC_IPR1_PRI_6] Bits */
#define NVIC_IPR1_PRI_6_OFS                                (16)                  /* PRI_6 Offset */
#define NVIC_IPR1_PRI_6_M                                  (0x00ff0000)          /*  */
/* NVIC_IPR1[NVIC_IPR1_PRI_7] Bits */
#define NVIC_IPR1_PRI_7_OFS                                (24)                  /* PRI_7 Offset */
#define NVIC_IPR1_PRI_7_M                                  (0xff000000)          /*  */
/* NVIC_IPR2[NVIC_IPR2_PRI_8] Bits */
#define NVIC_IPR2_PRI_8_OFS                                ( 0)                  /* PRI_8 Offset */
#define NVIC_IPR2_PRI_8_M                                  (0x000000ff)          /*  */
/* NVIC_IPR2[NVIC_IPR2_PRI_9] Bits */
#define NVIC_IPR2_PRI_9_OFS                                ( 8)                  /* PRI_9 Offset */
#define NVIC_IPR2_PRI_9_M                                  (0x0000ff00)          /*  */
/* NVIC_IPR2[NVIC_IPR2_PRI_10] Bits */
#define NVIC_IPR2_PRI_10_OFS                               (16)                  /* PRI_10 Offset */
#define NVIC_IPR2_PRI_10_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR2[NVIC_IPR2_PRI_11] Bits */
#define NVIC_IPR2_PRI_11_OFS                               (24)                  /* PRI_11 Offset */
#define NVIC_IPR2_PRI_11_M                                 (0xff000000)          /*  */
/* NVIC_IPR3[NVIC_IPR3_PRI_12] Bits */
#define NVIC_IPR3_PRI_12_OFS                               ( 0)                  /* PRI_12 Offset */
#define NVIC_IPR3_PRI_12_M                                 (0x000000ff)          /*  */
/* NVIC_IPR3[NVIC_IPR3_PRI_13] Bits */
#define NVIC_IPR3_PRI_13_OFS                               ( 8)                  /* PRI_13 Offset */
#define NVIC_IPR3_PRI_13_M                                 (0x0000ff00)          /*  */
/* NVIC_IPR3[NVIC_IPR3_PRI_14] Bits */
#define NVIC_IPR3_PRI_14_OFS                               (16)                  /* PRI_14 Offset */
#define NVIC_IPR3_PRI_14_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR3[NVIC_IPR3_PRI_15] Bits */
#define NVIC_IPR3_PRI_15_OFS                               (24)                  /* PRI_15 Offset */
#define NVIC_IPR3_PRI_15_M                                 (0xff000000)          /*  */
/* NVIC_IPR4[NVIC_IPR4_PRI_16] Bits */
#define NVIC_IPR4_PRI_16_OFS                               ( 0)                  /* PRI_16 Offset */
#define NVIC_IPR4_PRI_16_M                                 (0x000000ff)          /*  */
/* NVIC_IPR4[NVIC_IPR4_PRI_17] Bits */
#define NVIC_IPR4_PRI_17_OFS                               ( 8)                  /* PRI_17 Offset */
#define NVIC_IPR4_PRI_17_M                                 (0x0000ff00)          /*  */
/* NVIC_IPR4[NVIC_IPR4_PRI_18] Bits */
#define NVIC_IPR4_PRI_18_OFS                               (16)                  /* PRI_18 Offset */
#define NVIC_IPR4_PRI_18_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR4[NVIC_IPR4_PRI_19] Bits */
#define NVIC_IPR4_PRI_19_OFS                               (24)                  /* PRI_19 Offset */
#define NVIC_IPR4_PRI_19_M                                 (0xff000000)          /*  */
/* NVIC_IPR5[NVIC_IPR5_PRI_20] Bits */
#define NVIC_IPR5_PRI_20_OFS                               ( 0)                  /* PRI_20 Offset */
#define NVIC_IPR5_PRI_20_M                                 (0x000000ff)          /*  */
/* NVIC_IPR5[NVIC_IPR5_PRI_21] Bits */
#define NVIC_IPR5_PRI_21_OFS                               ( 8)                  /* PRI_21 Offset */
#define NVIC_IPR5_PRI_21_M                                 (0x0000ff00)          /*  */
/* NVIC_IPR5[NVIC_IPR5_PRI_22] Bits */
#define NVIC_IPR5_PRI_22_OFS                               (16)                  /* PRI_22 Offset */
#define NVIC_IPR5_PRI_22_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR5[NVIC_IPR5_PRI_23] Bits */
#define NVIC_IPR5_PRI_23_OFS                               (24)                  /* PRI_23 Offset */
#define NVIC_IPR5_PRI_23_M                                 (0xff000000)          /*  */
/* NVIC_IPR6[NVIC_IPR6_PRI_24] Bits */
#define NVIC_IPR6_PRI_24_OFS                               ( 0)                  /* PRI_24 Offset */
#define NVIC_IPR6_PRI_24_M                                 (0x000000ff)          /*  */
/* NVIC_IPR6[NVIC_IPR6_PRI_25] Bits */
#define NVIC_IPR6_PRI_25_OFS                               ( 8)                  /* PRI_25 Offset */
#define NVIC_IPR6_PRI_25_M                                 (0x0000ff00)          /*  */
/* NVIC_IPR6[NVIC_IPR6_PRI_26] Bits */
#define NVIC_IPR6_PRI_26_OFS                               (16)                  /* PRI_26 Offset */
#define NVIC_IPR6_PRI_26_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR6[NVIC_IPR6_PRI_27] Bits */
#define NVIC_IPR6_PRI_27_OFS                               (24)                  /* PRI_27 Offset */
#define NVIC_IPR6_PRI_27_M                                 (0xff000000)          /*  */
/* NVIC_IPR7[NVIC_IPR7_PRI_28] Bits */
#define NVIC_IPR7_PRI_28_OFS                               ( 0)                  /* PRI_28 Offset */
#define NVIC_IPR7_PRI_28_M                                 (0x000000ff)          /*  */
/* NVIC_IPR7[NVIC_IPR7_PRI_29] Bits */
#define NVIC_IPR7_PRI_29_OFS                               ( 8)                  /* PRI_29 Offset */
#define NVIC_IPR7_PRI_29_M                                 (0x0000ff00)          /*  */
/* NVIC_IPR7[NVIC_IPR7_PRI_30] Bits */
#define NVIC_IPR7_PRI_30_OFS                               (16)                  /* PRI_30 Offset */
#define NVIC_IPR7_PRI_30_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR7[NVIC_IPR7_PRI_31] Bits */
#define NVIC_IPR7_PRI_31_OFS                               (24)                  /* PRI_31 Offset */
#define NVIC_IPR7_PRI_31_M                                 (0xff000000)          /*  */
/* NVIC_IPR8[NVIC_IPR8_PRI_32] Bits */
#define NVIC_IPR8_PRI_32_OFS                               ( 0)                  /* PRI_32 Offset */
#define NVIC_IPR8_PRI_32_M                                 (0x000000ff)          /*  */
/* NVIC_IPR8[NVIC_IPR8_PRI_33] Bits */
#define NVIC_IPR8_PRI_33_OFS                               ( 8)                  /* PRI_33 Offset */
#define NVIC_IPR8_PRI_33_M                                 (0x0000ff00)          /*  */
/* NVIC_IPR8[NVIC_IPR8_PRI_34] Bits */
#define NVIC_IPR8_PRI_34_OFS                               (16)                  /* PRI_34 Offset */
#define NVIC_IPR8_PRI_34_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR8[NVIC_IPR8_PRI_35] Bits */
#define NVIC_IPR8_PRI_35_OFS                               (24)                  /* PRI_35 Offset */
#define NVIC_IPR8_PRI_35_M                                 (0xff000000)          /*  */
/* NVIC_IPR9[NVIC_IPR9_PRI_36] Bits */
#define NVIC_IPR9_PRI_36_OFS                               ( 0)                  /* PRI_36 Offset */
#define NVIC_IPR9_PRI_36_M                                 (0x000000ff)          /*  */
/* NVIC_IPR9[NVIC_IPR9_PRI_37] Bits */
#define NVIC_IPR9_PRI_37_OFS                               ( 8)                  /* PRI_37 Offset */
#define NVIC_IPR9_PRI_37_M                                 (0x0000ff00)          /*  */
/* NVIC_IPR9[NVIC_IPR9_PRI_38] Bits */
#define NVIC_IPR9_PRI_38_OFS                               (16)                  /* PRI_38 Offset */
#define NVIC_IPR9_PRI_38_M                                 (0x00ff0000)          /*  */
/* NVIC_IPR9[NVIC_IPR9_PRI_39] Bits */
#define NVIC_IPR9_PRI_39_OFS                               (24)                  /* PRI_39 Offset */
#define NVIC_IPR9_PRI_39_M                                 (0xff000000)          /*  */
/* NVIC_IPR10[NVIC_IPR10_PRI_40] Bits */
#define NVIC_IPR10_PRI_40_OFS                              ( 0)                  /* PRI_40 Offset */
#define NVIC_IPR10_PRI_40_M                                (0x000000ff)          /*  */
/* NVIC_IPR10[NVIC_IPR10_PRI_41] Bits */
#define NVIC_IPR10_PRI_41_OFS                              ( 8)                  /* PRI_41 Offset */
#define NVIC_IPR10_PRI_41_M                                (0x0000ff00)          /*  */
/* NVIC_IPR10[NVIC_IPR10_PRI_42] Bits */
#define NVIC_IPR10_PRI_42_OFS                              (16)                  /* PRI_42 Offset */
#define NVIC_IPR10_PRI_42_M                                (0x00ff0000)          /*  */
/* NVIC_IPR10[NVIC_IPR10_PRI_43] Bits */
#define NVIC_IPR10_PRI_43_OFS                              (24)                  /* PRI_43 Offset */
#define NVIC_IPR10_PRI_43_M                                (0xff000000)          /*  */
/* NVIC_IPR11[NVIC_IPR11_PRI_44] Bits */
#define NVIC_IPR11_PRI_44_OFS                              ( 0)                  /* PRI_44 Offset */
#define NVIC_IPR11_PRI_44_M                                (0x000000ff)          /*  */
/* NVIC_IPR11[NVIC_IPR11_PRI_45] Bits */
#define NVIC_IPR11_PRI_45_OFS                              ( 8)                  /* PRI_45 Offset */
#define NVIC_IPR11_PRI_45_M                                (0x0000ff00)          /*  */
/* NVIC_IPR11[NVIC_IPR11_PRI_46] Bits */
#define NVIC_IPR11_PRI_46_OFS                              (16)                  /* PRI_46 Offset */
#define NVIC_IPR11_PRI_46_M                                (0x00ff0000)          /*  */
/* NVIC_IPR11[NVIC_IPR11_PRI_47] Bits */
#define NVIC_IPR11_PRI_47_OFS                              (24)                  /* PRI_47 Offset */
#define NVIC_IPR11_PRI_47_M                                (0xff000000)          /*  */
/* NVIC_IPR12[NVIC_IPR12_PRI_48] Bits */
#define NVIC_IPR12_PRI_48_OFS                              ( 0)                  /* PRI_48 Offset */
#define NVIC_IPR12_PRI_48_M                                (0x000000ff)          /*  */
/* NVIC_IPR12[NVIC_IPR12_PRI_49] Bits */
#define NVIC_IPR12_PRI_49_OFS                              ( 8)                  /* PRI_49 Offset */
#define NVIC_IPR12_PRI_49_M                                (0x0000ff00)          /*  */
/* NVIC_IPR12[NVIC_IPR12_PRI_50] Bits */
#define NVIC_IPR12_PRI_50_OFS                              (16)                  /* PRI_50 Offset */
#define NVIC_IPR12_PRI_50_M                                (0x00ff0000)          /*  */
/* NVIC_IPR12[NVIC_IPR12_PRI_51] Bits */
#define NVIC_IPR12_PRI_51_OFS                              (24)                  /* PRI_51 Offset */
#define NVIC_IPR12_PRI_51_M                                (0xff000000)          /*  */
/* NVIC_IPR13[NVIC_IPR13_PRI_52] Bits */
#define NVIC_IPR13_PRI_52_OFS                              ( 0)                  /* PRI_52 Offset */
#define NVIC_IPR13_PRI_52_M                                (0x000000ff)          /*  */
/* NVIC_IPR13[NVIC_IPR13_PRI_53] Bits */
#define NVIC_IPR13_PRI_53_OFS                              ( 8)                  /* PRI_53 Offset */
#define NVIC_IPR13_PRI_53_M                                (0x0000ff00)          /*  */
/* NVIC_IPR13[NVIC_IPR13_PRI_54] Bits */
#define NVIC_IPR13_PRI_54_OFS                              (16)                  /* PRI_54 Offset */
#define NVIC_IPR13_PRI_54_M                                (0x00ff0000)          /*  */
/* NVIC_IPR13[NVIC_IPR13_PRI_55] Bits */
#define NVIC_IPR13_PRI_55_OFS                              (24)                  /* PRI_55 Offset */
#define NVIC_IPR13_PRI_55_M                                (0xff000000)          /*  */
/* NVIC_IPR14[NVIC_IPR14_PRI_56] Bits */
#define NVIC_IPR14_PRI_56_OFS                              ( 0)                  /* PRI_56 Offset */
#define NVIC_IPR14_PRI_56_M                                (0x000000ff)          /*  */
/* NVIC_IPR14[NVIC_IPR14_PRI_57] Bits */
#define NVIC_IPR14_PRI_57_OFS                              ( 8)                  /* PRI_57 Offset */
#define NVIC_IPR14_PRI_57_M                                (0x0000ff00)          /*  */
/* NVIC_IPR14[NVIC_IPR14_PRI_58] Bits */
#define NVIC_IPR14_PRI_58_OFS                              (16)                  /* PRI_58 Offset */
#define NVIC_IPR14_PRI_58_M                                (0x00ff0000)          /*  */
/* NVIC_IPR14[NVIC_IPR14_PRI_59] Bits */
#define NVIC_IPR14_PRI_59_OFS                              (24)                  /* PRI_59 Offset */
#define NVIC_IPR14_PRI_59_M                                (0xff000000)          /*  */
/* NVIC_IPR15[NVIC_IPR15_PRI_60] Bits */
#define NVIC_IPR15_PRI_60_OFS                              ( 0)                  /* PRI_60 Offset */
#define NVIC_IPR15_PRI_60_M                                (0x000000ff)          /*  */
/* NVIC_IPR15[NVIC_IPR15_PRI_61] Bits */
#define NVIC_IPR15_PRI_61_OFS                              ( 8)                  /* PRI_61 Offset */
#define NVIC_IPR15_PRI_61_M                                (0x0000ff00)          /*  */
/* NVIC_IPR15[NVIC_IPR15_PRI_62] Bits */
#define NVIC_IPR15_PRI_62_OFS                              (16)                  /* PRI_62 Offset */
#define NVIC_IPR15_PRI_62_M                                (0x00ff0000)          /*  */
/* NVIC_IPR15[NVIC_IPR15_PRI_63] Bits */
#define NVIC_IPR15_PRI_63_OFS                              (24)                  /* PRI_63 Offset */
#define NVIC_IPR15_PRI_63_M                                (0xff000000)          /*  */
/* NVIC_STIR[NVIC_STIR_INTID] Bits */
#define NVIC_STIR_INTID_OFS                                ( 0)                  /* INTID Offset */
#define NVIC_STIR_INTID_M                                  (0x000001ff)          /*  */


