helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
/***************************************************************************
// PCM Bits
/***************************************************************************
/* PCMCTL0[AMR] Bits */
#define AMR_OFS                                            ( 0)                  /* AMR Offset */
#define AMR_M                                              (0x0000000f)          /* Active Mode Request */
#define AMR0                                               (0x00000001)          /* Active Mode Request */
#define AMR1                                               (0x00000002)          /* Active Mode Request */
#define AMR2                                               (0x00000004)          /* Active Mode Request */
#define AMR3                                               (0x00000008)          /* Active Mode Request */
#define AMR_0                                              (0x00000000)          /* LDO based Active Mode at Core voltage setting 0. */
#define AMR_1                                              (0x00000001)          /* LDO based Active Mode at Core voltage setting 1. */
#define AMR_4                                              (0x00000004)          /* DC-DC based Active Mode at Core voltage setting 0. */
#define AMR_5                                              (0x00000005)          /* DC-DC based Active Mode at Core voltage setting 1. */
#define AMR_8                                              (0x00000008)          /* Low-Frequency Active Mode at Core voltage setting 0. */
#define AMR_9                                              (0x00000009)          /* Low-Frequency Active Mode at Core voltage setting 1. */
#define AMR__AM_LDO_VCORE0                                 (0x00000000)          /* LDO based Active Mode at Core voltage setting 0. */
#define AMR__AM_LDO_VCORE1                                 (0x00000001)          /* LDO based Active Mode at Core voltage setting 1. */
#define AMR__AM_DCDC_VCORE0                                (0x00000004)          /* DC-DC based Active Mode at Core voltage setting 0. */
#define AMR__AM_DCDC_VCORE1                                (0x00000005)          /* DC-DC based Active Mode at Core voltage setting 1. */
#define AMR__AM_LF_VCORE0                                  (0x00000008)          /* Low-Frequency Active Mode at Core voltage setting 0. */
#define AMR__AM_LF_VCORE1                                  (0x00000009)          /* Low-Frequency Active Mode at Core voltage setting 1. */
/* PCMCTL0[LPMR] Bits */
#define LPMR_OFS                                           ( 4)                  /* LPMR Offset */
#define LPMR_M                                             (0x000000f0)          /* Low Power Mode Request */
#define LPMR0                                              (0x00000010)          /* Low Power Mode Request */
#define LPMR1                                              (0x00000020)          /* Low Power Mode Request */
#define LPMR2                                              (0x00000040)          /* Low Power Mode Request */
#define LPMR3                                              (0x00000080)          /* Low Power Mode Request */
#define LPMR_0                                             (0x00000000)          /* LPM3. Core voltage setting is similar to the mode from which LPM3 is entered. */
#define LPMR_10                                            (0x000000a0)          /* LPM3.5. Core voltage setting 0. */
#define LPMR_12                                            (0x000000c0)          /* LPM4.5 */
#define LPMR__LPM3                                         (0x00000000)          /* LPM3. Core voltage setting is similar to the mode from which LPM3 is entered. */
#define LPMR__LPM35                                        (0x000000a0)          /* LPM3.5. Core voltage setting 0. */
#define LPMR__LPM45                                        (0x000000c0)          /* LPM4.5 */
/* PCMCTL0[CPM] Bits */
#define CPM_OFS                                            ( 8)                  /* CPM Offset */
#define CPM_M                                              (0x00003f00)          /* Current Power Mode */
#define CPM0                                               (0x00000100)          /* Current Power Mode */
#define CPM1                                               (0x00000200)          /* Current Power Mode */
#define CPM2                                               (0x00000400)          /* Current Power Mode */
#define CPM3                                               (0x00000800)          /* Current Power Mode */
#define CPM4                                               (0x00001000)          /* Current Power Mode */
#define CPM5                                               (0x00002000)          /* Current Power Mode */
#define CPM_0                                              (0x00000000)          /* LDO based Active Mode at Core voltage setting 0. */
#define CPM_1                                              (0x00000100)          /* LDO based Active Mode at Core voltage setting 1. */
#define CPM_4                                              (0x00000400)          /* DC-DC based Active Mode at Core voltage setting 0. */
#define CPM_5                                              (0x00000500)          /* DC-DC based Active Mode at Core voltage setting 1. */
#define CPM_8                                              (0x00000800)          /* Low-Frequency Active Mode at Core voltage setting 0. */
#define CPM_9                                              (0x00000900)          /* Low-Frequency Active Mode at Core voltage setting 1. */
#define CPM_16                                             (0x00001000)          /* LDO based LPM0 at Core voltage setting 0. */
#define CPM_17                                             (0x00001100)          /* LDO based LPM0 at Core voltage setting 1. */
#define CPM_20                                             (0x00001400)          /* DC-DC based LPM0 at Core voltage setting 0. */
#define CPM_21                                             (0x00001500)          /* DC-DC based LPM0 at Core voltage setting 1. */
#define CPM_24                                             (0x00001800)          /* Low-Frequency LPM0 at Core voltage setting 0. */
#define CPM_25                                             (0x00001900)          /* Low-Frequency LPM0 at Core voltage setting 1. */
#define CPM_32                                             (0x00002000)          /* LPM3 */
#define CPM__AM_LDO_VCORE0                                 (0x00000000)          /* LDO based Active Mode at Core voltage setting 0. */
#define CPM__AM_LDO_VCORE1                                 (0x00000100)          /* LDO based Active Mode at Core voltage setting 1. */
#define CPM__AM_DCDC_VCORE0                                (0x00000400)          /* DC-DC based Active Mode at Core voltage setting 0. */
#define CPM__AM_DCDC_VCORE1                                (0x00000500)          /* DC-DC based Active Mode at Core voltage setting 1. */
#define CPM__AM_LF_VCORE0                                  (0x00000800)          /* Low-Frequency Active Mode at Core voltage setting 0. */
#define CPM__AM_LF_VCORE1                                  (0x00000900)          /* Low-Frequency Active Mode at Core voltage setting 1. */
#define CPM__LPM0_LDO_VCORE0                               (0x00001000)          /* LDO based LPM0 at Core voltage setting 0. */
#define CPM__LPM0_LDO_VCORE1                               (0x00001100)          /* LDO based LPM0 at Core voltage setting 1. */
#define CPM__LPM0_DCDC_VCORE0                              (0x00001400)          /* DC-DC based LPM0 at Core voltage setting 0. */
#define CPM__LPM0_DCDC_VCORE1                              (0x00001500)          /* DC-DC based LPM0 at Core voltage setting 1. */
#define CPM__LPM0_LF_VCORE0                                (0x00001800)          /* Low-Frequency LPM0 at Core voltage setting 0. */
#define CPM__LPM0_LF_VCORE1                                (0x00001900)          /* Low-Frequency LPM0 at Core voltage setting 1. */
#define CPM__LPM3                                          (0x00002000)          /* LPM3 */
/* PCMCTL0[PCMKEY] Bits */
#define PCMKEY_OFS                                         (16)                  /* PCMKEY Offset */
#define PCMKEY_M                                           (0xffff0000)          /* PCM key */
/* PCMCTL1[LOCKLPM5] Bits */
#define LOCKLPM5_OFS                                       ( 0)                  /* LOCKLPM5 Offset */
#define LOCKLPM5                                           (0x00000001)          /* Lock LPM5 */
/* PCMCTL1[LOCKBKUP] Bits */
#define LOCKBKUP_OFS                                       ( 1)                  /* LOCKBKUP Offset */
#define LOCKBKUP                                           (0x00000002)          /* Lock Backup */
/* PCMCTL1[FORCE_LPM_ENTRY] Bits */
#define FORCE_LPM_ENTRY_OFS                                ( 2)                  /* FORCE_LPM_ENTRY Offset */
#define FORCE_LPM_ENTRY                                    (0x00000004)          /* Force LPM entry */
/* PCMCTL1[PMR_BUSY] Bits */
#define PMR_BUSY_OFS                                       ( 8)                  /* PMR_BUSY Offset */
#define PMR_BUSY                                           (0x00000100)          /* Power mode request busy flag */
/* PCMCTL1[PCMKEY] Bits */
//#define PCMKEY_OFS                                         (16)                  /* PCMKEY Offset */
//#define PCMKEY_M                                           (0xffff0000)          /* PCM key */
/* PCMIE[LPM_INVALID_TR_IE] Bits */
#define LPM_INVALID_TR_IE_OFS                              ( 0)                  /* LPM_INVALID_TR_IE Offset */
#define LPM_INVALID_TR_IE                                  (0x00000001)          /* LPM invalid transition interrupt enable */
/* PCMIE[LPM_INVALID_CLK_IE] Bits */
#define LPM_INVALID_CLK_IE_OFS                             ( 1)                  /* LPM_INVALID_CLK_IE Offset */
#define LPM_INVALID_CLK_IE                                 (0x00000002)          /* LPM invalid clock interrupt enable */
/* PCMIE[AM_INVALID_TR_IE] Bits */
#define AM_INVALID_TR_IE_OFS                               ( 2)                  /* AM_INVALID_TR_IE Offset */
#define AM_INVALID_TR_IE                                   (0x00000004)          /* Active mode invalid transition interrupt enable */
/* PCMIE[DCDC_ERROR_IE] Bits */
#define DCDC_ERROR_IE_OFS                                  ( 6)                  /* DCDC_ERROR_IE Offset */
#define DCDC_ERROR_IE                                      (0x00000040)          /* DC-DC error interrupt enable */
/* PCMIFG[LPM_INVALID_TR_IFG] Bits */
#define LPM_INVALID_TR_IFG_OFS                             ( 0)                  /* LPM_INVALID_TR_IFG Offset */
#define LPM_INVALID_TR_IFG                                 (0x00000001)          /* LPM invalid transition flag */
/* PCMIFG[LPM_INVALID_CLK_IFG] Bits */
#define LPM_INVALID_CLK_IFG_OFS                            ( 1)                  /* LPM_INVALID_CLK_IFG Offset */
#define LPM_INVALID_CLK_IFG                                (0x00000002)          /* LPM invalid clock flag */
/* PCMIFG[AM_INVALID_TR_IFG] Bits */
#define AM_INVALID_TR_IFG_OFS                              ( 2)                  /* AM_INVALID_TR_IFG Offset */
#define AM_INVALID_TR_IFG                                  (0x00000004)          /* Active mode invalid transition flag */
/* PCMIFG[DCDC_ERROR_IFG] Bits */
#define DCDC_ERROR_IFG_OFS                                 ( 6)                  /* DCDC_ERROR_IFG Offset */
#define DCDC_ERROR_IFG                                     (0x00000040)          /* DC-DC error flag */
/* PCMCLRIFG[CLR_LPM_INVALID_TR_IFG] Bits */
#define CLR_LPM_INVALID_TR_IFG_OFS                         ( 0)                  /* CLR_LPM_INVALID_TR_IFG Offset */
#define CLR_LPM_INVALID_TR_IFG                             (0x00000001)          /* Clear LPM invalid transition flag */
/* PCMCLRIFG[CLR_LPM_INVALID_CLK_IFG] Bits */
#define CLR_LPM_INVALID_CLK_IFG_OFS                        ( 1)                  /* CLR_LPM_INVALID_CLK_IFG Offset */
#define CLR_LPM_INVALID_CLK_IFG                            (0x00000002)          /* Clear LPM invalid clock flag */
/* PCMCLRIFG[CLR_AM_INVALID_TR_IFG] Bits */
#define CLR_AM_INVALID_TR_IFG_OFS                          ( 2)                  /* CLR_AM_INVALID_TR_IFG Offset */
#define CLR_AM_INVALID_TR_IFG                              (0x00000004)          /* Clear active mode invalid transition flag */
/* PCMCLRIFG[CLR_DCDC_ERROR_IFG] Bits */
#define CLR_DCDC_ERROR_IFG_OFS                             ( 6)                  /* CLR_DCDC_ERROR_IFG Offset */
#define CLR_DCDC_ERROR_IFG                                 (0x00000040)          /* Clear DC-DC error flag */

/* Pre-defined bitfield values */
#define PCM_PMR_KEY_VAL                                    (0x695A0000)          /* PCM key value */
#define PCM_CTL_KEY_VAL                                    (0x695A0000)          /* PCM key value */


/***************************************************************************
// PMAP Bits
/***************************************************************************
/* PMAPCTL[PMAPLOCKED] Bits */
#define PMAPLOCKED_OFS                                     ( 0)                  /* PMAPLOCKED Offset */
#define PMAPLOCKED                                         (0x0001)              /* Port mapping lock bit */
/* PMAPCTL[PMAPRECFG] Bits */
#define PMAPRECFG_OFS                                      ( 1)                  /* PMAPRECFG Offset */
#define PMAPRECFG                                          (0x0002)              /* Port mapping reconfiguration control bit */

/* Pre-defined bitfield values */
#define PM_NONE                                            0
#define PM_UCA0CLK                                         1
#define PM_UCA0RXD                                         2
#define PM_UCA0SOMI                                        2
#define PM_UCA0TXD                                         3
#define PM_UCA0SIMO                                        3
#define PM_UCB0CLK                                         4
#define PM_UCB0SDA                                         5
#define PM_UCB0SIMO                                        5
#define PM_UCB0SCL                                         6
#define PM_UCB0SOMI                                        6
#define PM_UCA1STE                                         7 
#define PM_UCA1CLK                                         8
#define PM_UCA1RXD                                         9
#define PM_UCA1SOMI                                        9
#define PM_UCA1TXD                                         10
#define PM_UCA1SIMO                                        10
#define PM_UCA2STE                                         11
#define PM_UCA2CLK                                         12
#define PM_UCA2RXD                                         13
#define PM_UCA2SOMI                                        13
#define PM_UCA2TXD                                         14
#define PM_UCA2SIMO                                        14
#define PM_UCB2STE                                         15
#define PM_UCB2CLK                                         16
#define PM_UCB2SDA                                         17
#define PM_UCB2SIMO                                        17
#define PM_UCB2SCL                                         18
#define PM_UCB2SOMI                                        18
#define PM_TA0CCR0A                                        19
#define PM_TA0CCR1A                                        20
#define PM_TA0CCR2A                                        21
#define PM_TA0CCR3A                                        22
#define PM_TA0CCR4A                                        23
#define PM_TA1CCR1A                                        24
#define PM_TA1CCR2A                                        25
#define PM_TA1CCR3A                                        26
#define PM_TA1CCR4A                                        27
#define PM_TA0CLK                                          28
#define PM_CE0OUT                                          28
#define PM_TA1CLK                                          29
#define PM_CE1OUT                                          29
#define PM_DMAE0                                           30
#define PM_SMCLK                                           30
#define PM_ANALOG                                          31

#define PMAP_KEYID_VAL                                     (0x2D52)              /* Port mapping controller write access key */
 

/***************************************************************************
// PSS Bits
/***************************************************************************
/* PSSKEY[PSSKEY] Bits */
#define PSSKEY_OFS                                         ( 0)                  /* PSSKEY Offset */
#define PSSKEY_M                                           (0x0000ffff)          /* PSS control key */
/* PSSCTL0[SVSMHOFF] Bits */
#define SVSMHOFF_OFS                                       ( 0)                  /* SVSMHOFF Offset */
#define SVSMHOFF                                           (0x00000001)          /* SVSM high-side off */
/* PSSCTL0[SVSMHLP] Bits */
#define SVSMHLP_OFS                                        ( 1)                  /* SVSMHLP Offset */
#define SVSMHLP                                            (0x00000002)          /* SVSM high-side low power normal performance mode */
/* PSSCTL0[SVSMHS] Bits */
#define SVSMHS_OFS                                         ( 2)                  /* SVSMHS Offset */
#define SVSMHS                                             (0x00000004)          /* Supply supervisor or monitor selection for the high-side */
/* PSSCTL0[SVSMHTH] Bits */
#define SVSMHTH_OFS                                        ( 3)                  /* SVSMHTH Offset */
#define SVSMHTH_M                                          (0x00000038)          /* SVSM high-side reset voltage level */
/* PSSCTL0[SVMHOE] Bits */
#define SVMHOE_OFS                                         ( 6)                  /* SVMHOE Offset */
#define SVMHOE                                             (0x00000040)          /* SVSM high-side output enable */
/* PSSCTL0[SVMHOUTPOLAL] Bits */
#define SVMHOUTPOLAL_OFS                                   ( 7)                  /* SVMHOUTPOLAL Offset */
#define SVMHOUTPOLAL                                       (0x00000080)          /* SVMHOUT pin polarity active low */
/* PSSCTL0[SVSLOFF] Bits */
#define SVSLOFF_OFS                                        ( 8)                  /* SVSLOFF Offset */
#define SVSLOFF                                            (0x00000100)          /* SVS low-side off */
/* PSSCTL0[SVSLLP] Bits */
#define SVSLLP_OFS                                         ( 9)                  /* SVSLLP Offset */
#define SVSLLP                                             (0x00000200)          /* SVS low-side low power normal performance mode */
/* PSSCTL0[DCDC_FORCE] Bits */
#define DCDC_FORCE_OFS                                     (10)                  /* DCDC_FORCE Offset */
#define DCDC_FORCE                                         (0x00000400)          /* Disables automatic supply voltage detection */
/* PSSCTL0[VCORETRAN] Bits */
#define VCORETRAN_OFS                                      (12)                  /* VCORETRAN Offset */
#define VCORETRAN_M                                        (0x00003000)          /* Controls VCORE Level Transition time */
#define VCORETRAN0                                         (0x00001000)          /* Controls VCORE Level Transition time */
#define VCORETRAN1                                         (0x00002000)          /* Controls VCORE Level Transition time */
#define VCORETRAN_0                                        (0x00000000)          /* 32 ?s / 100 mV */
#define VCORETRAN_1                                        (0x00001000)          /* 64 ?s / 100 mV */
#define VCORETRAN_2                                        (0x00002000)          /* 128 ?s / 100 mV (default) */
#define VCORETRAN_3                                        (0x00003000)          /* 256 ?s / 100 mV */
#define VCORETRAN__32                                      (0x00000000)          /* 32 ?s / 100 mV */
#define VCORETRAN__64                                      (0x00001000)          /* 64 ?s / 100 mV */
#define VCORETRAN__128                                     (0x00002000)          /* 128 ?s / 100 mV (default) */
#define VCORETRAN__256                                     (0x00003000)          /* 256 ?s / 100 mV */
/* PSSIE[SVSMHIE] Bits */
#define SVSMHIE_OFS                                        ( 1)                  /* SVSMHIE Offset */
#define SVSMHIE                                            (0x00000002)          /* High-side SVSM interrupt enable */
/* PSSIFG[SVSMHIFG] Bits */
#define SVSMHIFG_OFS                                       ( 1)                  /* SVSMHIFG Offset */
#define SVSMHIFG                                           (0x00000002)          /* High-side SVSM interrupt flag */
/* PSSCLRIFG[CLRSVSMHIFG] Bits */
#define CLRSVSMHIFG_OFS                                    ( 1)                  /* CLRSVSMHIFG Offset */
#define CLRSVSMHIFG                                        (0x00000002)          /* SVSMH clear interrupt flag */

/* Pre-defined bitfield values */
#define PSS_KEY_KEY_VAL                                    (0x0000695A)          /* PSS control key value */


