helder0xff/trxos/trxos_test/lib/bootloader/lib/temp_Target/inc/msp432p401r_b.h
//#define DAYLOWDIGIT_OFS                                    ( 8)                  /* DayLowDigit Offset */
//#define DAYLOWDIGIT_M                                      (0x0f00)              /* Day of month ? low digit (0 to 9) */
/* RTCADOWDAY_BCD[DAYHIGHDIGIT] Bits */
//#define DAYHIGHDIGIT_OFS                                   (12)                  /* DayHighDigit Offset */
//#define DAYHIGHDIGIT_M                                     (0x3000)              /* Day of month ? high digit (0 to 3) */
/* RTCADOWDAY_BCD[DAYAE] Bits */
//#define DAYAE_OFS                                          (15)                  /* DAYAE Offset */
//#define DAYAE                                              (0x8000)              /* Alarm enable */

/* Pre-defined bitfield values */
#define RTCKEY                                              (0xA500)              /* RTC_C Key Value for RTC_C write access */
#define RTCKEY_H                                            (0x00A5)              /* RTC_C Key Value for RTC_C write access */
#define RTCKEY_VAL                                          (0xA500)              /* RTC_C Key Value for RTC_C write access */


/***************************************************************************
// SCB Bits
/***************************************************************************
/* SCB_CPUID[SCB_CPUID_REVISION] Bits */
#define SCB_CPUID_REVISION_OFS                             ( 0)                  /* REVISION Offset */
#define SCB_CPUID_REVISION_M                               (0x0000000f)          /*  */
/* SCB_CPUID[SCB_CPUID_PARTNO] Bits */
#define SCB_CPUID_PARTNO_OFS                               ( 4)                  /* PARTNO Offset */
#define SCB_CPUID_PARTNO_M                                 (0x0000fff0)          /*  */
/* SCB_CPUID[SCB_CPUID_CONSTANT] Bits */
#define SCB_CPUID_CONSTANT_OFS                             (16)                  /* CONSTANT Offset */
#define SCB_CPUID_CONSTANT_M                               (0x000f0000)          /*  */
/* SCB_CPUID[SCB_CPUID_VARIANT] Bits */
#define SCB_CPUID_VARIANT_OFS                              (20)                  /* VARIANT Offset */
#define SCB_CPUID_VARIANT_M                                (0x00f00000)          /*  */
/* SCB_CPUID[SCB_CPUID_IMPLEMENTER] Bits */
#define SCB_CPUID_IMPLEMENTER_OFS                          (24)                  /* IMPLEMENTER Offset */
#define SCB_CPUID_IMPLEMENTER_M                            (0xff000000)          /*  */
/* SCB_ICSR[SCB_ICSR_VECTACTIVE] Bits */
#define SCB_ICSR_VECTACTIVE_OFS                            ( 0)                  /* VECTACTIVE Offset */
#define SCB_ICSR_VECTACTIVE_M                              (0x000001ff)          /*  */
/* SCB_ICSR[SCB_ICSR_RETTOBASE] Bits */
#define SCB_ICSR_RETTOBASE_OFS                             (11)                  /* RETTOBASE Offset */
#define SCB_ICSR_RETTOBASE                                 (0x00000800)          /*  */
/* SCB_ICSR[SCB_ICSR_VECTPENDING] Bits */
#define SCB_ICSR_VECTPENDING_OFS                           (12)                  /* VECTPENDING Offset */
#define SCB_ICSR_VECTPENDING_M                             (0x0003f000)          /*  */
/* SCB_ICSR[SCB_ICSR_ISRPENDING] Bits */
#define SCB_ICSR_ISRPENDING_OFS                            (22)                  /* ISRPENDING Offset */
#define SCB_ICSR_ISRPENDING                                (0x00400000)          /*  */
/* SCB_ICSR[SCB_ICSR_ISRPREEMPT] Bits */
#define SCB_ICSR_ISRPREEMPT_OFS                            (23)                  /* ISRPREEMPT Offset */
#define SCB_ICSR_ISRPREEMPT                                (0x00800000)          /*  */
/* SCB_ICSR[SCB_ICSR_PENDSTCLR] Bits */
#define SCB_ICSR_PENDSTCLR_OFS                             (25)                  /* PENDSTCLR Offset */
#define SCB_ICSR_PENDSTCLR                                 (0x02000000)          /*  */
/* SCB_ICSR[SCB_ICSR_PENDSTSET] Bits */
#define SCB_ICSR_PENDSTSET_OFS                             (26)                  /* PENDSTSET Offset */
#define SCB_ICSR_PENDSTSET                                 (0x04000000)          /*  */
/* SCB_ICSR[SCB_ICSR_PENDSVCLR] Bits */
#define SCB_ICSR_PENDSVCLR_OFS                             (27)                  /* PENDSVCLR Offset */
#define SCB_ICSR_PENDSVCLR                                 (0x08000000)          /*  */
/* SCB_ICSR[SCB_ICSR_PENDSVSET] Bits */
#define SCB_ICSR_PENDSVSET_OFS                             (28)                  /* PENDSVSET Offset */
#define SCB_ICSR_PENDSVSET                                 (0x10000000)          /*  */
/* SCB_ICSR[SCB_ICSR_NMIPENDSET] Bits */
#define SCB_ICSR_NMIPENDSET_OFS                            (31)                  /* NMIPENDSET Offset */
#define SCB_ICSR_NMIPENDSET                                (0x80000000)          /*  */
/* SCB_VTOR[SCB_VTOR_TBLOFF] Bits */
#define SCB_VTOR_TBLOFF_OFS                                ( 7)                  /* TBLOFF Offset */
#define SCB_VTOR_TBLOFF_M                                  (0x1fffff80)          /*  */
/* SCB_VTOR[SCB_VTOR_TBLBASE] Bits */
#define SCB_VTOR_TBLBASE_OFS                               (29)                  /* TBLBASE Offset */
#define SCB_VTOR_TBLBASE                                   (0x20000000)          /*  */
/* SCB_AIRCR[SCB_AIRCR_VECTRESET] Bits */
#define SCB_AIRCR_VECTRESET_OFS                            ( 0)                  /* VECTRESET Offset */
#define SCB_AIRCR_VECTRESET                                (0x00000001)          /*  */
/* SCB_AIRCR[SCB_AIRCR_VECTCLRACTIVE] Bits */
#define SCB_AIRCR_VECTCLRACTIVE_OFS                        ( 1)                  /* VECTCLRACTIVE Offset */
#define SCB_AIRCR_VECTCLRACTIVE                            (0x00000002)          /*  */
/* SCB_AIRCR[SCB_AIRCR_SYSRESETREQ] Bits */
#define SCB_AIRCR_SYSRESETREQ_OFS                          ( 2)                  /* SYSRESETREQ Offset */
#define SCB_AIRCR_SYSRESETREQ                              (0x00000004)          /*  */
/* SCB_AIRCR[SCB_AIRCR_PRIGROUP] Bits */
#define SCB_AIRCR_PRIGROUP_OFS                             ( 8)                  /* PRIGROUP Offset */
#define SCB_AIRCR_PRIGROUP_M                               (0x00000700)          /*  */
/* SCB_AIRCR[SCB_AIRCR_ENDIANESS] Bits */
#define SCB_AIRCR_ENDIANESS_OFS                            (15)                  /* ENDIANESS Offset */
#define SCB_AIRCR_ENDIANESS                                (0x00008000)          /*  */
/* SCB_AIRCR[SCB_AIRCR_VECTKEY] Bits */
#define SCB_AIRCR_VECTKEY_OFS                              (16)                  /* VECTKEY Offset */
#define SCB_AIRCR_VECTKEY_M                                (0xffff0000)          /*  */
/* SCB_SCR[SCB_SCR_SLEEPONEXIT] Bits */
#define SCB_SCR_SLEEPONEXIT_OFS                            ( 1)                  /* SLEEPONEXIT Offset */
#define SCB_SCR_SLEEPONEXIT                                (0x00000002)          /*  */
/* SCB_SCR[SCB_SCR_SLEEPDEEP] Bits */
#define SCB_SCR_SLEEPDEEP_OFS                              ( 2)                  /* SLEEPDEEP Offset */
#define SCB_SCR_SLEEPDEEP                                  (0x00000004)          /*  */
/* SCB_SCR[SCB_SCR_SEVONPEND] Bits */
#define SCB_SCR_SEVONPEND_OFS                              ( 4)                  /* SEVONPEND Offset */
#define SCB_SCR_SEVONPEND                                  (0x00000010)          /*  */
/* SCB_CCR[SCB_CCR_NONBASETHREDENA] Bits */
#define SCB_CCR_NONBASETHREDENA_OFS                        ( 0)                  /* NONBASETHREDENA Offset */
#define SCB_CCR_NONBASETHREDENA                            (0x00000001)          /*  */
/* SCB_CCR[SCB_CCR_USERSETMPEND] Bits */
#define SCB_CCR_USERSETMPEND_OFS                           ( 1)                  /* USERSETMPEND Offset */
#define SCB_CCR_USERSETMPEND                               (0x00000002)          /*  */
/* SCB_CCR[SCB_CCR_UNALIGN_TRP] Bits */
#define SCB_CCR_UNALIGN_TRP_OFS                            ( 3)                  /* UNALIGN_TRP Offset */
#define SCB_CCR_UNALIGN_TRP                                (0x00000008)          /*  */
/* SCB_CCR[SCB_CCR_DIV_0_TRP] Bits */
#define SCB_CCR_DIV_0_TRP_OFS                              ( 4)                  /* DIV_0_TRP Offset */
#define SCB_CCR_DIV_0_TRP                                  (0x00000010)          /*  */
/* SCB_CCR[SCB_CCR_BFHFNMIGN] Bits */
#define SCB_CCR_BFHFNMIGN_OFS                              ( 8)                  /* BFHFNMIGN Offset */
#define SCB_CCR_BFHFNMIGN                                  (0x00000100)          /*  */
/* SCB_CCR[SCB_CCR_STKALIGN] Bits */
#define SCB_CCR_STKALIGN_OFS                               ( 9)                  /* STKALIGN Offset */
#define SCB_CCR_STKALIGN                                   (0x00000200)          /*  */
/* SCB_SHPR1[SCB_SHPR1_PRI_4] Bits */
#define SCB_SHPR1_PRI_4_OFS                                ( 0)                  /* PRI_4 Offset */
#define SCB_SHPR1_PRI_4_M                                  (0x000000ff)          /*  */
/* SCB_SHPR1[SCB_SHPR1_PRI_5] Bits */
#define SCB_SHPR1_PRI_5_OFS                                ( 8)                  /* PRI_5 Offset */
#define SCB_SHPR1_PRI_5_M                                  (0x0000ff00)          /*  */
/* SCB_SHPR1[SCB_SHPR1_PRI_6] Bits */
#define SCB_SHPR1_PRI_6_OFS                                (16)                  /* PRI_6 Offset */
#define SCB_SHPR1_PRI_6_M                                  (0x00ff0000)          /*  */
/* SCB_SHPR1[SCB_SHPR1_PRI_7] Bits */
#define SCB_SHPR1_PRI_7_OFS                                (24)                  /* PRI_7 Offset */
#define SCB_SHPR1_PRI_7_M                                  (0xff000000)          /*  */
/* SCB_SHPR2[SCB_SHPR2_PRI_8] Bits */
#define SCB_SHPR2_PRI_8_OFS                                ( 0)                  /* PRI_8 Offset */
#define SCB_SHPR2_PRI_8_M                                  (0x000000ff)          /*  */
/* SCB_SHPR2[SCB_SHPR2_PRI_9] Bits */
#define SCB_SHPR2_PRI_9_OFS                                ( 8)                  /* PRI_9 Offset */
#define SCB_SHPR2_PRI_9_M                                  (0x0000ff00)          /*  */
/* SCB_SHPR2[SCB_SHPR2_PRI_10] Bits */
#define SCB_SHPR2_PRI_10_OFS                               (16)                  /* PRI_10 Offset */
#define SCB_SHPR2_PRI_10_M                                 (0x00ff0000)          /*  */
/* SCB_SHPR2[SCB_SHPR2_PRI_11] Bits */
#define SCB_SHPR2_PRI_11_OFS                               (24)                  /* PRI_11 Offset */
#define SCB_SHPR2_PRI_11_M                                 (0xff000000)          /*  */
/* SCB_SHPR3[SCB_SHPR3_PRI_12] Bits */
#define SCB_SHPR3_PRI_12_OFS                               ( 0)                  /* PRI_12 Offset */
#define SCB_SHPR3_PRI_12_M                                 (0x000000ff)          /*  */
/* SCB_SHPR3[SCB_SHPR3_PRI_13] Bits */
#define SCB_SHPR3_PRI_13_OFS                               ( 8)                  /* PRI_13 Offset */
#define SCB_SHPR3_PRI_13_M                                 (0x0000ff00)          /*  */
/* SCB_SHPR3[SCB_SHPR3_PRI_14] Bits */
#define SCB_SHPR3_PRI_14_OFS                               (16)                  /* PRI_14 Offset */
#define SCB_SHPR3_PRI_14_M                                 (0x00ff0000)          /*  */
/* SCB_SHPR3[SCB_SHPR3_PRI_15] Bits */
#define SCB_SHPR3_PRI_15_OFS                               (24)                  /* PRI_15 Offset */
#define SCB_SHPR3_PRI_15_M                                 (0xff000000)          /*  */
/* SCB_SHCSR[SCB_SHCSR_MEMFAULTACT] Bits */
#define SCB_SHCSR_MEMFAULTACT_OFS                          ( 0)                  /* MEMFAULTACT Offset */
#define SCB_SHCSR_MEMFAULTACT                              (0x00000001)          /*  */
/* SCB_SHCSR[SCB_SHCSR_BUSFAULTACT] Bits */
#define SCB_SHCSR_BUSFAULTACT_OFS                          ( 1)                  /* BUSFAULTACT Offset */
#define SCB_SHCSR_BUSFAULTACT                              (0x00000002)          /*  */
/* SCB_SHCSR[SCB_SHCSR_USGFAULTACT] Bits */
#define SCB_SHCSR_USGFAULTACT_OFS                          ( 3)                  /* USGFAULTACT Offset */
#define SCB_SHCSR_USGFAULTACT                              (0x00000008)          /*  */
/* SCB_SHCSR[SCB_SHCSR_SVCALLACT] Bits */
#define SCB_SHCSR_SVCALLACT_OFS                            ( 7)                  /* SVCALLACT Offset */
#define SCB_SHCSR_SVCALLACT                                (0x00000080)          /*  */
/* SCB_SHCSR[SCB_SHCSR_MONITORACT] Bits */
#define SCB_SHCSR_MONITORACT_OFS                           ( 8)                  /* MONITORACT Offset */
#define SCB_SHCSR_MONITORACT                               (0x00000100)          /*  */
/* SCB_SHCSR[SCB_SHCSR_PENDSVACT] Bits */
#define SCB_SHCSR_PENDSVACT_OFS                            (10)                  /* PENDSVACT Offset */
#define SCB_SHCSR_PENDSVACT                                (0x00000400)          /*  */
/* SCB_SHCSR[SCB_SHCSR_SYSTICKACT] Bits */
#define SCB_SHCSR_SYSTICKACT_OFS                           (11)                  /* SYSTICKACT Offset */
#define SCB_SHCSR_SYSTICKACT                               (0x00000800)          /*  */
/* SCB_SHCSR[SCB_SHCSR_USGFAULTPENDED] Bits */
#define SCB_SHCSR_USGFAULTPENDED_OFS                       (12)                  /* USGFAULTPENDED Offset */
#define SCB_SHCSR_USGFAULTPENDED                           (0x00001000)          /*  */
/* SCB_SHCSR[SCB_SHCSR_MEMFAULTPENDED] Bits */
#define SCB_SHCSR_MEMFAULTPENDED_OFS                       (13)                  /* MEMFAULTPENDED Offset */
#define SCB_SHCSR_MEMFAULTPENDED                           (0x00002000)          /*  */
/* SCB_SHCSR[SCB_SHCSR_BUSFAULTPENDED] Bits */
#define SCB_SHCSR_BUSFAULTPENDED_OFS                       (14)                  /* BUSFAULTPENDED Offset */
#define SCB_SHCSR_BUSFAULTPENDED                           (0x00004000)          /*  */
/* SCB_SHCSR[SCB_SHCSR_SVCALLPENDED] Bits */
#define SCB_SHCSR_SVCALLPENDED_OFS                         (15)                  /* SVCALLPENDED Offset */
#define SCB_SHCSR_SVCALLPENDED                             (0x00008000)          /*  */
/* SCB_SHCSR[SCB_SHCSR_MEMFAULTENA] Bits */
#define SCB_SHCSR_MEMFAULTENA_OFS                          (16)                  /* MEMFAULTENA Offset */
#define SCB_SHCSR_MEMFAULTENA                              (0x00010000)          /*  */
/* SCB_SHCSR[SCB_SHCSR_BUSFAULTENA] Bits */
#define SCB_SHCSR_BUSFAULTENA_OFS                          (17)                  /* BUSFAULTENA Offset */
#define SCB_SHCSR_BUSFAULTENA                              (0x00020000)          /*  */
/* SCB_SHCSR[SCB_SHCSR_USGFAULTENA] Bits */
#define SCB_SHCSR_USGFAULTENA_OFS                          (18)                  /* USGFAULTENA Offset */
#define SCB_SHCSR_USGFAULTENA                              (0x00040000)          /*  */
/* SCB_CFSR[SCB_CFSR_IACCVIOL] Bits */
#define SCB_CFSR_IACCVIOL_OFS                              ( 0)                  /* IACCVIOL Offset */
#define SCB_CFSR_IACCVIOL                                  (0x00000001)          /*  */
/* SCB_CFSR[SCB_CFSR_DACCVIOL] Bits */
#define SCB_CFSR_DACCVIOL_OFS                              ( 1)                  /* DACCVIOL Offset */
#define SCB_CFSR_DACCVIOL                                  (0x00000002)          /*  */
/* SCB_CFSR[SCB_CFSR_MUNSTKERR] Bits */
#define SCB_CFSR_MUNSTKERR_OFS                             ( 3)                  /* MUNSTKERR Offset */
#define SCB_CFSR_MUNSTKERR                                 (0x00000008)          /*  */
/* SCB_CFSR[SCB_CFSR_MSTKERR] Bits */
#define SCB_CFSR_MSTKERR_OFS                               ( 4)                  /* MSTKERR Offset */
#define SCB_CFSR_MSTKERR                                   (0x00000010)          /*  */
/* SCB_CFSR[SCB_CFSR_MMARVALID] Bits */
#define SCB_CFSR_MMARVALID_OFS                             ( 7)                  /* MMARVALID Offset */
#define SCB_CFSR_MMARVALID                                 (0x00000080)          /*  */
/* SCB_CFSR[SCB_CFSR_IBUSERR] Bits */
#define SCB_CFSR_IBUSERR_OFS                               ( 8)                  /* IBUSERR Offset */
#define SCB_CFSR_IBUSERR                                   (0x00000100)          /*  */
/* SCB_CFSR[SCB_CFSR_PRECISERR] Bits */
#define SCB_CFSR_PRECISERR_OFS                             ( 9)                  /* PRECISERR Offset */
#define SCB_CFSR_PRECISERR                                 (0x00000200)          /*  */
/* SCB_CFSR[SCB_CFSR_IMPRECISERR] Bits */
#define SCB_CFSR_IMPRECISERR_OFS                           (10)                  /* IMPRECISERR Offset */
#define SCB_CFSR_IMPRECISERR                               (0x00000400)          /*  */
/* SCB_CFSR[SCB_CFSR_UNSTKERR] Bits */
#define SCB_CFSR_UNSTKERR_OFS                              (11)                  /* UNSTKERR Offset */
#define SCB_CFSR_UNSTKERR                                  (0x00000800)          /*  */
/* SCB_CFSR[SCB_CFSR_STKERR] Bits */
#define SCB_CFSR_STKERR_OFS                                (12)                  /* STKERR Offset */
#define SCB_CFSR_STKERR                                    (0x00001000)          /*  */
/* SCB_CFSR[SCB_CFSR_BFARVALID] Bits */
#define SCB_CFSR_BFARVALID_OFS                             (15)                  /* BFARVALID Offset */
#define SCB_CFSR_BFARVALID                                 (0x00008000)          /*  */
/* SCB_CFSR[SCB_CFSR_UNDEFINSTR] Bits */
#define SCB_CFSR_UNDEFINSTR_OFS                            (16)                  /* UNDEFINSTR Offset */
#define SCB_CFSR_UNDEFINSTR                                (0x00010000)          /*  */
/* SCB_CFSR[SCB_CFSR_INVSTATE] Bits */
#define SCB_CFSR_INVSTATE_OFS                              (17)                  /* INVSTATE Offset */
#define SCB_CFSR_INVSTATE                                  (0x00020000)          /*  */
/* SCB_CFSR[SCB_CFSR_INVPC] Bits */
#define SCB_CFSR_INVPC_OFS                                 (18)                  /* INVPC Offset */
#define SCB_CFSR_INVPC                                     (0x00040000)          /*  */
/* SCB_CFSR[SCB_CFSR_NOCP] Bits */
#define SCB_CFSR_NOCP_OFS                                  (19)                  /* NOCP Offset */
#define SCB_CFSR_NOCP                                      (0x00080000)          /*  */
/* SCB_CFSR[SCB_CFSR_UNALIGNED] Bits */
#define SCB_CFSR_UNALIGNED_OFS                             (24)                  /* UNALIGNED Offset */
#define SCB_CFSR_UNALIGNED                                 (0x01000000)          /*  */
/* SCB_CFSR[SCB_CFSR_DIVBYZERO] Bits */
#define SCB_CFSR_DIVBYZERO_OFS                             (25)                  /* DIVBYZERO Offset */
#define SCB_CFSR_DIVBYZERO                                 (0x02000000)          /*  */
/* SCB_CFSR[SCB_CFSR_MLSPERR] Bits */
#define SCB_CFSR_MLSPERR_OFS                               ( 5)                  /* MLSPERR Offset */
#define SCB_CFSR_MLSPERR                                   (0x00000020)          /*  */
/* SCB_CFSR[SCB_CFSR_LSPERR] Bits */
#define SCB_CFSR_LSPERR_OFS                                (13)                  /* LSPERR Offset */
#define SCB_CFSR_LSPERR                                    (0x00002000)          /*  */
/* SCB_HFSR[SCB_HFSR_VECTTBL] Bits */
#define SCB_HFSR_VECTTBL_OFS                               ( 1)                  /* VECTTBL Offset */
#define SCB_HFSR_VECTTBL                                   (0x00000002)          /*  */
/* SCB_HFSR[SCB_HFSR_FORCED] Bits */
#define SCB_HFSR_FORCED_OFS                                (30)                  /* FORCED Offset */
#define SCB_HFSR_FORCED                                    (0x40000000)          /*  */
/* SCB_HFSR[SCB_HFSR_DEBUGEVT] Bits */
#define SCB_HFSR_DEBUGEVT_OFS                              (31)                  /* DEBUGEVT Offset */
#define SCB_HFSR_DEBUGEVT                                  (0x80000000)          /*  */
/* SCB_DFSR[SCB_DFSR_HALTED] Bits */
#define SCB_DFSR_HALTED_OFS                                ( 0)                  /* HALTED Offset */
#define SCB_DFSR_HALTED                                    (0x00000001)          /*  */
/* SCB_DFSR[SCB_DFSR_BKPT] Bits */
#define SCB_DFSR_BKPT_OFS                                  ( 1)                  /* BKPT Offset */
#define SCB_DFSR_BKPT                                      (0x00000002)          /*  */
/* SCB_DFSR[SCB_DFSR_DWTTRAP] Bits */
#define SCB_DFSR_DWTTRAP_OFS                               ( 2)                  /* DWTTRAP Offset */
#define SCB_DFSR_DWTTRAP                                   (0x00000004)          /*  */
/* SCB_DFSR[SCB_DFSR_VCATCH] Bits */
#define SCB_DFSR_VCATCH_OFS                                ( 3)                  /* VCATCH Offset */
#define SCB_DFSR_VCATCH                                    (0x00000008)          /*  */
/* SCB_DFSR[SCB_DFSR_EXTERNAL] Bits */
#define SCB_DFSR_EXTERNAL_OFS                              ( 4)                  /* EXTERNAL Offset */
#define SCB_DFSR_EXTERNAL                                  (0x00000010)          /*  */
/* SCB_PFR0[SCB_PFR0_STATE0] Bits */
#define SCB_PFR0_STATE0_OFS                                ( 0)                  /* STATE0 Offset */
#define SCB_PFR0_STATE0_M                                  (0x0000000f)          /*  */
#define SCB_PFR0_STATE00                                   (0x00000001)          /*  */
#define SCB_PFR0_STATE01                                   (0x00000002)          /*  */
#define SCB_PFR0_STATE02                                   (0x00000004)          /*  */
#define SCB_PFR0_STATE03                                   (0x00000008)          /*  */
#define SCB_PFR0_STATE0_0                                  (0x00000000)          /* no ARM encoding */
#define SCB_PFR0_STATE0_1                                  (0x00000001)          /* N/A */
/* SCB_PFR0[SCB_PFR0_STATE1] Bits */
#define SCB_PFR0_STATE1_OFS                                ( 4)                  /* STATE1 Offset */
#define SCB_PFR0_STATE1_M                                  (0x000000f0)          /*  */
#define SCB_PFR0_STATE10                                   (0x00000010)          /*  */
#define SCB_PFR0_STATE11                                   (0x00000020)          /*  */
#define SCB_PFR0_STATE12                                   (0x00000040)          /*  */
#define SCB_PFR0_STATE13                                   (0x00000080)          /*  */
#define SCB_PFR0_STATE1_0                                  (0x00000000)          /* N/A */
#define SCB_PFR0_STATE1_1                                  (0x00000010)          /* N/A */
#define SCB_PFR0_STATE1_2                                  (0x00000020)          /* Thumb-2 encoding with the 16-bit basic instructions plus 32-bit Buncond/BL but no other 32-bit basic instructions (Note non-basic 32-bit instructions can be added using the appropriate instruction attribute, but other 32-bit basic instructions cannot.) */
#define SCB_PFR0_STATE1_3                                  (0x00000030)          /* Thumb-2 encoding with all Thumb-2 basic instructions */
/* SCB_PFR1[SCB_PFR1_MICROCONTROLLER_PROGRAMMERS_MODEL] Bits */
#define SCB_PFR1_MICROCONTROLLER_PROGRAMMERS_MODEL_OFS     ( 8)                  /* MICROCONTROLLER_PROGRAMMERS_MODEL Offset */
#define SCB_PFR1_MICROCONTROLLER_PROGRAMMERS_MODEL_M       (0x00000f00)          /*  */
#define SCB_PFR1_MICROCONTROLLER_PROGRAMMERS_MODEL0        (0x00000100)          /*  */
#define SCB_PFR1_MICROCONTROLLER_PROGRAMMERS_MODEL1        (0x00000200)          /*  */
#define SCB_PFR1_MICROCONTROLLER_PROGRAMMERS_MODEL2        (0x00000400)          /*  */
#define SCB_PFR1_MICROCONTROLLER_PROGRAMMERS_MODEL3        (0x00000800)          /*  */
